{
    "e3e5e685f419867c":{
        "title":"Senior Fullstack Engineer",
        "company":"eBay Inc.",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e3e5e685f419867c&atk=",
        "description":"JOB ID: R0032439\nPOSITION: Software Engineer - FullStack Engineer\nLooking for a company that inspires passion, courage and imagination, where you will shape the future of global commerce? Want to influence how millions of people buy, sell, connect, and share around the world? If you’re interested in joining a purpose driven community that is dedicated to creating an ambitious and inclusive workplace, join eBay – a company you can be proud to be a part of.\nORGANIZATION: StubHub, www.stubhub.com (an eBay company NASDAQ: EBAY)\nStubHub is the world's largest ticket marketplace, enabling fans to buy and sell tickets to tens of thousands of sports, concert, theater and other live entertainment events. StubHub reinvented the ticket resale market in 2000 and continues to lead it through innovation. The company's unique online marketplace, dedicated solely to tickets, provides all fans the choice to buy or sell their tickets in a safe, convenient and highly reliable environment. All transactions are processed and delivered by StubHub and backed by the company's FanProtect Guarantee™ processing a ticket every second today with billions of ticket sales each year globally. Company partners MLB, AEG, ESPN and many leading teams such as the San Francisco Giants and University of Texas, along with over 60 other teams in MLB, NBA, NHL and NCAA.\nOur Values\nStubHub One – We act as one team in pursuit of connecting people through inspiring event experiences.\nAt StubHub, we are:\nDriven – We strive for excellence – constantly improving our game\nCourageous – We are bold & not afraid to challenge the status quo\nInventive – We see what others don’t & pioneer new paths\nRichly Diverse – We recognize & respect everyone as a unique individual\nBrand – We experience the world through StubHub.\nRequired Skills for Senior Engineer:\n5yrs of experience in Java coding\nSping, Springboot, hibernate\nA plus if know kafka, activeMQ or rabbitMQ, or other enterprise BUS or messaging systems\nSQL database ( oracle, mysql, etc) a plus if familiar with non relational database and the understanding on index and use cases for those database.\nUnderstand relational data model and SQL queries\nFamiliar with development tools\nGitHub\nintelliJ\nJenkins\n2-3 years’ experience in front end development with the following skills:\nStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\nThorough understanding of React.js and its core principles ( Component lifecycle )\nExperience with newer specifications of EcmaScript\nFamiliarity with Server Side Rendering\nExperience with popular React.js workflows (such as Flux or Redux) and data structure libraries (e.g., Immutable.js) is a plus\nFamiliarity with RESTful APIs\nKnowledge of modern authorization mechanisms, such as JSON Web Token\nFamiliarity with modern front-end build pipelines and CSS preprocessing tools ( such as SASS or LESS )\nExperience with common front-end development tools such as Babel, Webpack, NPM, etc.\nAbility to articulate projects and design clearly\nAbility to learn and adapt quickly to changes\nProactive and sense of ownership in work and tasks assigned\nWork well with others and have a can do, helpful attitudes towards others, but can prioritize\nAffirmative action and equal opportunity employer\nStubHub is a Subsidiary of eBay.\neBay Inc. is an equal opportunity employer. All applicants with relevant experience will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.\nFor more information see:\nEEO is the Law Poster\nEEO is the Law Poster Supplement\nStubHub is a Subsidiary of eBay.\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\nView our privacy policy\nView our accessibility info\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.\nFor more information see:\nEEO is the Law Poster\nEEO is the Law Poster Supplement",
        "tags":[
            "JavaScript",
            "CSS",
            "Java",
            "React",
            "Spring",
            "MySQL",
            "SQL",
            "Oracle",
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e3e5e685f419867c"
    },
    "4533dc185b9a89e5":{
        "title":"Senior Software Engineer - Fullstack",
        "company":"New Relic",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=4533dc185b9a89e5&atk=",
        "description":"New Relic\nSenior Software Engineer - Full Stack\nSan Francisco, California\n\nYour Opportunity\nAt New Relic we're crafting world class interactive experiences and services to help customers answer their most important questions by helping them visualize, explore, and reason about their ops, application and customer data. It is a good day when we know we’ve helped make their internet applications more reliable and their businesses more successful. You should come help us!\n\nWhat You’ll Do\nWe are looking for a Full Stack Engineer with a strong interest in building, deploying, and operating back-end tools and services that process enormous quantities of data in performant ways. Come help us build, scale, and improve a new product!\nYou’ll work with an amazing newly-formed team, designing and building solutions from a variety of technologies. You’ll have the opportunity to work technical and scalability challenges, while also gathering feedback from customers to improve their experience.\n\nYour Qualifications\nMust-Have:\n3 - 5 years building software using a language such as Java, Go, or Python.\nTrack record of delivering software products and features.\nInterest and ability to learn new technologies.\nNice-to-Have:\nExperience with other programming languages/environments such as Ruby/Rails, C, .NET.\nTrue full-stack experience from front-end development to SQL/non-SQL databases.\nExperience developing with and operating large-scale systems such as Cassandra, ElasticSearch, Kafka, and Zookeeper, and container systems such as Docker or Kubernetes.\nDevOps experience in deploying, monitoring, and supporting large cloud-based systems.\nExperience building high-throughput data processing pipelines.\nStrong concern for quality, resilience, performance, reliability, continuous integration, and deployment.\n\nPlease note that visa sponsorship is not available for this position.\n\nOur Office\nOur office is in the tech mecca of San Francisco, with easy commute access and a plethora of good eats and great coffee. We provide competitive compensation including equity and big-company benefits (medical, dental, etc.)—all while maintaining the energy, agility and fun of a start-up.\n\nAbout Us\nNew Relic (NYSE: NEWR) is the industry’s largest and most comprehensive cloud-based instrumentation platform built to create more perfect software. The world’s best software and DevOps teams rely on New Relic to move faster, make better decisions and create best-in-class digital experiences. If you run software, you need to run New Relic. We’re proudly trusted by more than 50% of the Fortune 100.\nFounded in 2008, we’re a global company focused on building a culture where all employees feel a deep sense of belonging, where every ‘Relic’ can bring their whole self to work and feel supported and empowered to thrive. We’re consistently recognized as a distinguished employer and are committed to building world-class products and an award winning culture. For more information, visit newrelic.com.\n\nOur Hiring Process\nIn compliance with applicable law, all persons hired will be required to verify identity and eligibility to work and to complete employment eligibility verification. [Background Check Statement — Remove for NYC, Barcelona, Tel Aviv] Note: Our stewardship of the data of thousands of customers’ means that a criminal background check is required to join New Relic.\nWe will consider qualified applicants with arrest and conviction records based on individual circumstances and in accordance with applicable law including, but not limited to, the San Francisco Fair Chance Ordinance.\nHeadhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. New Relic does not accept unsolicited headhunter and agency resumes, and will not pay fees to any third-party agency or company that does not have a signed agreement with New Relic.\nNew Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities (or disability), age, sexual orientation, veteran status, or any other characteristic protected by law.\n\nInterested in the details of our privacy policy? Read more here: https://newrelic.com/termsandconditions/applicant-privacy-policy\n#LI-PY1",
        "tags":[
            "Java",
            "Python",
            "Ruby",
            "Scala",
            ".NET",
            "SQL",
            "Elasticsearch",
            "RDS",
            "Cassandra"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=4533dc185b9a89e5"
    },
    "1651563954b85c2c":{
        "title":"Data Visualization Engineering Manager - Simulation",
        "company":"Cruise",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=1651563954b85c2c&atk=",
        "description":"We're the driverless car company.\n\nWe believe in improving people's lives by making transportation safer, more accessible, and more convenient. We're building the world's most advanced software ( https://www.driverless.id/news/video-breakdown-gms-unicorn-cruise-shows-off-level-4-skills-sf-passing-uber-maybe-waymo-0176031/ ) to fuel the driverless cars that safely connect people to the places, things, and experiences they care about.\n\nWe seek and embrace diversity in all of its forms. We continuously push ourselves to think differently and take ownership wherever it's needed. This is a place for dreamers and doers to succeed. If you share our passion for achieving what some say is impossible, join us.\n\nAbout the role:\nWe are looking for talented Engineering Managers to lead, manage, and grow an engineering team in a fast-paced environment.\n\nHow do you compare two different algorithms for a self driving car that addresses cases that only happen once in 100,000 miles? 200,000 miles? And how do you do this without driving those miles in the real world?\n\nSimulations of course. But here is the tricky part. Once you run all the simulations how to analyze the results in an intuitive manner? It isn't just about pass fail but more about metrics and lots of them. To drive results and find the root causes, Cruise needs a solid front end engineering manager to enable data visualization across Simulation.\n\nAs the Data Visualization Engineering Manager you will build and manage a team of front end engineers enabling the rest of the engineering organization to dive deep into the data and metrics generated during simulated miles. It isn't enough to know if the car \"passed\" a test scenario during a simulation run. Rather, one must know how it passed, how did the various parts of the AV stack perform and where does it need to improve. This involves extensive data analysis and visualization. You and your team will build out the platform enabling the machine learning and data analysis teams to analyze experiments.\n\nIf you are passionate about building frameworks and toolsets to enable engineers to play with data quickly and without a need for them to write their own UI components then this is the team for you. Our goal is to make data analysis as easy as drag and drop regardless of the size and complexity of the data set.\n\nOrganizationally you are responsible for growing and recruiting the team, owning the vision, thinking big and innovating new ways to reduce the time needed to understand and root cause analyze results of simulations. Furthermore, you'll be working in a fast paced high growth environment requiring you to motivate and cultivate talent across the organization.\n\nAt Cruise, we believe in managers who remain deeply technical, and understand the challenges their teams are facing, even though they may not be the technical lead or contributing code day to day. Our managers coach their teams to success, shield their teams from distractions, and help publicly celebrate wins.\n\nDay-to-day responsibilities include:\n\nDirect oversight of engineers building visualization tools for other engineering teams\nWork with technical lead(s) to set the technical direction for the team, and anticipate strategic and scaling-related challenges\nDeliver highly functioning front end software\nWork with Engineering Director(s), Technical Product Managers, and Technical Program Managers to create and execute on a roadmap for your team\nDrive software engineering best practices both within your team, and create tooling which encourages these across the company\nConduct performance reviews, identify top performers, and support their growth into Engineering Management or Technical Leadership roles\nFoster a healthy and collaborative culture, and a high output team\nHelp define, build, and embody Cruise engineering culture and principles\nInvest heavily in recruiting by working closely with recruiters, screening candidates, and identifying opportunities for external engagement to improve the Cruise engineering brand\n\nYou should apply for this role if you have the following qualifications:\n\n\n2+ years experience managing teams who support scalable UI frameworks\n5+ years experience in software engineering roles (including frontend, backend, or fullstack)\nExperience building performance critical front end systems (huge plus if its data analysis)\nSelf motivation and passion to lead your teams, encourage best practices, and constantly improve\nMaster's degree in CS or equivalent industry experience.\nPassionate about fully owning a data product experience, from developing novel visualization techniques to testing and ensuring robustness of the application in production.\nPassion for JavaScript and the Web as a platform, reusability, componentization, and scale.\n\nBonus points!\n\n\nExperience working on Simulation or Robotics\nExperience with modern C++11 development\nExperience with machine learning and experimentation frameworks\nExperience with graphics, spatial geometry, optimizing complex algorithms, making this faster!\nExperience with fast growth companies and recruiting / retaining the best talent\n\nPerks of being a Cruiser:\nWhile doing meaningful work is the best perk of all, we also offer the following programs and benefits to support the extraordinary humans who serve as the backbone in making our robot cars go:\n\n\nThe opportunity to solve difficult problems that have immediate and valuable real-world applications\nCompetitive salary and benefits including 401k Cruise matching program to help you meet your long-term financial goals\nMedical / dental / vision, AD+D and Life\nPaid parental leave so you can spend time with the newest addition(s) to your family's fleet\nHealth and Wellness reimbursement\nFlexible vacation and 10 paid company holidays\nState of the art equipment for your workstation\nHealthy lunch, snacks, dinner\n\nTake a glimpse through the lens of a Cruiser on our LinkedIn Page ( https://www.linkedin.com/company/cruise-automation-inc-/ )\n\nGM Cruise LLC provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, gender identity or expression, veteran status, or genetics. In addition to federal law requirements, GM Cruise LLC complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Pursuant to applicable laws, we will consider for employment qualified applicants with arrest and conviction records. And if you believe that you will need any type of accommodation, please let us know.\n\nPrivacy Statement ( https://getcruise.com/privacy )",
        "tags":[
            "JavaScript",
            "Java",
            "C++",
            "Scala",
            "RDS",
            "AWS",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=1651563954b85c2c"
    },
    "aee3126c38df8522":{
        "title":"Software Engineer (Fullstack), Caviar",
        "company":"Square",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=aee3126c38df8522&atk=",
        "description":"Job Description\n\nWe are looking for talented a Fullstack Engineer to help make Caviars website (trycaviar.com) the most compelling and intuitive way to order great food. As an engineer on the Caviar Order Experience team, you will be responsible for helping hungry diners find and order delicious food effortlessly. To accomplish that, you will collaborate with people across engineering, product, and design to develop a diner experience that is beautiful and engaging.\nYou will:\nWork on and own large parts of Caviars growing web platform at trycaviar.com\nBuild intuitive and engaging web experiences that are clean, pragmatic, and forward-thinking\nDevelop features across the entire technical stack, from the database to the front-end, with an eye towards maintainability and scalability\nCollaborate closely with product, design, marketing, and other engineers\nLearn from and contribute to our community of world-class engineers in a balanced, supportive, and fun work environment\nMake hungry people happy\n\nQualifications\n\nYou have:\nStrong knowledge of, and experience with, modern HTML, CSS, and JavaScript\nExperience building responsive, component-based web apps with modern JavaScript front-end frameworks (e.g., Ember, React, Vue)\nExperience in any server-side technology and/or framework (e.g., Ruby on Rails, Python, Java)\nExperience testing your code (e.g. QUnit, Mocha, Jasmine, RSpec)\n5+ years professional experience.\nAnd even better:\nExperience in or desire to learn Ruby on Rails and React\nThoughtfulness about what youre building and why, not just how\nInterest in working in a product-focused environment\nA real passion for great food!\nTechnologies we use and teach:\nRuby, Rails\nES6, Typescript, React, Ember, Sass, and other web app frameworks\nAWS, Docker, Heroku\nAdditional Information\n\nAt Square, our purpose is to empower – within and outside of our walls. In order to build the best tools for the businesses and customers we support all over the world, we have to start at home with a workforce as diverse and empowered as our sellers. To this end, we take great care to evaluate all employees and job applicants equally, based on merit, competence, and qualifications. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage candidates from all backgrounds to apply and always consider qualified applicants with arrest and conviction records, in accordance with the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible.",
        "tags":[
            "JavaScript",
            "HTML",
            "CSS",
            "Java",
            "Python",
            "TypeScript",
            "Ruby",
            "Scala",
            "React",
            "RDS",
            "AWS",
            "Heroku"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=aee3126c38df8522"
    },
    "e6285a93994d1609":{
        "title":"Fullstack Engineer",
        "company":"Twitch Interactive, Inc.",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e6285a93994d1609&atk=",
        "description":"Proficient coder in one or more of the following: Go, Python, Ruby, C, C++, Java, Scala2+ years of experience building consumer-facing web applications at scaleExperience working in a service-oriented or microservice architectureExperience operating at all levels of the stack, debugging problems from UI to backend systemsStrong organizational and communication skills\n\nTwitch has over 100 million users and creators are at the center of our success. The Creator Experience team is responsible for building products that help our creators grow their business. Last year, we shipped Achievements, Stream Summary and Raids to positive reception. This year, we are scaling the team to bring even more exciting products to broadcasters.\n\nWe’re looking for engineers that love delighting people with incredible products and user experiences. On this team, you’ll work closely with our other engineering and product teams to craft a beautiful and engaging product, collect feedback, and iterate quickly. We value expertise in building applications for the Web, comfort working throughout the stack, and an understanding of product concerns.\n\nFull-stack development experienceExperience setting up and maintaining AWS infrastructureYou are a Twitch user yourself\nTwitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at: http://twitch.tv\n\nWe are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
        "tags":[
            "Java",
            "Python",
            "C++",
            "Ruby",
            "Scala",
            "RDS",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e6285a93994d1609"
    },
    "9a2a0790ff643b31":{
        "title":"Fullstack Engineer - Growth",
        "company":"Twitch",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=9a2a0790ff643b31&atk=",
        "description":"Twitch’s Growth team builds features that attract, engage, and retain our global community of 100 million monthly watchers and counting. As a Fullstack Engineer for the Growth team, you will work seamlessly across framework boundaries and product lines to drive every single Twitch visitor towards habitual viewership and help our creators make a living doing something that they love. We’re looking for expertise in both front end web programming (JS frameworks, tooling, modern browser awareness) and server side programming (web architecture, SOA, database architecture).\n\nTwitch is uniquely positioned to dictate the future of multiplayer entertainment. If this future excites you, come join us!\nResponsibilities\nDesign, build, and maintain performant, responsive and delightful web features\nSpecify, implement, and maintain the services that will power these features\nEmbrace and champion engineering best practices within your group and Twitch\nProduce clean, high quality code, tests, and documentation\nActively engage in code and design reviews with peers and partners\nContribute engineering input and feedback into product planning processes\nPartner with fellow engineering teams to deliver on complex initiatives together\nRequirements\n4+ years experience engineering full stack web applications\nProficiency with HTML, CSS, and expertise in at least one modern JavaScript framework\nFamiliarity with scalability, concurrency, API design, data modeling, and distributed systems fundamentals\nAbility to apply quantitative reasoning and UX design principles to building applications\nStrong organizational and communication skills\nBonus Points\nExperience in growth engineering or similar product-oriented discipline\nExperience with React.js and GraphQL\nExperience writing Go in production systems\nYou are a Twitch user yourself\nPerks\nMedical, Dental, Vision & Disability Insurance\n401(k)\nMaternity & Parental Leave\nFlexible PTO\nCommuter Benefits\nAmazon Employee Discount\nMonthly Contribution & Discounts for Wellness Related Activities & Programs (e.g., gym memberships, off-site massages, etc.)\nBreakfast, Lunch & Dinner Served Daily\nFree Snacks & Beverages\n#LI-SM1\n\nLaunched in 2011, Twitch is a global community that comes together each day to create multiplayer entertainment: unique, live, unpredictable experiences created by the interactions of millions. We bring the joy of co-op to everything, from casual gaming to world-class esports to anime marathons, music, and art streams. Twitch also hosts TwitchCon, where we bring everyone together to celebrate, learn, and grow their personal interests and passions. We’re always live at Twitch. Stay up to date on all things Twitch on Linkedin, Twitter and on our Blog.\n\nWe are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
        "tags":[
            "JavaScript",
            "HTML",
            "CSS",
            "Java",
            "Scala",
            "React",
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=9a2a0790ff643b31"
    },
    "0bf7cac852e4e343":{
        "title":"Engineering Manager",
        "company":"Inkling",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=0bf7cac852e4e343&atk=",
        "description":"Inkling is a mobile learning enablement platform built for employees who interact directly with their customers. It helps these frontline workers access the training and resources they need to quickly get up to speed in their roles at any time, from anywhere—and deliver excellent customer experiences.\n\nAt Inkling, we’re committed to helping the modern frontline workforce do their best work by making learning accessible—and are looking for top talent that shares our passion.\n\nThe Role:\nAs an Engineering Manager in the Inkling’s Web Applications team, you’ll lead a team of talented backend and front-end web engineers as they build our Knowledge and Learning Pathways applications. These applications allow our customers to develop and distribute mission-critical training and reference materials across their huge, geographically distributed workforces.\n\nResponsibilities:\n\nManage a wonderful team of dedicated and talented fullstack web engineers as well as coach and mentor junior engineers.\nBuild new features and maintain the existing functionality in Inkling’s suite of web applications using technologies like Fargate, Lambda, Express, React, Redux, and more.\nWork closely with counterparts from the Product and Design teams to plan elegant and delightful solutions that your team will take on.\n\nRequirements:\n\n5+ years of engineering experience and 1+ years of engineering management experience.\nPrior experience building and releasing complex web applications using either JavaScript or Python.\nExcellent ability to communicate, organize, delegate, and give honest feedback.\nYou’re ready to roll up your sleeves and work through technical challenges with your team.\nYou have great coding abilities, are able to design complex systems, and can help others product great technical designs also.\nYou care deeply about building high-quality, beautiful, intuitive applications.\n\nBonus Points:\n\nYou have startup experience.\n\nWhat we offer:\n\nFlexible PTO\nMedical, Dental and Vision Benefits\nCatered Lunch and Dinner\nMonthly Wellness Reimbursement\nMonthly Cell Phone and Data Reimbursement\n401(k) Program\nCommuter Benefits\nNear Public Transportation\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "tags":[
            "JavaScript",
            "Java",
            "Python",
            "React"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=0bf7cac852e4e343"
    },
    "d828deb83fc95a77":{
        "title":"Staff Software Engineer, Systems",
        "company":"Twitter",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=d828deb83fc95a77&atk=",
        "description":"Who we are:\n\nThe Product Insights and Experimentation (PIE) team builds world-class engineering products. We make user behavior visible and clear in order to enable great product decision making. The team’s most important roles are to enable fast, rigorous product experimentation and to provide automated tools to generate insights and understanding of our users.\n\n\nResponsible for experimentation (A/B testing) methodology and implementation\nUnderstanding user behavior with great visualization and analysis tools\n\n\nTwitter has a very data-driven culture and experimentation is at the center of product decisions. PIE engineers regularly participate in discussions with the most senior leaders at Twitter to understand how experimentation can further increase the rate of innovation. PIE does its work with a combination of scalable open-source technologies including Scala, Scalding, Hadoop, Presto, Heron just to name a few. We also like pie.\n\nWho you are:\n\nYou want to be part of a community of the most talented, forward-thinking engineers in the industry. Learning, working with, and contributing to useful open-source projects excites you. Experience with Hadoop, Spark, Hive, Scalding, Parquet, or similar technologies is a strong asset. You have experience in front-end web technologies such as React, AngularJS and Javascript. You love to write code and have notable skill in Scala, Java, Haskell, C++ or another major compiled language. You likely have experience in distributed systems, databases, networking fundamentals, or performance analysis.\nYou have the following skills and experience:\n\nYou’ve shipped a major project from inception to production\nExperience in a data-heavy environment (Hadoop, Spark, etc)\nDeveloping and maintaining well tested and reliable software\nYou’ve mentored other engineers and have a deep desire to continue to do so\nYou can code well in a jvm based language (Scala, Java, Kotlin, etc)\nYou care about people:\n\nYou have fundamental respect for all people\nYou are in awe of the ability to understand and help 100s of millions of people\nYou are kind, collaborative, inclusive and self-aware\nBonus points:\nReal-time data pipelines\nStatistics background or experience with controlled experiments\nFunctional programming experience or interest\nExperience with fullstack development in web applications (including front-end visualization)\n\n\nDiverse Team:\n\nProduct Insights and Experimentation is diverse and we value that. We are not looking for people who fit some historical Silicon Valley mold. We want to maintain and increase our diversity so whoever you are and wherever you come from, if you are a great engineer we would be honored if you applied.\n\n\nWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.",
        "tags":[
            "JavaScript",
            "Java",
            "C++",
            "Kotlin",
            "Scala",
            "Angular",
            "React",
            "Spark",
            "Hadoop"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=d828deb83fc95a77"
    },
    "b6187e669ead04c1":{
        "title":"Senior Fullstack Software Engineer (Core Team)",
        "company":"Shippo",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=b6187e669ead04c1&atk=",
        "description":"Come join Shippo’s Core team (Hydra)! We focus on key technologies that power our shipping platform (yes, like shipping real things). This includes services like our rating engine, tracking service, data pipeline for analytics, billing, and ensuring our Shippo APIs are reliable and scalable.\n\nYour role as a full stack unicorn will provide you end-to-end ownership over design and implementation of the Core services, integrating with our frontend interfaces as well as the performance and scalability of the systems and driving change to push our technology and teams further. It's a lot, but sounds cool right?\n\nWe really care about making Shippo a great place to work so you can read more about what that means and how that impacts our day to day on our\nabout us [https://github.com/goshippo/about-us] page. Also, here’s some\ninsider info\n[https://docs.google.com/document/d/1ScegJ05KSpKpF66TAmK-ir8-zHdrD2MbFJaMGf0CGfI/edit?usp=sharing] on the hiring manager.\n\n\nCollaborate with business teams and provide early input to new product ideas and functionality\nDesign, implement, test, and deploy software services with high SLAs and that can handle millions of requests a day\nDrive good scalability and maintainability practices through microservices adoption, decoupling of concerns and data model, queuing of jobs and application layering and container-based software distribution.\nVerify and ensure performance and correctness of systems in response time and throughput.\nExpand and enhance our CI/CD pipeline for smooth and safe production releases via automated testing and verification.\nDesign and maintain database schema for large scale and performant services\nArchitect systems and refactor existing systems for optimal performance and reuse\nDrive peer reviews and testing and contribute to automated test suites and in design reviews for new features, products, and systems\n\nREQUIREMENTS\n\n\nCoding experience in server-side programming languages (e.g. Go, Python, Java, Ruby) as well as database languages (SQL)\nExperience working with server-side MVC frameworks (e.g. Django, .NET, Spring, Rails, Phoenix)\nCoding experience in front-end programming Javascript Frameworks (e.g. React, Redux Ember, Angular, Meteor)\nSolid understanding of object-oriented programming and familiarity with various design and architectural patterns\nExperience integrating with APIs that use REST, gRPC, SOAP and other technologies\nExceptional verbal, written, and interpersonal communication skills\nDeep understanding of customer needs and passion for customer success\nExhibit core behaviors focused on craftsmanship, continuous improvement, and team success\nDriven by intrinsic motivators and encourage psychological safety among the team\n5+ years of experience in software development\nBS or MS degree in Computer Science or equivalent experience\n\nPREFERRED\n\n\nFamiliarity with Go programming language\nExperience with Django\nPast experience and success building scalable APIs or services\nInterest and experience in performance tuning, concurrency, microservices, security, data pipelines, and web stack\nExperience with automated UI and System testing frameworks and tools such as Selenium, Ghost Inspector, Runscope, Testim, Browserstack etc\nExperience with DevOps tooling such as Docker, Terraform, CircleCI, SumoLogic, PagerDuty etc\nExperience with AWS/Cloud services such as EC2, S3, Lambda, Route 53, Cloud Formation, Cloudflare, Elastic Beanstalk, IAM etc.\nExperience with billing and/or invoice systems (Stripe, Braintree, Zoho, Zuora, Chargebee etc)\n\nBENEFITS\n\n\nBenefits: medical, dental, vision (90% covered by the company, incl. dependents)\nFlexible PTO + work hours\n3 VTO days for ShippoCares volunteering events\n$2,500 yearly learning stipend for your personal growth\nFree lunch / drinks / snacks\nFun team events outside of work hours - happy hours, “escape the room” adventures, hikes, and more!\n\nABOUT SHIPPO\n\nShippo bridges the distance between businesses and their customers. As free and fast shipping become the norm, better access to shipping is a competitive advantage for businesses. Through Shippo, e-commerce businesses are able to connect to multiple shipping carriers around the world from one web app or API. Businesses can get shipping rates, print labels, automate international documents, track shipments, and facilitate returns.\n\nOur team hails from all over the world. We bring our different backgrounds and perspectives together to solve unique shipping problems and help bring businesses and their customers closer.\n\nJoin us to build the foundations of something great, roll up your sleeves and get important work done everyday. Founded in 2013, we are a proud team based out of San Francisco. Shippo is backed by top tier VCs including Bessemer Venture Partners, Union Square Ventures, Uncork Capital, VersionOne Ventures, FundersClub and others.",
        "tags":[
            "JavaScript",
            "Java",
            "Python",
            "Ruby",
            "Scala",
            "Angular",
            "React",
            ".NET",
            "Spring",
            "Django",
            "SQL",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=b6187e669ead04c1"
    },
    "717781e4860cf7f6":{
        "title":"Full Stack Engineer",
        "company":"Chewse",
        "location":"San Francisco, CA 94102",
        "apply_url":"https://www.indeed.com/rc/clk?jk=717781e4860cf7f6&atk=",
        "description":"Fullstack Software Engineer\n\n\nJoin a small team of engineers to build a highly sought-after product in the B2B / Enterprise space\nJoin a company that exemplifies authenticity, community, and connection from our Headquarters in San Francisco\nWork across the entire stack including: Python/Django, VueJS, Postgres DB, Deployed on Heroku\n\nChewse is a diverse, culture-first, and successful startup dedicated to addressing every offices catering needs. We deliver high-quality meals sourced from top local restaurants and artisans for office gatherings with a goal of bringing our customers together through food. Simply put - teams that eat together, thrive together. Were highly-successful, have raised over $33M via leading VCs, and are expanding across the US!\n\nAs part of our continued growth, Chewse is looking for a Fullstack Software Engineer to expand our small team of engineers. In this full-time role, youll be paramount in to bringing our platform up to speed to tackle some tough technical problems. We have a mixture of logistic (last mile delivery) and data modeling challenges to support our scaling company.\n\nCurrent Tech Stack: Python/Django, VueJS, Postgres DB. Deployed on Heroku.\n\nAs a Fullstack Engineer at Chewse, you will:\n\nSee the bigger picture and champion the design, architecture and development of the client side and backend code to build clean APIs and UI\nBuild out a growing feature-set, ensuring that customer feedback is being incorporated and our platform is fast and relient\nEnsure the best possible performance, quality, and responsiveness of applications and identify bottlenecks and bugs, and devise solutions to address these issues\nDive into our legacy code to determine what's worth keeping and what we should rewrite seeing the big picture and connecting all the pieces together\n\nOur ideal Fullstack Engineer will have:\n\n3+ years of software development experience with a focus on web development\nExperience building RESTful APIs\nExperience working with web frameworks like DJango, Rails, Express, etc.\nStrong Javascript/HTML/CSS\nFamiliarity with modern Javascript libraries like React.js, Vu.js, etc.\nSolid understanding SQL database development (NoSQL a Plus)\n\nAs a Fullstack Engineer at Chewse, you will own your success within an organization thats unabashedly focused on love excellence in everything we do. Our culture-first approach has created a great place to work and grow, and we have industry-leading diversity and retention rates to show for it. We offer a great salary, all the usual benefits, plus many unique perks including; catered lunches, team events, individual professional development funds, a clear career path for every role, and flexible time off with a company average of 4 weeks taken.\n\nAPPLY NOW or find out more about us at https://www.chewse.com\n\nWe believe the happiest teams eat like family. That human connection can come from sharing a great meal together. That everything we do should be precision and care. That our work here is a microcosm of how an interconnected world might look and feel.\n\nIf this resonates with you, join us in helping foster that same sense of community and authentic connection with our clients everywhere.",
        "tags":[
            "JavaScript",
            "HTML",
            "CSS",
            "Java",
            "Bash",
            "Python",
            "React",
            "Django",
            "SQL",
            "Heroku"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=717781e4860cf7f6"
    },
    "e3c7f353752eb920":{
        "title":"Software Engineer",
        "company":"Minted",
        "location":"San Francisco, CA 94133",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e3c7f353752eb920&atk=",
        "description":"We are looking for a full stack software engineer to be a part of our E-commerce engineering team. As a member of this team, you will be building features that will help users shop, discover, and interact with a wide variety of products on Minted.com.\n\nAt Minted engineering we marry design with technology to deliver unique products that are beautiful and co-created by our artist community and our customers. Our engineers take on multiple roles and challenges not defined by titles, and we have a strong culture of mentorship and promoting from within, as well as project roadmaps that enable us to cross-train and learn from one another. We are a metrics-driven organization and we work hard to make sure every project we do is measurably impactful. We strive to maintain the balance between building out new features and scaling our platform while staying agile in a fast-moving environment.\nYou will:\nOwn high impact and high visibility fullstack engineering projects end to end that support Minted’s core e-commerce shopping funnel\nIdentify and address bugs, performance bottlenecks, and other issues impacting our customers\nBuild and maintain backend architecture for our high-traffic e-commerce platform that is scalable, extensible, and efficient in usage of system resources\nWork with a wide variety of languages, frameworks, and technologies like Python, Javascript, PHP, ES6, React, Redux, JSX, Backbone, ElasticSearch, Kafka, Beam, and AWS\nEnsure a high-quality codebase with design and code review as well as automated test coverage\nYou are:\nAble to juggle competing priorities in a fast-moving dynamic environment\nObsessed with writing clean reusable code\nExcited about building excellent, web-based user experiences\nYou have:\n1+ years of computer science related work experience\nSolid foundation in computer science, including data structures, algorithms, runtime performance and software design\nA strong work ethic and desire to learn new systems\nBonus: Experience with React, Redux, Backbone, HTML, CSS\nBonus: Experience with SQL, database modeling, and ORMs\nBonus: Experience with ElasticSearch, Kafka, Flink, AWS\nAbout Minted\n\nMinted is a design platform whose mission it is to bring the best in independent design to consumers everywhere. The company's art, stationery, and textiles products have reached over 40 million homes worldwide.\n\nMinted uses technology to bring unique, best-selling design to market at scale. Using its crowdsourcing technology, consumers are empowered to vote for the designs they love and want to see sold, ensuring that Minted always sells continuously fresh and trend-forward product. The winning designs are manufactured by Minted, enabling artists from around the world to share and sell their work while letting Minted do the rest. Since launch in 2007, the company has expanded to serve consumers in new categories including wall art, textiles, digital content and home decor, as well as serve major retailers and consumer products brands with data-backed design through licensing and wholesale partnerships.\n\nMinted is headquartered in San Francisco, CA and currently employs 350+ full-time employees plus additional temporary workers during the holiday season. The company has raised over $300M from top-tier investors including Benchmark Capital, T. Rowe Price, Permira, Ridge Ventures, Technology Crossover Ventures, and Norwest Venture Partners. Angel investors include Marissa Mayer, Jeremy Stoppelman, Julia & Kevin Hartz, Yishan Wong, and more.\n\nMinted is an Equal Opportunity Employer that is committed to inclusion and diversity. We welcome people of different backgrounds, experiences, abilities and perspectives and will consider for employment all qualified applicants with arrest and conviction records. Minted participates in the E-verify program.",
        "tags":[
            "JavaScript",
            "HTML",
            "CSS",
            "Java",
            "Python",
            "PHP",
            "Scala",
            "React",
            "SQL",
            "Elasticsearch",
            "RDS",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e3c7f353752eb920"
    },
    "40b0768869eebaf1":{
        "title":"Senior Software Engineer – Fullstack Web Applications",
        "company":"DocuSign",
        "location":"San Francisco, CA 94105",
        "apply_url":"https://www.indeed.com/rc/clk?jk=40b0768869eebaf1&atk=",
        "description":"Engineering & Tech Ops | San Francisco, California\n\nCreate never-been-done-before technological solutions to complex, global challenges that impact millions of people and businesses.\n\nPosition Summary\nDocuSign is looking for a Senior engineer to help architect, build and enhance capabilities on the New DocuSign Experience. Our team's charter is to revolutionize our current UX, while keeping up with the ever-growing DocuSign user-base. You will be working in a focused scrum team obsessed with creating elegant, yet simple user-interaction for complex workflows that will delight our customers. This person is able to seamlessly integrate into agile teams and work closely with all facets of the organization (products, back-end development, QA, UX, and Design) to achieve high quality results.\n\nThis position is an Individual contributor and reports to the Director of Engineering.\n\nResponsibilities\n\n\nArchitect and design components for New DocuSign Web Experience\nDrive strategic code sharing and architecture for one or more functional area\nBe responsible for sharing and adoption of best practices for performance and availability for one or more functional area\nEnsure design and architecture is extensible across multiple projects and conduct technical-design reviews\nContribute to and drive a culture of building scalable and highly available systems\nWork with Project Management and other developers to understand design requirements and provide estimates for development\nWork as part of a passionate, agile development team to deliver engaging web user experiences\nCollaborate with our platform engineering teams to implement new features and to bring existing platform features into web platform\nDemonstrate strong focus on instrumenting features being developed to gain insights into usage pattern and feature success\nWork closely with quality engineers to identify test cases and devise efficient, scalable testing processes\nWork cooperatively with product management and design to create features that satisfy user needs with simplicity, consistency, and robustness\nParticipate in live site reviews and help implement new features / processes to improve site reliability\nIdentify, propose, and implement process improvements to continuously increase the team's' productivity and efficiency\nStay current with the latest development best practices and share your findings with the team\nWork as part of a cross-site development team to drive design, implementation, testing and release of products\n\nBasic Qualifications\n\n\nBS degree in Computer Science or relevant field of study\n8+ years of product development experience building large scale web applications\n4+ years developing JavaScript heavy applications, with extensive experience working with HTML5 and CSS3\nStrong, professional experience with client-side frameworks, preferably Angular or React (Backbone, Knockout, Spine, Ember, or similar modern JS frameworks accepted)\nExperience with full stack development, preferably in one or more of OO programming languages, like C#, Java, C++\nExperience designing and developing highly scalable consumer facing web application\nHands-on, professional experience with consuming and building RESTful web-services.\nExperience in working in an agile development environment\nExperience with git, continuous integration and deployment tools\nAble to work out of our San Francisco, CA HQ (SOMA/Financial)\n\nPreferred Qualifications\n\n\nExperience working with cross-browser behaviors and quirks\nExperience with Node.js\nPassion for UI; Good sense of usability and design in consumer applications\nExperience working with remote teams and cross functional teams\n\nEngineering & Tech Ops @DocuSign\n\nWe like to think about complex, global challenges that cross cultures and legal jurisdictions and that impact millions of people and businesses. We hire people with a broad set of skills, and they are working on how to create never-been-done-before solutions that scale. We are creating revolutionary solutions that change the way people work, live and connect … and we see our work go live. We see its impact.\n\nAbout DocuSign\n\nDocuSign® is changing how business gets done by empowering hundreds of thousands of companies and tens of millions of users in most countries around the world to sign, send and manage documents anytime, anywhere, on any device with confidence. DocuSign replaces printing, faxing, scanning and overnighting documents with the easiest, fastest, most trusted way to make every approval and decision digital. Organizations of all sizes and industries are accelerating contracts, approvals and workflows with DocuSign's Digital Transaction Management (DTM) platform and eSignature solution. DocuSign keeps life and business moving forward.\n\nWe are an equal opportunity employer committed to a diverse workforce. We do not discriminate on the basis of race, ethnicity, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability or any other legally protected category.\n\n#LI-DS1",
        "tags":[
            "JavaScript",
            "HTML",
            "CSS",
            "Java",
            "C#",
            "C++",
            "Scala",
            "Node.js",
            "Angular",
            "React"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=40b0768869eebaf1"
    },
    "dba70052e5f69fea":{
        "title":"Sr. Software Engineer, Fullstack, Workflow",
        "company":"Box",
        "location":"Redwood City, CA 94063",
        "apply_url":"https://www.indeed.com/rc/clk?jk=dba70052e5f69fea&atk=",
        "description":"Tasks and Automations- Full Stack Engineer\n\nRole and Team\n\nAs an engineer on Enterprise Tasks and Automations team, you'll be joining a fast-paced, full-stack team in one of the critical areas of Box. We are building new tools and APIs to help users get their work done faster in Box. You will work across teams to lead design and implementation of components that power mission-critical use cases for our customers.\n\nThe specific products and services we currently support include:\n\nAutomations allows users to create conditional actions for user activity in Box, such as assigning a task when a file is uploaded\n\nTrigger Service the back-end orchestration layer for Box events\n\nTasks allows users to assign and manage tasks to get their work done within Box\n\nTask Service the back-end service that allows for management of Task objects\n\nFor more information about Box Tasks and Automations, check out the announcement ( https://youtu.be/snGRvi2bDjA) and demo ( https://youtu.be/Qf1rVZ8BLcg) from BoxWorks on August 29th, 2018.\n\nYou can also read about the BoxWorks announcement here (scroll to the section titled \"Streamlining collaborative work with Box Tasks and Automations\"): https://blog.box.com/blog/boxworks-2018-intelligence-automation-digital-business\n\nWhy Box needs you\n\nAs a technical and inspiring leader, you will work across organizational and team boundaries in order to drive decisions that align with the future architecture, product, and business goals. You will lead significant technology initiatives from inception to successful deployment, across multiple layers of architecture. We'll look for you to provide perspective on leading industry trends, recommendations on new and emerging technologies, thought leadership on code quality, and engineering process improvements. You will innovate alongside other senior members of our staff on our road to excellence.\n\nWhy you need Box\n\nThe Box engineering team provides a unique combination of technical challenges around scale and robustness. As part of the Enterprise Backend team, you will help drive the product and technical vision as well as deliver critical features that generate revenue for the company through enterprise engagement as well as an add-on SKU. You will have an opportunity to design and release new services and integrate with existing systems across Box.\n\nWhat you'll be responsible for\n\nKey contributor to the technical roadmap of the enterprise organization\n\nDrive the design and implementation of features related to enterprise Influence our team's processes and execution methods\n\nCoach and mentor other engineers and teams Collaborate with others senior engineers across our organization to define our technical strategy\n\nWho you are\n\n7 to 10 years of experience (or equivalent expertise) as a software engineer\n\nPragmatic experience decomposing monolithic applications into service oriented architectures\n\nFluent in and hands-on with any modern object oriented or functional programming languages such as: Java, Scala, PHP, Javascript, React, Node.js\n\nYou understand design tradeoffs, and are able to balance technical constraints, business requirements and professional growth when thinking about your projects\n\nAct like an owner and strive to do work you're proud of, both technically and in your team interactions\n\nYou have experience with CI/CD, TDD\n\nWelcome experience\n\nExperience executing in projects involving distributed systems\n\nTechnical lead in the past for a team of at least 3+ engineers\n\nAble to influence other teams to align with your technical and product vision\n\nPlayed with the Box APIs or developed your own APIs\n\nLearn more\n\nSee \"Security: Access Controls and Visibility\" and \"Security: Governance and Compliance\" spaces in the Box Overview https://www.box.com/products-and-features\n\nGovernance & Compliance: https://www.box.com/security/governance-and-compliance\n\nIT & Admin Controls: https://www.box.com/security/it-admin-controls\n\nBox Community - Governance: https://community.box.com/t5/Box-Governance-Resource-Center/ct-p/BoxGovernance\n\nBox Community - Admin Resources: https://community.box.com/t5/New-Admin-Resource-Center/ct-p/NewAdmin\n\nLegal Holds Launch Post: https://blog.box.com/blog/legal-holds-now-available-box-governance-customers/\n\nBox Tasks and Automations BoxWorks18 announcement: https://youtu.be/snGRvi2bDjA\n\nBox Tasks and Automations BoxWorks18 demo: https://youtu.be/Qf1rVZ8BLcg\n\nStreamlining collaborative work with Box Tasks and Automations: https://blog.box.com/blog/boxworks-2018-intelligence-automation-digital-business\n\nTech Blog: https://blog.box.com/blog/category/engineering\n\nOpen Source Projects: http://opensource.box.com/\n\nDeveloper Platform: https://developer.box.com/\n\nAbout Box\n\nFounded in 2005, Box (NYSE: BOX) is transforming the way people and organizations work so they can achieve their greatest ambitions. As the world's leading enterprise software platform for secure content collaboration, Box helps business of all sizes in every industry securely access and manage their critical information in the cloud. Box is headquartered in Redwood City, CA, with offices across the United States, Europe and Asia.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\n#LI-Eng",
        "tags":[
            "JavaScript",
            "Java",
            "PHP",
            "Scala",
            "Node.js",
            "React"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=dba70052e5f69fea"
    },
    "bd4acab9c0c7b8d1":{
        "title":"Senior Software Engineer - Backend",
        "company":"Datacoral",
        "location":"San Francisco, CA 94102",
        "apply_url":"https://www.indeed.com/rc/clk?jk=bd4acab9c0c7b8d1&atk=",
        "description":"San Francisco, CA\n\n\nGet in early on building the first truly cloud-native data infrastructure stack\nOpportunity to make a large impact on product, company, and customers\nWork closely with a founding team thats driven massive scale at Facebook, Groupon, and more\n\nDatacoral, founded in 2016 by some of the data brains behind the rise of Facebook, eliminates the complexity and cognitive load of building data infrastructure. In just minutes we deploy a fully-managed stack to collect data from any source, automatically organize that data in any query engine, and leverage that data for insights and publishing.\n\nThe Role:\nAs a Backend Engineer you will build out the APIs needed for our front end by leveraging the rich systems metadata captured by the Datacoral platform. Were a modern, full-stack javascript environment leveraging the best in AWS serverless computing. You will work with distributed systems engineers and front end engineers to optimize how the firehose of systems data and audit logs are captured, organized and queried to provide efficient APIs for our front end and tools.\n\nAt Datacoral, you will:\n\nBe part of the early team making a significant contribution to both product and company\nDesign and build robust, scalable REST APIs\nWork on schema design for NoSQL and SQL databases\nImprove code quality through writing unit tests, automation, and participating in code reviews\nBrainstorm and contribute ideas to our technology, algorithms, and products\nWork with product, design, and customer-success teams to understand end-user requirements\nDive into difficult technical problems and successfully deliver results on schedule\n\nAnd were ideally looking for:\n\nStrong engineering skills in any language\nCommercial experience building well-designed REST APIs\nAn understanding of the different types of data and their workloads: how best to organize data, and what different query engines bring to the table\nFamiliarity with data technologies like OLTP/OLAP, SQL/noSQL, streaming/batch systems\nExperience working on AWS, Azure, or Google Cloud\nBonus points for: Experience with node.JS, fullstack javascript, and/or serverless computing (e.g. AWS Lambda)\n\nAt Datacoral, youll work closely with a founding team has built and run successful distributed systems at scale - including scaling Facebooks managed storage infrastructure from 50TB to 100PB+, the systems at Groupon used to send millions of emails a day.\n\nYoull be part of an exciting high-growth startup thats building the first serverless-native data infrastructure stack in the cloud, and will fundamentally change how companies work with their data. See why our investment partners are equally excited at https://link.medium.com/JKcDeCdcaV/",
        "tags":[
            "JavaScript",
            "Java",
            "Scala",
            "Node.js",
            "SQL",
            "AWS",
            "Azure"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=bd4acab9c0c7b8d1"
    },
    "a25ddb28b97d6b23":{
        "title":"Senior/Lead Software Engineer - Application Development",
        "company":"Lynk",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=a25ddb28b97d6b23&atk=",
        "description":"A little bit about us\n\nLynk is a trusted community marketplace to connect with a network of Knowledge Partners for expertise and insights to gain on-demand business knowledge and arrive at improved decision-making and execution. Our Knowledge Partners include C-level executives, thought leaders, managers, specialists, consultants, lawyers, and accountants.\n\nWhether users have a quick question or an extended engagement, we can find the right person to help. Users can engage our Knowledge Partners for brief conversations or ongoing projects, either by phone, online or in-person.\n\nJoin us in redefining how networking is done in an age of hyper-connectivity. The future is now.\n\nAt Lynk, our engineers are always learning new things — we all work cross-platform and full-stack. We have created an engineering culture where there is a high level of trust, autonomy and transparency.\n\nThis position is based in NYC.\n\nWhy join Lynk?\nLynk is a VC- AND revenue-backed, product-driven startup working with leading institutional clients, top level experts and thought leaders globally\nWe operate in a high-octane environment where our people think about the big picture and always strive to “make it happen”\nOur team, spread across four countries today (and growing!), is multinational, multilingual and multicultural. Our clients have likened us to a mini United Nations.\nYou will be constantly challenged with new problems to solve every day.\nWe are here to realize big dreams and have a firm belief in our core mission – to democratize access to knowledge.\n\nWhat You’ll Do:\nAs a talented fullstack Software Engineer,\nyou will want your lines of code to have significant and measurable positive impact for users, the company's bottom line and the industry;\nyou will drive the entire development lifecycle, help to shape and refine requirements, own the design for your components, and write the code to implement important new capabilities we are adding to our product;\nyou will build the breakthrough features our customers will love, adopt and use while keeping our trusted platform stable and scalable;\nyou should be both a strong individual contributor and leader, able to assume responsibility for Lynk's overall product architecture and operations process.\n\nImplement new features by writing well designed, testable and efficient code with superb quality to improve platform quality and stability\nDevelop full-stack web applications with high availability, simplicity, maintainability and reusability\nIndependently research and design technical solutions to solve business problems.\nDocument technical solutions for the team explaining the architecture and functionalities.\nCollaborate with product managers, UI/UX designers/researchers to define the product vision, review specs, make architecture decisions, create user-friendly designs and build new features for end-to-end product development\nMentor team members and peers that are less experienced or less knowledgeable to increase their skills or knowledge, and ultimately their effectiveness on the team.\n\nIf this sounds what you are passionate about, we want to chat and tell you more about our work culture and environment and see if this will be a good fit for both of us.\n\nRequirements\nWhat Expertise You’ll Add To The Team:\n8+ years of experience in developing highly-available, scalable and event-driven (syn/async) web applications in a highly distributed environment.\n3+ years of functional experience in crafting and building full stack applications in Node.js (Express framwork) with React, Redux based UI.\nGood knowledge of computer science fundamentals e.g. data structures, algorithms, and design patterns.\nExcellent knowledge and working experience with pub/sub messaging systems.\nStrong software engineering skills, thinking in framework/platform terms, setting and following functional conventions, writing highly testable code, isolating business logic and presentation.\nAbility to coach junior developers.\nPassion for writing well-architected readable code that’s easy to maintain by a team of developers\nExperienced in modern browser technologies, e.g. WebSockets, Local Storage, Worker Threads, etc.\nKnowledgeable of how web applications work including security, session management\nAn eagerness to embrace an engineering culture that values testing, code review, and leaving things better than the way you found them.\n\nBonus Attributes:\nStrong passion for business and enthusiastic about taking part in shaping LYNK’s growth\nFunction well in a very fast-paced startup environment\nTrack record of excelling in small teams\nTeam players who thrive in uncertainty and like to “make things happen”!\nBenefits\nWhat We Commit To You\nCompetitive remuneration package in a rapidly-expanding startup\nWork in a collaborative, co-creation hub in the heart of the city - with amazing facilities\nComprehensive medical insurance coverage, including dental\nGenerous leave policy, including a ‘work remote policy’\nThe opportunity to travel and work around the globe with our international clients and growing number of offices (Hong Kong, Singapore, Mumbai, New York City)\nThe opportunity to be a part of something impactful\n\nVisit http://lynk.global for more info.",
        "tags":[
            "Scala",
            "Node.js",
            "React"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=a25ddb28b97d6b23"
    },
    "29b0f600bccd7b72":{
        "title":"Software Engineer",
        "company":"TaskRabbit",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=29b0f600bccd7b72&atk=",
        "description":"----------------\nAbout TaskRabbit\n----------------\n\nAt TaskRabbit, we want to make your neighborhood a little more familiar. Whether it's a handyman (or woman!), a housecleaner, moving help or delivery person, we're imagining a world where everyone will have a go-to team to make everyday life easier.\n\nAs a pioneer of the sharing economy, TaskRabbit was founded on the premise of neighbors helping neighbors. Since then, our network has grown to three countries and 45+ cities, yet our core mission of creating a better everyday life for everyday people has remained the same.\n\nTogether with IKEA, we're creating more opportunities for people to earn a consistent, meaningful income on their own terms by building lasting relationships with clients in communities around the world.\n\nWe are a group of mission-minded people. Our culture is collaborative, pragmatic, and fast-paced. We're looking for talented, entrepreneurially-minded and data-driven people who also have a passion for helping people do what they love - and have a ton of fun while they're at it.\n\n-------------\nAbout the Job\n-------------\n\nTaskRabbit's diverse engineering team uses React.js and React Native on the frontend, and Ruby on the backend. We're looking for people that enjoy working in the React JS ecosystem and also have experience with Ruby on Rails. This is a true Fullstack role, plus you'll get a chance to collaborate with many different teams, and especially Design, Marketing, product, and Data Science.\n\nWhat will you do?\n-----------------\n\n\nBuild out the backend APIs for features to drive TaskRabbit's growth.\nArchitect and craft solutions to the complex backend and front challenges\nMake changes to frontend Javascript code and backend Ruby code.\nEvaluate and implement analytics tools to track user growth and activity\nProvide feedback on features being developed across the company and suggest solutions\nParticipate in code reviews, listening to feedback and commenting on others' approaches\nCollaborate with design, product management, and marketing to help plan and implement new growth initiatives\n\nWho are you?\n------------------\n\nWe welcome applicants from a variety of backgrounds and experiences. Below you can get a sense of how we're thinking about what you'll need to be successful in the role.\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n\nYou have 3-5 years of experience\nYou're very experienced with JavaScript/TypeScript and Ruby on Rails\nYou're comfortable with React\nYou have backend and API development experience\nYou're familiar with Linux command line\nYou're excited to quickly ship features in a collaborative, fast-paced environment\n\n---------------------------------------\n\nYou'll love working here because:\n---------------------------------------\n\n\nThe People. You will be surrounded by some of the most talented, supportive, smart, and kind leaders and teams -- people you can be proud to work with!\nThe Values.\nCare Deeply. We take time to be present and partner with our team and communities.\nLevel Up. We navigate through ambiguity and go the extra mile.\nBe A Better Neighbor. We build a diverse and sustainable community and encourage all voices.\nLead The Future Together. We value entrepreneurship and inspire by action.\nThe diverse culture. We believe that we make better decisions when our workforce reflects the diversity of the communities in which we operate. Women make up more than half of our team and leadership, and we strive to recruit and retain employees from all over the world.\nThe perks. TaskRabbit offers comprehensive medical benefits, generous vacation and holiday time off, commuter benefits, learning and development opportunities, career development trainings, monthly TaskRabbit product stipends, IKEA discounts, free lunch, weekly meditations, charity events, and a dog-friendly office.\n\nCompany Overview:\n-----------------\n\nTaskRabbit is a task management network that conveniently connects people with Taskers to handle everyday home to-do's, such as furniture assembly, handyman work, moving help, and much more. Acquired by IKEA Group - the world's largest furniture retailer - in 2017, TaskRabbit operates in the United States, the United Kingdom and Canada and is expanding its global reach rapidly.\n\nAs a pioneer of the sharing economy, TaskRabbit was founded in 2008 on the premise of neighbors helping neighbors. Since then, our network has grown to three countries, 45 cities and over 140,000 Taskers, yet our core mission has remained the same. We want to make everyday life easier for everyday people. And by doing that, we can make your neighborhood a little more familiar.\n\nIn 2017, TaskRabbit launched TaskRabbit for Good (TR4G), which connects neighbors to build sustainable and compassionate communities. TaskRabbit for Good was created to make it easier for neighbors to give back locally and make a positive impact in communities around the world. TaskRabbit donates a portion of its service fee from all TR4G initiatives to best-in-class local non-profit organizations tackling social and environmental challenges.\n\nTaskRabbit's headquarters is located in the heart of San Francisco, with three other offices in New York City, Austin, and London.\n\nEqual Opportunity Employer\n--------------------------\n\nTaskRabbit is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, ancestry, citizenship, gender, gender identity, sexual orientation, age, marital status, military/veteran status, or disability status. TaskRabbit is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.\n\nTaskRabbit will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.",
        "tags":[
            "JavaScript",
            "Java",
            "TypeScript",
            "Ruby",
            "Assembly",
            "React",
            "Linux"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=29b0f600bccd7b72"
    },
    "83cbb33205388c34":{
        "title":"Senior Fullstack Engineer",
        "company":"Segment",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=83cbb33205388c34&atk=",
        "description":"**************\nOverview\n**************\n\nAt Segment, we believe companies should be able to send their data wherever they want, whenever they want, with no fuss. We make this easy with a single platform that collects, stores, filters, transforms, and sends data to hundreds of business tools with the flip of a switch. More recently, we also developed the ability to let customers enrich their data in real time using computations they specify. Our goal is to make it easy to understand, extract value, and protect the integrity of data. We are creating a world where engineers spend their time working on their core product, letting us take care of the complexities of processing their customer data reliably at scale. We're in the running to take over the entire customer data ecosystem, and we need the best people to take the market.\n\n-----------\n\nWho we are:\n-----------\n\nWe develop our product across a number of teams based in San Francisco and Vancouver, each with a particular product feature focus area. From collecting data through analytics.js, ( https://github.com/segmentio/analytics.js ) to building powerful tools for data governance, to implementing algorithms that can handle complex billing scenarios at scale, to visualizing our customers' data flow through our pipelines, to making complex implementations manageable for our large enterprise customers, to optimizing Sign Up conversion, our product teams are focused on creating fantastic user experiences. We're looking for talented engineers that are passionate about building world-class experiences that delight our customers.\n\n-----------\n\nWhat We Do:\n-----------\n\n\nWe build customer-facing features using React, TypeScript, Apollo, GraphQL, and our open source component library: Evergreen ( https://github.com/segmentio/evergreen )\nWe implement high-performance data pipelines using Go and Kafka.\nWe use a variety of data storage solutions such as Aurora, Redis and ClickHouse.\nWe deploy our code multiple times per day using Docker, Terraform, and ECS.\nWe love open source: https://open.segment.com ( https://open.segment.com )\nWe're proud of the code we write, but we're not dogmatic about methodologies or techniques. We believe building the \"right thing\" is more important than building things \"right\".However, we take our customers' dependence on our systems very seriously and strive to build highly performant and reliable software that are parts of our customers' core infrastructure.\n\n----------------------\n\nWho We're Looking For:\n----------------------\n\nYou can turn complex business requirements into working software that our customers love to use.\n\nYou're proud of the code you write, but you're also pragmatic.\nYou know when it is time to refactor, and when it's time to ship.\nYou're focused, driven and can get challenging projects across the finish line.\nYou're empathetic, patient and love to help your teammates grow.\nYou have experience running apps in production and take software engineering practices seriously. You write meaningful tests and understand the value of great logging, proper monitoring and error tracking.\n\n---------------------------\n\nProjects You Could Work On:\n---------------------------\n\n\nWe're rethinking the way customers structure their Segment workspaces and manage granular access management policies. We're pushing authorization concerns to the edge for enhanced reliability.\nWe're building powerful tools that help our customers protect the integrity of their data, and the decisions they make with it.\nWe work on building and extending our Evergreen ( https://github.com/segmentio/evergreen ) UI library that saves our engineers many hours a week.\nWe're shipping cohesive app workflows and experiences that Wow our customers.\nWe're scaling distributed systems and pipelines for streaming and batch processing.\n\n-------------\n\nRequirements:\n-------------\n\n\nYou can write client side JavaScript or TypeScript using modern language features.\nYou have experience with a backend language of choice: Ruby, Python, Java, etc\nYou have some familiarity with Golang or are excited to learn it.\nMinimum of 3 years of industry experience in engineering or some cool projects on GitHub you think we'll love to check out.\nYou provide a deep understanding of the complexities involved in writing large single-page applications.\nYou show evidence of exposure to architectural patterns of high-scale web application (e.g., well-designed APIs, high volume data pipelines, efficient algorithms).\nYou value teamwork and agree with the statement that \"a team is a group of people who own each others' decisions\".\n\nSegment is an equal opportunity employer. We believe that everyone should receive equal consideration and treatment. Recruitment, hiring, placements, transfers, and promotions will happen based on qualifications for the positions being filled regardless of sex, gender identity, race, religious creed, color, national origin ancestry, age, physical disability, pregnancy, mental disability, or medical condition.",
        "tags":[
            "JavaScript",
            "Java",
            "Python",
            "TypeScript",
            "Ruby",
            "React",
            "Redis",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=83cbb33205388c34"
    },
    "e679c5bb3d4a7039":{
        "title":"Software Engineer - Video Ads Experience",
        "company":"Twitch Interactive, Inc.",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e679c5bb3d4a7039&atk=",
        "description":"Bachelor’s degree or above in Computer Science or prior engineering experienceProficient coder in one or more of the following: Go, Javascript, ElixirExperience developing web application backends and APIsSuperb communication skills are required\n\nTwitch enables content creators to live-stream content to their communities across the globe. Advertising is a core part of Twitch’s business model, and spans across many product areas. We take pride in our mission to help creators earn a living by entertaining and educating their viewers. On the Advertising team you’ll work with a talented, passionate, and customer obsessed team. We have a growing team comprised of product and engineering professionals based in the Twitch HQ at downtown SF.\n\nTwitch is seeking fullstack engineers with the curiosity, drive, and ingenuity to develop user experiences, services and APIs that drive the advertising and promotion business. These systems give creators opportunities to make money, the data they need to do this effectively, and in a way that promotes viewer involvement.\n\nThe ideal contributor should have experience building, maintaining and continuously delivering high quality production, UXs and web services in a distributed systems environment.\n\nAs the leader in this space, Twitch has a unique opportunity to invent what advertising as a product means in a live-streaming context. Our products include innovative real-time experiences specific to Twitch. If you’re excited about having an outsize impact in an area that’s ripe for innovation, come work with us!\n\nResponsibilities\nDevelop and deliver new product services and features on web platformsScale and improve existing APIs and services used to power the Twitch advertising platformImprove engineering processes and tools to increase team effectivenessWork across teams and organizations to deliver value to our creators, viewers, and advertisers\n\nFamiliarity with one of the following frameworks (Ember, React, Rails, Phoenix)Familiarity in the AWS ecosystem of services (EC2, RDS, Dynamo, Lambda, CloudWatch)Familiarity or experience building GraphQL APIsFamiliarity with ETL pipelines (Kinesis, Apache Airflow, Redshift)Experience with Docker, Kubernetes and the container ecosystemKnowledge of VAST/VPAID standardsExperience integrating with an ad platform or SDK: Amazon Ad Exchange, Google IMA/GMA SDK, DoubleClick API",
        "tags":[
            "JavaScript",
            "Java",
            "React",
            "RDS",
            "AWS",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e679c5bb3d4a7039"
    },
    "90c36ccfdf94357d":{
        "title":"Senior Java ADF Fullstack Developer",
        "company":"Oracle",
        "location":"Redwood City, CA 94065",
        "apply_url":"https://www.indeed.com/rc/clk?jk=90c36ccfdf94357d&atk=",
        "description":"Senior Java ADF Fullstack Developer-19000E6F\n\n\nPreferred Qualifications\n\nDescription\nWe are seeking senior full stack developers to join our growing Fusion Cloud Management Tools team. These hands-on development positions offer you the opportunities\n To build mission critical products that have immediate benefits to our large number of Cloud customers.\n To gain deep knowledge across the entire technology stack. To solve unique challenges in managing complex and large-scale enterprise applications in the Cloud.\nThe Cloud Management tools provide support across all aspects of planning, scheduling, communications, and execution for changes to all Oracle Application Cloud Services. We enable:  Product Development to systematically deliver and communicate code change requests to Cloud Operations;  Cloud Operations to efficiently and effectively plan and execute on all changes to hardware, software, network across all data centers, as well as aligning plans for capacity;  Customer Success teams to effectively communicate with the customer enhancing and improving plans and changes to their services\nAs a Senior Software Engineer, you will own the detail design, development of several key components of SaaS Cloud Management services. You are both a solid Java/J2EE coder and a end to end web application generalist, able to dive deep into any part of the stack, as well as develop distributed system interactions. You value simplicity and scale, work comfortably in a collaborative, agile environment. You should be excited and able learn fast.\nResponsibilities  Provide technical leadership and expertise for product design, implementation, and quality release  Develop reliable full stack services from web UI to DB backend, including operational BI analysis.  Champion for rapid delivery of working code in agile development.  Propose and evaluate changes to the deployment architecture to improve performance, scalability, and/or manageability  Participate in production support of the mission critical Cloud operation tools and services. Troubleshoot and resolve performance issues in the web application  Collaborate with globally distributed teams, ranging from product managers, Cloud Operations, Support, IT and SaaS/PaaS development/QA groups, to improve production user experience and influence roadmap. Qualifications  Strong analytical and problem solving skills. Experienced in Agile development of Java/web application  5+ years developer experience, 2+ years experience with ODD/MVC design, Java, scripting languages Python, Perl, JavaScript, etc.  Preferred experience in Oracle Fusion development technologies, such as Application Development Framework (ADF), OBIEE, web services, RESTful API, JSON, XML, Linux/Unix development tools  Good understanding of RDBMS data models. Strong Oracle SQL, PL/SQL, schema skills  Understanding cloud automation and orchestration concept and tools like Chef and Docker\nOther skills:\n Self-starter and motivated with ability to work in a fast paced Rapid Application Development environment.\n Ability to handle multiple development tasks and assignments simultaneously\n Result-focused, demonstrated strong collaboration and teamwork skills.\n Ability to effectively create and communicate technical information with people in various job functions. Detailed Description and Job Requirements\nAnalyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications. As a member of the software engineering division, you will analyze and integrate external customer specifications. Specify, design and implement modest changes to existing software architecture. Build new products and\ndevelopment tools. Build and execute unit tests and unit test plans. Review integration and regression test plans created by QA. Communicate with QA and porting engineering to discuss major changes to functionality. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 5 years of software engineering or related experience.\n\nDetailed Description and Job Requirements\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture.\n\nDuties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. 1 year of software engineering or related experience.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.",
        "tags":[
            "JavaScript",
            "Java",
            "Python",
            "Scala",
            "Perl",
            "SQL",
            "Oracle",
            "Linux"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=90c36ccfdf94357d"
    },
    "0487234309247368":{
        "title":"Software Engineer (Appls) 4",
        "company":"Change Healthcare",
        "location":"Emeryville, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=0487234309247368&atk=",
        "description":"Transforming the future of healthcare isn’t something we take lightly. It takes teams of the best and the brightest, working together to make an impact.\nAs one of the largest healthcare technology companies in the U.S., we are a catalyst to accelerate the journey toward improved lives and healthier communities.\nHere at Change Healthcare, we’re using our influence to drive positive changes across the industry, and we want motivated and passionate people like you to help us continue to bring new and innovative ideas to life.\n\n\nIf you’re ready to embrace your passion and do what you love with a company that’s committed to supporting your future, then you belong at Change Healthcare.\nPursue purpose. Champion innovation. Earn trust. Be agile. Include all.\nEmpower Your Future. Make a Difference.\nChange Healthcare Federal Technologies is currently looking for a FullStack .Net Developer to join our team.\n\n\nDo you love a challenge, like coming up with creative solutions, are self-motivated, can work efficiently and collaboratively? if so, we want to talk to You!\n\n\nThis role will help with the development and writing both front-end and back-end code supporting clinical solutions available to the DoD. You will work with Product Management, QA, Cloud Operations and cybersecurity team to ensure a stellar end user experience while ensuring we meet our customer’s requirements around cybersecurity and feature functionality.\nJob Description\nFull-stack developer who is able to:\nDesign and implement whole solutions from scratch.\nMaintain an existing code base that supports millions of end users across the world\nGet involved with dev-ops tasks, such as build, deployments and information security.\nTroubleshoot and fix bugs with the existing applications\nLanguages (in order of importance)\nC# .NET 4.5+\nMS SQL Server and T-SQL\nJavaScript\nHTML, Bootstrap, CSS\nASP.NET Core Front-end\nUnderstanding of async/await, synchronization primitives\nKnowledge of Git is a plus\nJavaScript with Angular 1.2 is a plus\nPer contractual requirements candidates must be U.S. Citizens and able to obtain a government security clearance.\nJoin our team today where we are creating a better coordinated, increasingly collaborative, and more efficient healthcare system!\nEqual Opportunity/Affirmative Action Commitment\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.",
        "tags":[
            "JavaScript",
            "HTML",
            "CSS",
            "Java",
            "C#",
            "Angular",
            ".NET",
            "SQL"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=0487234309247368"
    },
    "7da03725148d28c0":{
        "title":"Software Engineer - Customer Engineering (All Levels) - San Carlos, CA",
        "company":"Bluescape Software",
        "location":"San Carlos, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=7da03725148d28c0&atk=",
        "description":"ABOUT THE ROLE\n\nIf you want to reimagine the way companies communicate and collaborate, working with cutting-edge technologies and high-caliber professionals, then drop us a line. You will be an Technical Lead on our Customer Engineering Team.\n\n\nPositions available at all levels\n\nRESPONSIBILITIES\n\n\nPerform on a team of experienced engineers on our Customer Engineering Team.\nResponsible for fullstack development\nExperience with Frontend, Backend and Cloud Services Development\nCollaborate effectively with the Customer Engineering Team\nCollaborate effectively with the Design and Product teams and understand user requirements\nMust be able to lead occaisional customer specific featured developments\nBe aware of trends in the software industry and identify technologies that are applicable\n\nSKILLS AND REQUIREMENTS\n\n\nBachelor's degree in Computer Science or related field and 3+ years experience.\nSoftware engineering background with a drive to solve complex problems\nExperience with Javascript, C++ and Native Development, Multimedia Graphics, UI\nPreviously worked on Customer Engineering High Value Clients\nMust be a Team Player\nMust be a fast learner\nExperience working in a high growth startup environment\n\nBONUS POINTS\n\n\nMultimedia Graphics\nExperience with UI\nExperience with Cloud Services/Infrastructure (ie: AWS)\nExperience with Software Security\n\n",
        "tags":[
            "JavaScript",
            "Java",
            "C++",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=7da03725148d28c0"
    },
    "88c5653faa51aeba":{
        "title":"Technical Lead - Customer Engineering - San Carlos, CA",
        "company":"Bluescape Software",
        "location":"San Carlos, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=88c5653faa51aeba&atk=",
        "description":"ABOUT THE ROLE\n\nIf you want to reimagine the way companies communicate and collaborate, working with cutting-edge technologies and high-caliber professionals, then drop us a line. You will be an Technical Lead on our Customer Engineering Team.\n\nRESPONSIBILITIES\n\n\nPerform as a Lead on a team of experienced engineers on our Customer Engineering Team.\nResponsible for fullstack development\nLeading Frontend, Backend and Cloud Services Development\nCollaborate effectively with the Customer Engineering Team\nCollaborate effectively with the Design and Product teams and understand user requirements\nMust be able to lead occaisional customer specific featured developments\nBe aware of trends in the software industry and identify technologies that are applicable\n\nSKILLS AND REQUIREMENTS\n\n\nBachelor's degree in Computer Science or related field and 6+ years experience. Previous experience as Lead on an engineering team\nStrong software engineering background with a drive to solve complex problems\nExperience with Javascript, C++ and Native Development, Multimedia Graphics, UI\nPreviously worked on Customer Engineering High Value Clients\nMust be a Team Player\nMust be a fast learner\nExperience working in a high growth startup environment\n\nBONUS POINTS\n\n\nMultimedia Graphics\nExperience with UI\nExperience with Cloud Services/Infrastructure (ie: AWS)\nExperience with Software Security\n\n",
        "tags":[
            "JavaScript",
            "Java",
            "C++",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=88c5653faa51aeba"
    },
    "c4c3e81f31768ec0":{
        "title":"Engineering Manager - Customer Engineering - San Carlos, CA",
        "company":"Bluescape Software",
        "location":"San Carlos, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=c4c3e81f31768ec0&atk=",
        "description":"ABOUT THE ROLE\n\nIf you want to reimagine the way companies communicate and collaborate, working with cutting-edge technologies and high-caliber professionals, then drop us a line. You will be an Engineering Leader on our Customer Engineering Team.\n\nRESPONSIBILITIES\n\n\nLead a team of experienced engineers on our Customer Engineering Team.\nResponsible for managing fullstack development\nManaging Frontend, Backend and Cloud Services\nCollaborate effectively with high profile Customers\nCollaborate effectively with the Design and Product teams and understand user requirements\nMust be able to manage occaisional customer specific featured developments\nBe aware of trends in the software industry and identify technologies that are applicable\n\nSKILLS AND REQUIREMENTS\n\n\nBachelor's degree in Computer Science or related field and 7+ years experience managing an engineering team\nStrong software engineering background with a drive to solve complex problems\nExperience with Javascript, C++ and Native Development, Multimedia Graphics, UI\nPreviously worked on Customer Engineering High Value Clients\nMust be a Team Player\nExperience working in a high growth startup environment\n\nBONUS POINTS\n\n\nMultimedia Graphics\nExperience with UI/UX\nExperience with Cloud Services/Infrastructure (ie: AWS)\nExperience with Software Security\n\n",
        "tags":[
            "JavaScript",
            "Java",
            "C++",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=c4c3e81f31768ec0"
    },
    "a30aa7bcf369cc78":{
        "title":"Sr. Software Systems Engineer",
        "company":"Grifols Shared Services North America, Inc",
        "location":"Emeryville, CA 94662",
        "apply_url":"https://www.indeed.com/rc/clk?jk=a30aa7bcf369cc78&atk=",
        "description":"For more than 75 years, Grifols has worked to improve the health and well-being of people around the world. We are a global healthcare company that produces essential plasma-derived medicines for patients and provides hospitals and healthcare professionals with the tools, information and services they need to deliver expert medical care.\nHeadquartered in Barcelona, Spain, Grifols has over 20.000 employees in 30 countries. Grifols’ three main divisions - Bioscience, Diagnostic and Hospital - develop, manufacture and market innovative products and services available in more than 100 countries.\nA leader in transfusion medicine, the Diagnostic Division is a global business focused on providing innovative solutions to help ensure the safety of the blood and plasma supply, detect human diseases and monitor therapies. The division advances patient care with diagnostic solutions to improve disease detection and management, and simplify laboratory operations.\nThe Senior Software Engineer in the Systems Engineering team will develop and support instrument software and middleware for in-vitro diagnostics (IVD) and clinical diagnostics systems. As a development lead in cross-functional project teams, he/she shall work as a subject matter expert in architecting, developing and commercializing software and instrument systems by utilizing expertise in software and systems engineering and analysis.\nMajor Activities:\nLead or contribute to development of software, from requirements through design, implementation, and validation and release to customers.\nContribute to the architecting of software systems solutions for in-vitro diagnostic systems and interfaces to other diagnostic lab systems and LIS.\nInteract with outside partners and vendors work and progress towards specifying and developing software products, including architecture, design, prototype testing, defect reviews, design reviews, V&V and UAT.\nDevelop system level product requirements and software/component requirement documents using requirements management methodologies including change management.\nPartner with Global Marketing to develop customer requirements; work with other internal stakeholders to facilitate the collection of business and regulatory requirements.\nDefine and prepare a schedule of development tasks, deliverables and timelines.\nConduct patient safety risk management activities according to FDA and ISO regulations.\nEstablish product configuration management.\nPlan and perform system, integration and unit testing.\nSupport verification and validation activities.\nDocument and present work product to project team and business stakeholders.\nMentor others on software engineering best practices and procedures.\nMay require 10% travel.\nRequirements:\nBachelor’s Degree in a technical discipline such as Software Engineering or equivalent. Advanced degree preferred.\n7+ years of relevant experience developing software based diagnostic products.\nAbility to solve complex software issues and problems, for both system, firmware, application and networking software. Experience with Laboratory Information Systems (LIS) is a plus.\nExperience with leading development efforts in a cross functional environment.\nExperience in medical instrumentation firmware and software development.\nExperience in graphical user interface design and development.\nKnowledge of molecular biology is a plus.\nDemonstrated software product development experience using lifecycle methodologies and under FDA design control.\nExperience with Delphi ( or C#) software development language would be preferred\nPossesses project management skills in managing priorities, delegating, and influencing others.\nExperience in a cross functional environment.\nAbility to convey complex information in both written and oral form.\nExperience with external vendor relationships.\nAbility to influence others, gain acceptance and build consensus.\nExcellent communication and interpersonal skills.\nEquivalency:\nDepending on the area of assignment, directly related experience or a combination of directly related education and experience and/or competencies may be considered in place of the stated requirements. Example: If a job level requires a Bachelor’s degree plus 4 years of experience, an equivalency could include 8 years of experience, an Associate’s degree with 6 years of experience, or a Master’s degree with 2 years of experience.\nEEO Minorities/Females/Disability/Veterans\nCLK789\nLocation: [[mfield6]] :* *[[cust_building]]\nLearn more about Grifols at http://www.grifols.com/es/web/international/home\nReq ID: 80712\nType: Regular Full-Time\nJob Category: Engineering",
        "tags":[
            "C#",
            "RDS",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=a30aa7bcf369cc78"
    },
    "22cc23252faf401b":{
        "title":"Senior Software Engineer, Site Discovery - Java, GraphQL",
        "company":"Glassdoor",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=22cc23252faf401b&atk=",
        "description":"Looking for your next challenge? How about helping us disrupt a $90B+ talent acquisition market! At Glassdoor, we have more than 70M members and thousands of business customers and together we are revolutionizing the way great employees find great jobs and companies.\n\nThe Role\n\nAs a Senior Software Engineer, you will play a central role in the design and development of the Glassdoor Site Discovery Platform. The ideal candidate will have a passion for development and a strong background in building dynamic, high-volume back-end systems with Java, Spring, GraphQL using an Agile development methodology. This brand new team would be responsible for providing aggregation services that would be integrated with engaging user experiences personalized for our users.\n\nIn this role you work with a nimble, fast-growing, rapidly innovative and collaborative team of engineers, product managers, and designers and researchers based out of downtown San Francisco. We love folks who are excellent with collaboration, possess great interpersonal and communication skills who can prioritize, multitask, and deliver because it's a lot more fun to get things done.\n\nSkills and Requirements\n\n\n5+ years of Java, Spring base software development experience on large scale, high-volume systems.\n1+ years of GraphQL/Spring based service-oriented solutions or microservices.\nExperience owning API services end to end including solving production issues.\nProficient with open source Java technologies such as Hibernate, Tomcat, Redis and Java based GraphQL.\nStrong understanding of Java design systems, efficient API design and distributed transactions.\nProficient in working with relational databases as well as commonly used AWS technologies like (EC2, Dynamo).\nExperience knowing and following best practices for the full software. development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations.\n\nWhy Glassdoor?\n\n\nWork with purpose join us in creating transparency for job seekers everywhere\nGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year\n100% company paid medical/dental/vision/life coverage, with 80% dependent coverage\nLong-Term Incentive Plan\n401(k) Plan with a Company Match to prepare for your future\nConveniently located office in the heart of downtown San Francisco (Embarcadero)\nFully-stocked break rooms with complimentary food and drinks\nPaid holidays and flexible paid time off\nYour choice between Mac or PC\n\nGlassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation.",
        "tags":[
            "Java",
            "Spring",
            "Redis",
            "RDS",
            "AWS",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=22cc23252faf401b"
    },
    "22729041746c917c":{
        "title":"Senior Software Engineer, Support Platform",
        "company":"Zendesk",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=22729041746c917c&atk=",
        "description":"Zendesk is looking for an engineer to join Team Support Platform, as a Senior Software Engineer! If you are an engineer with experience in developing scalable Web Applications, and a passion for superior frameworks and tooling, we want to talk to you!\n\nThe Support Platform team takes a holistic view of the Support product, which lends us a good deal of flexibility and control over the projects we take on. We design, shepherd, and implement architectural and performance improvements, new technologies, and development standards & procedures for Zendesk’s core product.\n\nWe own the evolution of the Support product’s architecture towards a new, more scalable and maintainable platform, preparing for our next level of scale as well as an elastic infrastructure. We also support and maintain the development tools and frameworks that the rest of the team uses, and boosting developer productivity for the entire Support product team, and helping every team ship cool things a lot faster and safer. The team is based in our headquarters in San Francisco, and consists of experienced Ruby, JavaScript and JVM developers.\n\nOur projects tend to improve developer experience for a large population of developers, improve the runtime performance of our web applications, and impact our entire customer base.\nWhat you get to do every day:\nLead the evolution the runtime architecture of the core product at Zendesk\nImprove the frameworks and tools that every developer on the Support product uses every day.\nWork with fellow developers as your main customers, identifying and fixing issues in development workflow, guiding them through changes in frameworks and tooling.\nDocument, evangelize and communicate best practices in all our frameworks and tools.\nInfluence good architectural decisions in product teams, with a view to sustainability, technical debt, and performance.\nProactively seeking out and help to minimize pain points within the infrastructure and code base of Zendesk Support application.\nWhat you bring to the role:\nAt least two years of experience in software development, preferably in a SaaS environment.\nExcellent programming skills in Ruby, JavaScript or JVM languages. Experience with Rails would be a significant advantage, as would be experience building reliable and performant microservices with Java, Scala or other JVM languages.\nAn understanding of or experience with modern devops tooling - Docker and Kubernetes - as well as good old bash scripting, is very nice to have.\nSound understanding of web application development and agile development practices.\nA holistic approach to development and testing, including TDD where appropriate.\nGreat communication skills, both written and verbal.\nStrong verifiable contributions to open source software would be nice to have.\nThe best customer experiences are built with Zendesk. Zendesk’s powerful and flexible customer service and engagement platform scales to meet the needs of any business, from startups and small businesses to growth companies and enterprises. Zendesk serves businesses across a multitude of industries, with more than 125,000 paid customer accounts offering service and support in more than 30 languages. Headquartered in San Francisco, Zendesk operates worldwide with 15 offices in North America, Europe, Asia, Australia, and South America. Learn more at www.zendesk.com.\n\nInterested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.\n\nZendesk is an equal opportunity employer, and we’re proud of our ongoing efforts to foster diversity & inclusion in the workplace. Individuals seeking employment at Zendesk are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, physical or mental disability, military or veteran status, or any other characteristic protected by applicable law.\n\nBy submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesk’s use of your personal information.",
        "tags":[
            "JavaScript",
            "Java",
            "Bash",
            "Ruby",
            "Scala",
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=22729041746c917c"
    },
    "ebecafc5292d6f04":{
        "title":"Cross-Platform Software Engineer (Mental Health)",
        "company":"Omada Health",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=ebecafc5292d6f04&atk=",
        "description":"Omada Health is on a mission to inspire and enable people everywhere to live free of chronic disease.\n\nWe are a San Francisco-based healthcare and technology company, and are looking for experienced software engineers to join our growing team.\n\nIf you're ready to guide technical decision-making and work hands-on with some of the best engineers in the health industry, this is the job for you. Our core product includes several web apps built in Ruby on Rails, an iOS app written in Swift/Objective-C, and an Android app written in Java/Kotlin. We also utilize Python in our data pipeline and React Native for one of our pilot products.\n\nWe value sustainable engineering practices: We work together using pair programming, test-driven development, and constant collaboration. As a key member of our engineering team, you will help design, build, and maintain systems necessary to continue our rapid growth. You should be motivated to learn new technologies and be ready to drive technical work.\n\nHow you can make an impact:\n\nMake a positive impact on the health outcomes and happiness of participants\nBuild new products and applications using web, mobile, and cross-platform technologies to deliver our mental health offering\nSolve big problems to improve participant outcomes including building customized interventions, making data actionable for users, and scaling the system\nSolve big problems to improve the operations behind Omada's behavior change program including building systems to interface with the healthcare system\nDrive engineering efforts and partner with product owners to create technical requirements\nWork in an agile, test-driven, pair programming environment\nTrain and collaborate with newer developers in how to write great code and solve problems effectively\nResearch and adapt new technologies\n\nWhat you need for this role:\n\n3+ years of experience with native Android development\n2+ years of Javascript or React Native experience\nExperience launching an Android app on the Play store\nFamiliarity with TDD and CI workflows (e.g. Jenkins)\nSolid understanding of server client interactions\nStrong technical responsibility over the products you work on and the codebases you maintain\nOpen to web development with Ruby on Rails or exposure to MVC web frameworks\nExcellent written and verbal communication skills\nIntellectual curiosity, positive attitude, and a desire to influence the products being built\n\nTechnologies we use:\n\nRuby on Rails 5, JavaScript (including ES6/2015), Postgres, Git, Ansible, React, Redux, Ember, Redis, AWS infrastructure, React Native\n\nBenefits:\n\nCompetitive salary\nStock options + extended post termination option exercise window (for Omadans who are with us 3 years or more)\nFlexible vacation\nAnnual budget for personal development and/or conferences\nParental leave\nHealth, dental, and vision\nHealthy snacks and meals\nWellness events (e.g. running club)\nCommunity volunteering\n401k retirement savings plan\n\nAbout Omada Health: We've pioneered digital behavioral medicine: an innovative approach to tackling the growing epidemic of type 2 diabetes, heart disease, and obesity. Our online programs combine world-class science, technology, and design to inspire and enable people everywhere to live free of chronic disease. Named one of Fast Company's \"50 Most Innovative Companies in the World,\" our team includes passionate and talented individuals. Our approach has been embraced by major employers across the country, including Costco and Iron Mountain, as well as leading health plans, such as Kaiser Permanente and BlueCross Blue Shield of Louisiana.\n\nWe carefully hire the best talent we can find, which means actively seeking diversity of beliefs, backgrounds, education, and ways of thinking. We strive to build an inclusive culture where differences are celebrated and leveraged to inform better design and business decisions. Omada is proud to be an equal opportunity workplace and affirmative action employer. We are committed to equal opportunity regardless of race, color, religion, sex, gender identity, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition, family care status, military or veteran status, marital status, domestic partner status, sexual orientation, or any other basis protected by local, state, or federal laws.",
        "tags":[
            "JavaScript",
            "Java",
            "Python",
            "Ruby",
            "Swift",
            "Objective-C",
            "Kotlin",
            "React",
            "Redis",
            "Android",
            "AWS",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=ebecafc5292d6f04"
    },
    "8b9740def12ffd79":{
        "title":"Product Marketing Data Analyst for Cloud Platform",
        "company":"Oracle",
        "location":"Redwood City, CA 94065",
        "apply_url":"https://www.indeed.com/rc/clk?jk=8b9740def12ffd79&atk=",
        "description":"Product Marketing Data Analyst for Cloud Platform-19000REU\n\n\nPreferred Qualifications\n\nOracle’s Cloud Platform business is one of the fastest growing segments for the company and represents one of the most important ways our customers can modernize, innovate and differentiate. Representing some of the most innovationative product lines in the company, including: Autonomous Database Cloud Service, AI Platform, Blockchain, Chatbots, Security and more, this group is at the tip of the spear in leading programs that help accelerate sales, drive new product strategy, and new marketing programs.\n\nThe Senior Product Marketing Data Analyst for Cloud Platform will join the Cloud Business Group reporting directly to the Senior Director of Oracle Cloud Platform for Programs/Operations. You will have the unique responsibility for helping coordinate data collection, marketing segmentation programs for PaaS/IaaS, focused primarily on Autonomous Database, Analytics and OCI. This will include maintaining weekly reporting, data collection and analysis for capturing data around wins/losses, pipeline, trials, cloud consumption, customer success and more.\n\nAdditional responsibilities will include:\n Interface with finance leaders and business development leads for collaboration of data collection, analysis, and sharing/communication of new actionable insights.\n Manage call downs and automated surveys for customer win/loss analysis\n Coordinate weekly reports for pipeline, trials, cloud consumption, and win/loss data\n Analyze win/loss data to identify patterns, use cases, develop new data models\n Work collaboratively with field, product teams, finance, to consolidate data and analyze it consistently\n\nRequired skills:\nAdvanced use of excel for report generation, identify key market statistics, interpret findings, and help executives understand the numbers behind their marketing strategies, sales plays, and product enhancements.\n\nDesired skills:\n 3-4 years in the field of data analysis, market analysis, or sales operations\n Product Marketing or Product Management background in related cloud technologies in PaaS, IaaS, or Database\n\nUnderstand sales financials, pipeline reporting, ARR, consumption data, pay-as-you go\nExperienced at collecting customer win and loss analysis, survey and call-down programs to sales teams.\n\nEducation: B.S. / B.A. Mathematics, Economics, or Computer Science, Marketing and MBA preferred. Life experiences that have provided similar grounding in marketing are also appropriate.\n\nLocation: Redwood Shores, CA\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\n\n\nContact: Erin Smith, Recruiter – erin.d.smith@oracle.com\n\n\nAs part of Oracle’s employment process candidates will be required to complete a pre-employment screening process, prior to an offer being made. This\nwill involve identity and employment verification, salary verification, professional references, education verification and professional qualifications\nand memberships (if applicable).\n\nDetailed Description and Job Requirements\n\nDevelopment and implementation of business plans, marketing strategy, and forecasts for a product/service or vertical market.\n\nAs a product analyst you will participate in every stage of the product life cycle to ensure product meets the needs of users. Drive the implementation of programs in support of the marketing strategy, business plans, and forecasts for assigned product lines. Maintains current status of customer specifications for existing and future products. Identify, evaluate, and recommend marketing opportunities in support of product line objectives. Drive product functionality delivering high quality product documentation. Lead products through scheduled release assisting others to manage commitments and resources. Measure and report progress and review deliverables.\n\nJob duties are varied and complex utilizing independent judgment. May have project lead role. Demonstrated product/project management experience. Excellent written and verbal communication. Demonstrated product/project management experience. Thrives in fast paced environment Team player. Experience using or implementing Oracle, SAP, or Peoplesoft applications. 5 years related experience and BA/BS degree in marketing or technical major preferred.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.",
        "tags":[
            "Oracle"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=8b9740def12ffd79"
    },
    "bea5c46477c7c90b":{
        "title":"Principal IT Engineer DevOps Coach",
        "company":"Kaiser Permanente",
        "location":"Oakland, CA 94612",
        "apply_url":"https://www.indeed.com/rc/clk?jk=bea5c46477c7c90b&atk=",
        "description":"This senior level employee is primarily responsible for translating business requirements and functional specifications into software solutions, for contributing to and leveraging the technical direction for the development of integrated business and/or enterprise application solutions, and for serving as a technical expert for project teams while providing consultation to help ensure new and existing software solutions are developed.\n\n\nEssential Responsibilities:\n\nConducts or oversees business-specific projects by applying deep expertise in subject area; promoting adherence to all procedures and policies; developing work plans to meet business priorities and deadlines; determining and carrying out processes and methodologies; coordinating and delegating resources to accomplish organizational goals; partnering internally and externally to make effective business decisions; solving complex problems; escalating issues or risks, as appropriate; monitoring progress and results; recognizing and capitalizing on improvement opportunities; evaluating recommendations made; and influencing the completion of project tasks by others.\n\nPractices self-leadership and promotes learning in others by building relationships with cross-functional stakeholders; communicating information and providing advice to drive projects forward; influencing team members within assigned unit; listening and responding to, seeking, and addressing performance feedback; adapting to competing demands and new responsibilities; providing feedback to others, including upward feedback to leadership and mentoring junior team members; creating and executing plans to capitalize on strengths and improve opportunity areas; and adapting to and learning from change, difficulties, and feedback.\n\nAs part of the IT Engineering job family, this position is responsible for leveraging DEVOPS, and both Waterfall and Agile practices, to design, develop, and deliver resilient, secure, multi-channel, high-volume, high-transaction, on/off-premise, cloud-based solutions.\n\nProvides insight into recommendations for technical solutions that meet design and functional needs.\n\nTranslates business requirements and functional specifications into physical program designs, code modules, stable application systems, and software solutions by partnering with Business Analysts and other team members to understand business needs and functional specifications.\n\nEnsures appropriate translation of business requirements and functional specifications into physical program designs, code modules, stable application systems, and software solutions by partnering with Business Analysts and other team members to understand business needs and functional specifications.\n\nServes as an expert for innovative technical solutions that meet design and functional needs.\n\nFacilitates and serves as a technical expert for project teams throughout the release schedule of business and enterprise software solutions.\n\nBuilds and maintains trusting relationships with internal customers, third party vendors, and senior management to ensure the alignment, buy-in, and support of diverse project stakeholders.\n\nRecommends complex technical solutions that meet design and functional needs.\n\nCollaborates with architects and/or software consultants to ensure functional specifications are converted into flexible, scalable, and maintainable solution designs.\n\nProvides expertise and guidance to team members for systems incident responses for complex issues.\n\nProvides implementation and post-implementation triage and support of business software solutions by programming and/or configuring enhancements to new or packaged-based systems and applications.\n\nReviews and validates technical specifications and documentation.\n\nIdentifies specific interfaces, methods, parameters, procedures, and functions to support technical solutions while incorporating architectural designs.\n\nSupports component integration testing (CIT) and user acceptance testing (UAT) for application initiatives by providing triage, attending test team meetings, keeping the QC up-to-date, performing fixes and unit testing, providing insight to testing teams in order to ensure the appropriate depth of test coverage, and supporting the development of proper documentation.\n\nLeads systems incident support and troubleshooting for complex and non-complex issues.\n\nIdentifies specific interfaces, methods, parameters, procedures, and functions, as required, to support technical solutions serving as an escalation point for complex or unresolved issues related to requirements translation.\n\nDevelops and validates complex testing scenarios to identify application errors and ensure software solutions meet functional specifications.\n\nParticipates in all software development lifecycle phases by applying comprehensive understanding of company methodology, policies, standards, and internal and external controls.\n\nDevelops, configures, or modifies basic to moderately complex integrated business and/or enterprise application solutions within various computing environments by designing and coding component-based applications using programming languages.\n\nProvides consultation to help ensure new and existing software solutions are developed with insight into industry best practices, strategies, and architectures.\n\nBuilds partnerships with IT teams and vendors to ensure written code adheres to company architectural standards, design patterns, and technical specifications.\n\nLeads the development, validation, and execution of testing scenarios to identify application errors and ensure software solutions meet functional specifications.\n\nLeads, mentors, and trains other technical resources to develop software applications.\n\nMinimum Qualifications:\nMinimum five (5) years experience working on project(s) involving the implementation of solutions applying development life cycles (e.g., SDLC).\nMinimum two (2) years in a technical leadership role with or without direct reports.\nBachelor's degree in Computer Science, CIS, or related field and Minimum eight (8) years experience in software development or a related field. Additional equivalent work experience may be substituted for the degree requirement.\n\nPreferred Qualifications:\nTwo (2) years of work experience in a role requiring interaction with senior leadership (e.g., Director level and above)\nFour (4) years experience in systems analysis, including defining technical requirements and performing high level design for complex solutions.\nFour (4) years experience with engineering tools such as bug tracking and source code control systems.\nThree (3) years experience in a leadership role of a large matrixed organization.\nFour (4) years experience working with an IT Infrastructure Library (ITIL) framework.\nThree (3) years of IT experience developing and implementing business systems within an organization.\nThree (3) years experience developing and/or implementing mobile applications.\nThree (3) years experience working with Git source code control.\nThree (3) years experience in test-driven application development.\nThree (3) years development experience integrating with 3rd party systems.\nThree (3) years of development experience with Agile Methodology\nThree (3) years of development experience with AIX\nThree (3) years of development experience using DevOps\nThree (3) years of development experience with Git\nPrimaryLocation : California,Oakland,2101 Webster 2101 Webster St.\nHoursPerWeek : 40\nShift : Day\nWorkdays : Mon, Tue, Wed, Thu, Fri\nWorkingHoursStart : 9:00 AM\nWorkingHoursEnd : 5:00 PM\nJob Schedule : Full-time\nJob Type : Standard\nEmployee Status : Regular\nEmployee Group/Union Affiliation : Salaried, Non-Union, Exempt\nJob Level : Individual Contributor\nJob Category : Information Technology\nDepartment : DevOps Enablement\nTravel : Yes, 5 % of the Time\nKaiser Permanente is an equal opportunity employer committed to a diverse and inclusive workforce. Applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), age, sexual orientation, national origin, marital status, parental status, ancestry, disability, gender identity, veteran status, genetic information, other distinguishing characteristics of diversity and inclusion, or any other protected status.\n\nExternal hires must pass a background check/drug screen. Qualified applicants with arrest and/or conviction records will be considered for employment in a manner consistent with federal and state laws, as well as applicable local ordinances, including but not limited to the San Francisco and Los Angeles Fair Chance Ordinances.",
        "tags":[
            "Scala",
            "RDS",
            "AWS",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=bea5c46477c7c90b"
    },
    "2972c0744c9bab0f":{
        "title":"APeX Application Analyst",
        "company":"University of California San Francisco Medical Center",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=2972c0744c9bab0f&atk=",
        "description":"The APeX Ambulatory team falls under the Clinical Systems department, which is responsible for the build and maintenance of the UCSF electronic health record (Epic) as well as the Benioff Children’s Hospital Oakland’s EHR.\nThe APeX Ambulatory Analyst will work in collaboration with other APeX application teams, clinical/business operations and guides to enhance and maintain the Epic electronic health record. The analyst provides excellent customer service to end users, tracks issues and follows-up as appropriate.\nAnalysts will work in multiple locations including UCSF Medical Center locations, Benioff Children’s Hospitals-Oakland and San Francisco, UCSF campus, and community connect partners.\n\n\nRequired Qualifications\n\n\nThree years relevant work experience\nEpic Certification completed within six months of hire\nEpiCare Ambulatory Certification within six months of hire\nBachelor's Degree in Health Care Information Technology, Computer Science, or related area, and / or equivalent combination of experience / training\nBroad and / or in-depth knowledge of one to two areas of focus in clinical applications specialty area(s); knowledge of systems and functions, including design, development, implementation, user support and training, maintenance, quality assurance, and system testing and evaluation\nStrong problem-resolution skills, with the ability to quickly diagnose problems, and develop, test, and implement appropriate and effective solutions in a timely manner\nStrong interpersonal skills, with the ability to effectively, train, support, and work collaboratively with users of clinical information systems at all professional and technical levels\nDetail oriented, with proven organizational skills and the ability to effectively manage time, prioritize tasks, and see projects through to completion on deadline\nStrong written and verbal communications skills, with the ability to convey technical information and instructions to all levels of clinical applications users in a specific, clear, and concise manner\nStrong analytical skills and knowledge in documentation and reporting, with the ability to design and execute tests, analyze system performance data, and produce substantive reports and analyses\nAbility to work with senior staff and managers, serving as a technical resource and providing advice and counsel on issues of functionality, efficiency, cost-effectiveness, policy, and performance\nThe flexibility to orient and work at all UCSF Medical Center locations\n\nPreferred Qualifications\n\n\nClinical License of RN, MA or other Tech license/certification\n\nLicensure/Certification\n\n\nEpic Certification completed within six months of hire\nEpiCare Ambulatory Certification within six months of hire\n\nLiving Pride Standards\n\n\nService Excellence\nDemonstrates service excellence by following the Everyday PRIDE Guide with the UCSF Medical Center standards and expectations for communication and behavior. These standards and expectations convey specific behavior associated with the Medical Center’s values: Professionalism, Respect, Integrity, Diversity and Excellence, and provide guidance on how we communicate with patients, visitors, faculty, staff, and students, virtually everyone, every day and with every encounter. These standards include, but are not limited to: personal appearance, acknowledging and greeting all patients and families, introductions using AIDET, managing up, service recovery, managing delays and expectations, phone standards, electronic communication, team work, cultural sensitivity and competency.\nUses effective communication skills with patients and staff; demonstrates proper telephone techniques and etiquette; acts as an escort to any patient or family member needing directions; shows sensitivity to differences of culture; demonstrates a positive and supportive manner in which patients / families/ colleagues perceive interactions as positive and supportive. Exhibits team work skills to positively acknowledge and recognize other colleagues, and uses personal experiences to model and teach Living PRIDE standards.\nExhibits tact and professionalism in difficult situations according to PRIDE Values and Practices\nDemonstrates an understanding of and adheres to privacy, confidentiality, and security policies and procedures related to Protected Health Information (PHI) or other sensitive and personal information.\nDemonstrates an understanding of and adheres to safety and infection control policies and procedures.\nAssumes accountability for improving quality metrics associated with department/unit and meeting organizational/departmental targets.\nWork Environment\nKeeps working areas neat, orderly and clutter-free, including the hallways. Adheres to cleaning processes and puts things back where they belong. Removes and reports broken equipment and furniture.\nPicks up and disposes of any litter found throughout entire facility.\nPosts flyers and posters in designated areas only; does not post on walls, doors or windows.\nKnows where the Environment of Care Manual is kept in department; corrects or reports unsafe conditions to the appropriate departments.\nProtects the physical environment and equipment from damage and theft.\nThe flexibility to orient and work at all UCSF Medical Center locations is required.\n\n\nEqual Employment Opportunity\n\n\nThe University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. Further information about the University of California, San Francisco, is available at diversity.ucsf.edu. UCSF seeks candidates whose skills, and personal and professional experience, have prepared them to contribute to our commitment to diversity and excellence, and the communities we serve.",
        "tags":[
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=2972c0744c9bab0f"
    },
    "4e3877af3d0329d5":{
        "title":"Data Wrangler, Precision Ag Analytics",
        "company":"John Deere",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=4e3877af3d0329d5&atk=",
        "description":"There are 7 billion people on this planet. And by 2050, there will be 2 billion more... many moving into urban centers at an unprecedented rate. Making sure there is enough food, fiber and infrastructure for our rapidly growing world is what we’re all about at John Deere. And it’s why we’re investing in our people and our technology like never before in our 175-year history. Here the world’s brightest minds are tackling the world’s biggest challenges. If you believe one person can make the world a better place, we’ll put you to work. RIGHT NOW.\nPrimary Location: United States (US) - California (US-CA) - San Francisco\nFunction: Data Science & Analytics\nTitle: Data Wrangler, Precision Ag Analytics - 56982\n\nYour Responsibilities\n\nNote: This position may be located in Urbandale, IA, or San Francisco, CA, per the hiring manager's discretion. This may be dependent on the successful candidate's background, experience, and proficiency:\n\nAs a Data Wrangler, Precision Ag Analytics for John Deere’s Intelligent Services Group (ISG), you will join our team building world class data science solutions to enable smarter machines and better decisions for our customers. As a data wrangler – you will iteratively evaluate and transform data from a variety of sources (including geospatial, transactional, and imagery data) while partnering with a data scientist to create algorithms utilizing machine learning and artificial intelligence. Join a team that is passionate about making a difference by applying cutting edge technology to solve some of the world's biggest problems. In addition, you will:\n\nDiscover, ingest, and evaluate data for completeness and quality and recommend cleaning techniques as appropriate for data science solutions\nDevelop and execute data transformation within a cloud environment to progress data science solutions forward\nResearch and recommend methods and technology to efficiently manage data and processing to support the operationalization of data science\nCollaborate and communicate closely with data scientists and engineers to identify and build needed infrastructure, tools, and libraries to support machine learning algorithms\nVisa sponsorship is NOT available for this position.\nWhat Skills You Need\n2 or more years of experience and proficiency in at least two of the following technologies - SQL, Python, Scala, or Spark\n2 or more years working with large data sets and data processing within a cloud-based environment\n2 or more years of experience working across data sources to generate insights\n1 or more years of experience analyzing geospatial data\n2 or more years of experience developing analytic/data visualizations\n2 or more years of experience working with relational databases\nWhat Makes You Stand Out\nOther areas of experience or interest that will help us place you on the right team include:\n2 or more years of experience working with unstructured data\n2 or more years of experience working with agronomic data\n2 or more years of experience working on cross-functional projects\nExperience working in an agile environment\nEducation (or equivalent work experience)\nBachelor's degree in Computer Science, Computer Engineering, or Data and Analytics\nWhat You'll Get\nAt John Deere, you are empowered to create a career that will take you to where you want to go. Here, you'll enjoy the freedom to explore new projects, the support to think outside the box and the advanced tools and technology that foster innovation and achievement. We offer comprehensive relocation and reward packages to help you get started on your new career path. Click here to find out more about our Total Rewards Package.\nThe information contained herein is not intended to be an exhaustive list of all responsibilities and qualifications required of individuals performing the job. The qualifications detailed in this job description are not considered the minimum requirements necessary to perform the job, but rather as guidelines.\nJohn Deere is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, sex, age, sexual orientation, gender identity or expression, status as a protected veteran, or status as a qualified individual with disability.",
        "tags":[
            "Python",
            "Scala",
            "Spark",
            "SQL",
            "RDS",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=4e3877af3d0329d5"
    }
}