{
    "3d2e8976292e3e11":{
        "title":"Front End Engineer",
        "company":"Myra Labs",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=3d2e8976292e3e11&atk=",
        "description":"We are seeking an experienced engineer to build responsive and elegant interfaces for human-AI interaction. Come literally invent the best ways for AI assistants to present themselves and interact with consumers, using a blend of natural language understanding and traditional UI elements.\nResponsibilities\nDesign and implement user interfaces for our AI assistants and the services that run them.\nOptimize web applications to maximize performance across mobile and desktop\nSet technical product direction on front-end technologies\nIdentify and resolve issues of performance and scaling\nPreferred qualifications\n3+ years of HTML/CSS experience, including layout, cross-browser compatibility, and accessibility\n3+ years of JavaScript experience\nKnowledge of web libraries and frameworks like React, AngularJS\nExposure to Python, JVM languages, Go, Linux, open source software, and cloud services is a plus!\nInterest in machine learning and natural language understanding is a plus!\nThe upside\nInventing something brand new and exposure to some of the most state-of-the-art technologies around\nYou will have a significant impact with ownership and autonomy over large parts of our technical stack\nCompetitive salary and significant equity at a fast growing company\nMaximize your potential with flexible hours and leave policies\nMedical, dental, and vision benefits\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "tags":[
            "JavaScript",
            "HTML",
            "CSS",
            "Java",
            "Python",
            "Angular",
            "React",
            "Linux",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=3d2e8976292e3e11"
    },
    "c70a7b528534428e":{
        "title":"Full Stack / Infrastructure Engineer",
        "company":"Myra Labs",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=c70a7b528534428e&atk=",
        "description":"We are seeking an experienced engineer to own and enhance our data processing and machine learning serving architecture.\nResponsibilities\nBuild serving infrastructure and data processing systems that serve our machine learning algorithms that scale on cloud platforms like AWS or Google Cloud Platform\nLead feature, service and system design and architecture; strategize and implement product roadmap\nIf desired, communicate externally: speak at conferences, publish blog posts, and release open source software\nPreferred qualifications\nExperience with relational databases and key value stores like Postgres and Cassandra\nExperience building high-performance serving infrastructure\nExperience developing API layers\nKnowledge of cloud deployment and server orchestration\nExperience with Python, JVM languages, or Go, Linux, open source software, and cloud services\nMS/PhD in Computer Science or a related field\nTeam building skills to hire and grow future talent and cultivate growth and innovation\nThe upside\nYou will be a pioneer in building state-of-the-art infrastructure to run conversational engines that will affect millions of people\nYou will have a significant impact with ownership and autonomy over large parts of our technical stack\nCompetitive salary and significant equity at a fast growing company\nMaximize your potential with flexible hours and leave policies\nMedical, dental, and vision benefits\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "tags":[
            "Python",
            "Cassandra",
            "Linux",
            "AWS",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=c70a7b528534428e"
    },
    "edad5bfa20815962":{
        "title":"Senior Software Engineer - Backend",
        "company":"Socotra",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=edad5bfa20815962&atk=",
        "description":"Socotra engineering values thorough planning, self improvement, enabling the business with technology, and continuous delivery.\nSocotra engineers work closely with the product team to deliver meaningful, well tested, high quality changes to customers.\nA Senior Software Engineer is responsible for leading feature planning, executing project work, and supporting the core product.\nResponsibilities\nGather business requirements and lead feature planning with the product team\nInform all aspects of project work such as testing requirements, security, capacity planning, and product cohesion\nWrite well-designed, testable code\nProvide peer review and feedback of engineering work\nRequirements\nBachelor's degree in Computer Science or related technical field\n5+ year experience designing and building software applications\nFluency with Java\nProficiency with cloud computing\nProficiency understanding complex systems\nProficiency with software engineering tool\nNice to Haves\nStrong sense for proper testing methodologies\nFamiliarity with big data, search, and analytics technologies\nExperience with distributed systems\nAbility to operate in a UNIX environment\nPrevious knowledge of AWS, Spring, DynamoDB, SQL, Tomcat, Docker, Python, and/or Ruby\nBenefits\nMeaningful equity at an early stage company\nDaily catered lunch and countless snacks\nGreat location in San Francisco's SOMA district (close to public transport)\nTop-tier health benefits\nFitness stipend\nCommuter benefits\nFun team offsites (past examples: skiing in Tahoe, Yosemite summer trip, cocktail class, baseball games, and more)\nThis position is based in San Francisco and includes salary and equity commensurate with experience.",
        "tags":[
            "Java",
            "Python",
            "Ruby",
            "Spring",
            "SQL",
            "DynamoDB",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=edad5bfa20815962"
    },
    "bce87d9fc756950a":{
        "title":"Solutions Engineer",
        "company":"Socotra",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=bce87d9fc756950a&atk=",
        "description":"Socotra’s Solutions Engineers work with our clients to design, develop, and deploy core insurance software that leverages Socotra’s platform. Solutions Engineers are experienced engineers with a strong background developing integrations, consulting with customers to understand their objectives, and leveraging technology to drive business value.\nYou will\nBecome an expert on Socotra’s APIs and how to best deploy them.\nWrite code in Socotra’s primary deployment languages (Python and JavaScript).\nWork hand-in-hand with Socotra’s Business organization to develop proof of concept applications, present technical demonstrations, and help Socotra clients make the most of their integration.\nOwn and drive relationships with external technical audiences of all kinds — from engineer to - CTO — to understand business objectives and translate requirements into solutions.\nProvide structured feedback and work closely with Socotra’s Product Engineering team.\nTravel 15% of the time to spend time with customers around the world.\n\nYou should be\nA capable engineer, with previous background building web or mobile applications.\nExperienced in software architecture patterns and able to understand how a wide variety of technologies and systems interact with each other.\nA great communicator, comfortable explaining complex concepts to both technical and non-technical audiences.\nInterested in solving open ended business problems with a combination of technology and creative thinking.\nExperienced working in the sales lifecycle and driving outcomes in a customer-facing environment.\nFluent in English.\n\nThe ideal candidate\nHas experience integrating RESTful APIs into web applications.\nHas a background working in a similar customer-facing role (e.g. solutions architect, sales engineer, or partner engineer).\nAt least 2 years experience.\nThrives in a cross-functional, collaborative environment.\nYour CV, résumé, Github, or LinkedIn page.\nLinks to code or other work of which you’re particularly proud.\n\nBenefits\nMeaningful equity at an early stage company\nDaily catered lunch and countless snacks\nGreat location in San Francisco's SOMA district (close to public transport)\nTop-tier health benefits\nFitness stipend\nCommuter benefits\nFun team offsites (past examples: skiing in Tahoe, Yosemite summer trip, cocktail class, baseball games, and more)\n\nThis position is based in San Francisco and includes salary and equity commensurate with experience.",
        "tags":[
            "JavaScript",
            "Java",
            "Python"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=bce87d9fc756950a"
    },
    "888983ff74f5b113":{
        "title":"Machine Learning Engineer",
        "company":"Myra Labs",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=888983ff74f5b113&atk=",
        "description":"We are seeking an experienced engineer to improve and expand our state-of-the-art models and bring groundbreaking techniques into production.\nResponsibilities\nDevelop and implement cutting edge algorithms to improve conversational artificial intelligence\nBuild and improve pipelines that run deep and shallow neural networks at scale\nSet technical product direction on NLP and learning systems\nIf desired, communicate externally: speak at conferences, publish blog posts, and release open source software\nPreferred qualifications\nKnowledge of machine learning theory and frameworks like skikit-learn or Spark MLlib\nExposure to Deep Learning theory and environments like Theano, Tensorflow, Torch or Caffe\nUnderstanding of NLP fundamentals and libraries a plus!\nExperience with Python, JVM languages, Go, Linux, open source software, and cloud services\n4+ years of engineering experience building machine learning based applications\nMS/PhD in Computer Science, Artificial Intelligence, Machine Learning, or related technical field.\nThe upside\nYou will be continually learning and pushing the state-of-the-art in machine learning and NLP\nYou will have a significant impact with ownership and autonomy over large parts of our technical stack\nCompetitive salary and significant equity at a fast growing company\nMaximize your potential with flexible hours and leave policies\nMedical, dental, and vision benefits\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "tags":[
            "Python",
            "TensorFlow",
            "Spark",
            "Linux",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=888983ff74f5b113"
    },
    "8d1981b90587fc58":{
        "title":"Data Engineer",
        "company":"RingCentral, Inc.",
        "location":"Belmont, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=8d1981b90587fc58&atk=",
        "description":"Data Engineer\n\nJob Type: Full-Time\nLocation: Belmont, CA\nDepartment: Operations\n\nThe RingCentral environment is dynamic, success-driven, team-oriented and committed to providing world class service for its customers. Do you have the ability to thrive in a fast-paced environment? We are looking for candidates with an entrepreneurial spark!\nWe’re not a phone company; we’re a cloud business-solutions provider. We've thrown out the old PBX along with its rigid rules and eliminated the complexity and unnecessary expense of managing business communications the old way.\nRingCentral fosters career development and provides leadership training, education, workshops, and coaching for all employees. RingCentral promotes a healthy work-life balance by providing catered lunch and breakfast on a daily basis as well as a kitchen stocked with a variety of complimentary beverages and delicious snacks.\nWe’re creating cool, disruptive products and we need your help!\n\nWe are looking for Data Engineer to join our growing Data team. The hire will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. The right candidate will be excited by the prospect of optimizing or even re-designing our company’s data architecture to support our next generation of products and data initiatives.\n\nResponsibilities:\n\nCreate and maintain optimal data pipeline architecture,Assemble large, complex data sets that meet functional / non-functional business requirements.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sourcesBuild analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics.Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.Work with data and analytics experts to strive for greater functionality in our data systems.Participate in on-call rotation to support data pipelines and tools\n\nQualifications:\n\nB.S in Computer Science etc. plus 2 - 3 years of experienceExperience with management data pipelines/big data tools: StreamSets, Airflow, ELK etcExperience with one of AWS/Google public cloudsProgramming experience (at least one): Python, Java, etcNice to have devops experience: Ansible, Jenkins, Chef etcNice to have Anomaly Detection/Machine Learning experienceAbility to work in very diverse multicultural environmentGood communication skillsGood team player with self-starter ability\nThe RingCentral environment is fast paced, high octane, success driven, team oriented, and is committed to growing the business in a virtually untapped market.\n\nAbout RingCentral\n\nRingCentral, Inc. (NYSE: RNG) is a global provider of cloud unified communications and collaboration solutions. More flexible and cost-effective than legacy on-premise systems, RingCentral empowers today’s mobile and distributed workforces to be connected anywhere and on any device through voice, video, team messaging, collaboration, SMS, conferencing, online meetings, contact center, and fax. RingCentral provides an open platform that integrates with today’s leading business apps while giving customers the flexibility to customize their own workflows. RingCentral is a leader in the 2016 Gartner Magic Quadrant for Unified Communications as a Service Worldwide for the second consecutive year. RingCentral is headquartered in Belmont, Calif.\nRingCentral is an EEO/AA employer.",
        "tags":[
            "Java",
            "Python",
            "Spark",
            "AWS",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=8d1981b90587fc58"
    },
    "b0698765d7578632":{
        "title":"Senior DevOps Engineer",
        "company":"Tierion",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=b0698765d7578632&atk=",
        "description":"San Francisco\nAbout Tierion\nTierion’s mission is to replace trust with proof. We see a future where the blockchain is the trust anchor for the world’s data. We started by creating Chainpoint, an open protocol for anchoring data to the Bitcoin blockchain. Next, we launched the Chainpoint Network; a global proof engine that can verify the integrity and timestamp of any data, file, or business process. Today we’re focused on advancing Chainpoint and building Proof.\nJob Description\nAs a Senior DevOps Engineer, you’ll help architect and manage the infrastructure behind Chainpoint and Proof. You’ll be part of an experienced team that cares deeply about building great software, and is excited about working at the forefront of the blockchain industry. We don’t consider DevOps a backend function at Tierion. It’s vital part of delivering a positive experience to developers and end users.\n\nResponsibilities\nBuild, test and manage infrastructure and code using modern tools.\nDesign and build new infrastructure environments using modern best practices for infrastructure as code, CI/CD, security, and performance.\nHandle release management and code deployment.\nTroubleshoot and resolve production issues.\nRequirements\nYou have at least 5 years DevOps experience\nYou have at least 2 years of experience with Google Cloud, AWS, or Azure.\nExpertise with Git, Google Cloud, Docker, Kubernetes, and Ubuntu and Alpine Linux.\nStrong skills with tooling such as Bash shell scripting, Systemd, and Make.\nYou’ve implemented and managed complex micro-service architectures.\nYou’re comfortable operating in dynamic environments, and are self-directed.\nNice to haves\nInfrastructure as code using tools like Teraform, Ansible, Chef, etc.\nExperience with CockroachDB, RocksDB, Redis, PostgreSQL\nExperience working with Bitcoin, Ethereum, or other blockchain tech\nExperience with cryptography\nIn case you are wondering, we’re powered by Node.js, CockroachDB, PostgreSQL, RabbitMQ, Redis, and Consul. We keep everything glued together with Docker, Docker Compose, and Kubernetes.\nWhat We Offer\nEveryone at Tierion works hard and has a lot of fun. Our beautiful office overlooks the bay in San Francisco. Tierion provides competitive salaries, equity, and full benefits.\n\nTierion covers 100% of medical/vision/dental for employees\nCommuter benefits (up to $260/month for employees in our SF office)\n401K plan with 100% matching\nFlexible work hours\nFlexible vacation schedule\nRe-location support\nHow to Apply\nSend us the following:\n\nLinks to your GitHub/Stack Overflow or something that you've built\nA brief answer to the following question: What have you built that you’re most proud of?\nYour resume or LinkedIn profile\nTierion does not provide visa sponsorship.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nSkills\nGit, Google Cloud, Docker, Kubernetes, Ubuntu, Alpine Linux\nCompensation\n$150K - $180K",
        "tags":[
            "Bash",
            "Node.js",
            "SQL",
            "PostgreSQL",
            "Redis",
            "Linux",
            "AWS",
            "Azure"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=b0698765d7578632"
    },
    "0b3c03459035aaf7":{
        "title":"Supplier Development Engineer",
        "company":"MDC Vacuum",
        "location":"Hayward, CA 94541",
        "apply_url":"https://www.indeed.com/rc/clk?jk=0b3c03459035aaf7&atk=",
        "description":"Function & Responsibility\nJoin the MDC Supply Chain team and become a major part managing our innovative products from inception to delivery. Supply Chain employees have the opportunity to network across our departmental functions, business units and suppliers, all while improving the productivity, quality and efficiency of our operations worldwide.\nThis position is for a motivated professional who monitors supplier performance, conducts on-site assessments, and engages suppliers in issue resolution. Utilize MDC’s Supplier Management Manual and monitor/analyze key performance indicators to drive improvement in collaboration with suppliers. Develop new supply sources to improve cost competitiveness and be the conduit between the company and the supplier. Ensure customer specific requirements are passed down through to suppliers. Engage in cross-functional program management to qualify new components, support issues with current production, develop new suppliers to reduce cost, increase capacity, and audit suppliers to ensure process conformance.\nPrimary Responsibilities:\nUtilize Supplier Management Manual to improve supplier performance to preferred supplier standards\nDrive improvements utilizing Lean methodologies, supplier scorecards and own supplier audit, ensuring supplier compliance, whilst driving systematic problem solving and process improvement plans to deliver value\nTrack the supplier’s performance indicators (OTD, DPPM, responsiveness), based on their scorecards and rankings, to facilitate and develop the supply base’s ability to consistently meet or exceed defined expectations\nBased on performance, prioritize preferred suppliers\nResearch external market information and entrepreneurial companies to identify potential sources and suppliers\nDrive supplier selection through robust qualification processes\nDevelop positive relationships and work closely with sourcing leaders to manage, implement and track supplier/engineering, design changes, capacity studies and New Product Introductions, and transfers\nDeliver results as measured by key metrics, such as supplier OTD, defective parts per million, supplier quality plan engagement/effectiveness, and corrective & preventative action closure\nProvide leadership during investigations of major problems and or special projects focusing on developing working relationships with suppliers and the supply chain with regard to product development and procurement of parts\nPlan, organize, direct and report all activities and matters relating to supplier performance\nAssess supplier qualifications including training and certifications\nKeep up with current and developing manufacturing and engineering trends that concern product quality\nPerform root cause analysis and resolve problems\nIndependently determine approach and assigned tasks\nIdentifies trends and priorities by organizing and graphing/charting data\nApplies project management and/or systems engineering tools to complete complex tasks\nPerform other job duties as assigned\n\nKnowledge, Skills, and Abilities Required\nShows moral courage, openness and honesty in all dealings\nExperience in Sourcing, Engineering, Quality, Manufacturing and program management\nExperience in developing and implementing vendor qualification\nKnowledge of quality and business systems\nCommercial and financial acumen\nVast experience with cross functional management\nReport and Procedure writing with excellent presentation skills\nUnderstanding and interpretation of engineering drawings\nUnderstanding manufacturing processes\nAbility to work in an international culturally diverse and dynamic environment\nGood communication and interpersonal skills\nStrong negotiation and influential skills\nNumerically astute with strong problem-solving skills and expertise to develop and execute objectives for self and others and the ability to effect short-term and some long-term business goals\nDirect experience interfacing with external suppliers and customers\nStrong sense for customer service and high attention to detail\nDirect experience collaborating with engineering and/or manufacturing operations\nWorked in a Lean manufacturing or Lean office, committed to continuous improvement\nSkilled with Microsoft office suite\nSAP or comparable MRP system experience\nOptimistic, resilient and welcomes and champions change\nEngages interest and participation of others and has a collaborative approach to working together\nAbility to work on own initiative and knows when to seek guidance\n\nMinimum Qualifications\nBachelor’s degree in engineering (mechanical, manufacturing, industrial) or related field preferred; experience will substitute for education.\nProficient in computer skills; especially Microsoft suite\nExperience with a modern ERP software\nKnowledge of MRP theory and inventory management basics\nMust have experience working in a manufacturing environment\nIdeally 2+ years of experience",
        "tags":[
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=0b3c03459035aaf7"
    },
    "ee2f68fc7f0b0953":{
        "title":"Sales Director",
        "company":"iSign Solutions",
        "location":"Redwood Shores, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=ee2f68fc7f0b0953&atk=",
        "description":"Full-time\nRedwood Shores, CA, USA\nAre you looking to make the world a better place and to earn a bunch of gold pressed latinum1 in the process? At iSIGN, you would be joining a tightknit group of sales professionals on a mission to change the way the world conducts business, one signature at a time.\nAs a iSIGN sales director, you would enjoy a primary role in bringing our leading products and service to market. Below are details on what we are looking for and of what you might be getting yourself into.\nEssentials\nConfident in your ability to take charge and deliver results with an absolute attention to detail\nComfortable as a key member of our team – strong communication and team skills\nInnate abilities to manage projects simultaneously, to think strategically and to act tactically\nResponsibilities\nDevelop and implement long/short-term strategic account and market vertical management plans\nSecure new business in highly competitive situations from new and existing clients\nDevelop and maintain accurate forecasts, reports and sales pipeline\nProvide clear and concise status updated to company management on a recurring basis\nDevelop and deliver customized sales presentations and products demos (in person and remotely)\nDevelop client business term proposals (including pricing) and negotiate contracts\nDevelop and maintain strong iSIGN product knowledge\nBecome an expert on competitor activity, market trends, client-affecting issues, etc.\nProvide new product and feature recommendations and market information\nEmploy creative problem solving techniques to resolve issues with fairness, equity and consistency\nWork independently in a highly motivated and organized fashion\nFunction and take a leadership role in a team atmosphere\nQualifications\n3+ years of demonstrated experience in a relevant sales role\nVertical market expertise, history and connections\nHistory or success in selling software products and/or services to enterprises (medium to large)\nEducation\nBachelor’s Degree in Computer Science\n\n1 Just kidding. Our sales positions come with a competitive compensation package, including salary, commission, equity and benefits.",
        "tags":[],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=ee2f68fc7f0b0953"
    },
    "8ef22f98a1cc4a3b":{
        "title":"Software Development Snr Director (M5)",
        "company":"Oracle",
        "location":"Redwood City, CA 94065",
        "apply_url":"https://www.indeed.com/rc/clk?jk=8ef22f98a1cc4a3b&atk=",
        "description":"Software Development Snr Director (M5)-19000R7S\n\n\nPreferred Qualifications\n\nOracle Cloud Infrastructure (OCI)\nSr. Director Software Development (M5)\nRedwood City, CA\n\nOracle is building the next generation of cloud infrastructure that encompasses all layers from IaaS to SaaS and manages exabytes of customer data. Migrating customer databases from on premise or third party clouds to oracle cloud is a major focus area in this journey. In this regard the Data Integration team at Oracle Cloud is building and operating an industry leading database migration service in a broadly distributed, multi-tenant cloud environment. We are committed to providing the best in cloud products that meet the needs of our customers in tackling the challenges in their cloud migration.\n\nResponsibilities\nAs the engineering owner of the Database Migration Cloud service you will lead the development teams in building and operating an intelligent, resilient and scalable multi-tenant cloud service. In doing so you will: drive the scrum processes and the operational practices of the team to effectively support a production cloud service. engage with the Oracle cloud infrastructure platform and shared services teams to ensure seamless integration with those services. Engage with the platform and corporate architecture and security teams to ensure the service abides by the necessary standards and architecture patterns in terms of the cloud service overall architecture including high availability, disaster recovery, multi-tenancy management, replication etc. Provide guidance and support to engineers in the team Follow a data driven approach in defining and measuring platform/operational success Participate in production support and operations planning/hardening Imbibe the Oracle cloud infrastructure and corporate values in action and spirit\n\nDesired Skills and Experience10+ years of experience in software development5+ years of experience in engineering management and leadershipExperience in software design and coding in a modern programming language like JavaKnowledge and understanding of solutions for data migration, data management, etc.Experience developing distributed systems and understanding of scale, reliability and performanceExperience building enterprise software and/or cloud native servicesExperience with agile software development methodologies, continuous integration, and continuous deploymentNaturally effective written and verbal communicatorBS or MS in Computer Science or related technical field\nDetailed Description and Job Requirements\n\nManage a team that designs, develops, troubleshoots and debugs software programs for databases, applications, tools, networks etc.\n\nAs a Senior Director of the software engineering division, you will apply your extensive knowledge of software architecture to manage software development tasks associated with developing, debugging or designing software applications, operating systems and databases according to current and future design specifications. Build enhancements within an existing software architecture and envision improvements to the architecture.\n\nDirects and ensures the implementation of operational policies through subordinate managers Interacts internally and externally with executive management involving negotiation of difficult matters to influence policy. Functional expertise and broad company knowledge. Demonstrated leadership and people management skills. Strong communication skills, analytical skills, thorough understanding of product development. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.",
        "tags":[
            "Java",
            "Scala",
            "Oracle",
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=8ef22f98a1cc4a3b"
    },
    "a9a477f1f62a405f":{
        "title":"Clinical Laboratory Associate I",
        "company":"Natera",
        "location":"San Carlos, CA 94070",
        "apply_url":"https://www.indeed.com/rc/clk?jk=a9a477f1f62a405f&atk=",
        "description":"Natera is currently seeking a Clinical Laboratory Associate I (Temporary) to analyze laboratory specimens following the standard methods and procedures while maintaining equipment and instruments in good operating condition by troubleshooting malfunctions as needed.\n\nPRIMARY RESPONSIBILITIES:\nAssists in testing of patient samples according to standard operating procedure in an efficient manner with little to no errors.\nResponsible for maintaining updated understanding and knowledge of methods performed in the lab.\nFollows GLP (good laboratory practice): maintain cleans and organized work space.\nCompletes training and other deadlines on time.\nRecognizes and escalates equipment malfunctions; troubleshoots common errors on the lab floor.\nRecognizes, documents, and escalates protocol deviations in lab to lead/supervisor.\nCommunicates with team and other departments (including via e-mail).\nProvides feedback on day-to-day schedule and tasks to lead/supervisor.\nAssists teammates in completing daily tasks.\nConducts himself/herself in a professional manner.\nAdheres to departmental expectations.\nThis role works with PHI on a regular basis both in paper and electronic form and have an access to various technologies to access PHI (paper and electronic) in order to perform the job.\nEmployee must complete training relating to HIPAA/PHI privacy, General Policies and Procedure Compliance training and security training as soon as possible but not later than the first 30 days of hire.\nMust maintain a current status on Natera training requirements.\nEmployee must pass post offer criminal background check.\nPerforms other duties as assigned.\n\nQUALIFICATIONS:\nBS/BA (or equivalent) in a biological science or similar field of study.\n0-2 years of industry-related experience.\n\nKNOWLEDGE, SKILLS AND ABILITIES:\nExcellent interpersonal, communication, computer, and pipetting skills.\nExcellent oral and written communication skills.\nWord processing and data management.\n\nPHYSICAL DEMANDS & WORK ENVIRONMENT:\nDuties typically performed in BSL-2 lab setting.\nStanding or sitting for long periods of time may be necessary.\nDuties may require working various shifts, weekends, and/or overtime.\n\nOUR OPPORTUNITY:\nDriven by the passion for elevating the science and utility of genetic testing, Natera is committed to helping families identify and manage genetic diseases. Natera is a rapidly-growing diagnostics company with proprietary bioinformatics and molecular technology for analyzing DNA. Our complex technology has been proven clinically and commercially in the prenatal testing space and we are actively researching its applications in the liquid biopsy space for developing products with oncology applications.\n\nThe Natera team consists of highly dedicated statisticians, geneticists, doctors, laboratory scientists, business professionals, software engineers and many other professionals from world-class institutions, who care deeply for our work and each other. When you join Natera, you’ll work hard and grow quickly. Working alongside the elite of the industry, you’ll be stretched and challenged, and take pride in being part of a company that is changing the landscape of genetic disease management.\n\nWHAT WE OFFER:\nCompetitive Benefits. Healthy catered lunches, Premium snacks and beverages, Onsite gym with cardio and weight-training equipment, Game room with satellite TV, Onsite dry cleaning and alteration service with pick-up and delivery, Employee-organized sport leagues, Happy hours and BBQs, Generous Employee Referral program.\nFor more information, visit www.natera.com.\n\nNatera is proud to be an Equal Opportunity Employer.\n\nAbout Natera\n\n\nNatera® is a worldwide genetic testing and diagnostics company that’s changing how doctors and patients manage genetic disease. Our team includes scientists, biostatisticians, researchers, and talented laboratory professionals from around the globe.",
        "tags":[
            "Scala",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=a9a477f1f62a405f"
    },
    "aabbbe2415e5e6ce":{
        "title":"Postdoctoral Employee",
        "company":"Lawrence Berkeley National Laboratory",
        "location":"San Francisco Bay Area, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=aabbbe2415e5e6ce&atk=",
        "description":"Berkeley Lab’s Molecular Foundry Division has an opening for a Postdoc Employee. The postdoctoral fellow will work with researchers in the Imaging and Manipulation of Nanostructures Facility on projects to study the mechanism and dynamics of proteins that are related to human cholesterol metabolism. The approach will be mainly focused on optimization and implication of the Foundry’s in-house developed individual-particle electron tomography (IPET) technique. Research activities will involve biological sample preparation, cryo-TEM operation, image processing. Computer programming and molecular dynamic simulations will be optional.\n\nThe Molecular Foundry at Berkeley Lab is a user facility for the design, synthesis and characterization of materials with nanometer dimensions. One of five Nanoscale Science Research Centers established by the U.S. Department of Energy, its charter defines two primary missions: a) conduct outstanding research across the breadth of nanoscience; and b) collaborate with scientists from around the world who visit to use its state-of-the-art instruments, techniques and expertise to further their own nanoscience research efforts. [See http://foundry.lbl.gov/]\n\nWhat You Will Do:\nTEM specimen preparation\nCryo-EM operation and data acquisition\nImage processing and data manipulation\nDiscuss research results and attend group meetings\nHelp maintain instruments and support users\nDocument and communicate the results of work in reports and oral presentations, including participation in meetings, reviews, conferences and publications in refereed journals.\n\nAdditional Responsibilities as needed:\nComputer programming and molecular dynamic simulations\nBiochemistry experiments\nScientific writing and editing\n\nWhat is Required:\nPh.D. in Biochemistry, Materials Science, Physics, Chemistry, Computer Science\nWell scientific writing and reading\nTeamwork capability\nSelf-motivated\n\nAdditional Desired Qualifications:\nResearch background and experience in TEM, Cryo-EM, crystallography, biochemistry, computer science\nStrong background and experience in mathematics and computer knowledge\n\nThe posting shall remain open until the position is filled.\n\nNotes:\nThis is a full time 1 year postdoctoral appointment with the possibility of renewal based upon satisfactory job performance, continuing availability of funds and ongoing operational needs.\nFull-time, M-F, exempt (monthly paid) from overtime pay.\nThis position is represented by a union for collective bargaining purposes\nSalary will be predetermined based on postdoctoral step rates.\nThis position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.\nWork will be primarily performed at: Lawrence Berkeley National Lab, 1 Cyclotron Road, Berkeley, CA.\n\nLearn About Us:\nBerkeley Lab (LBNL) addresses the world’s most urgent scientific challenges by advancing sustainable energy, protecting human health, creating new materials, and revealing the origin and fate of the universe. Founded in 1931, Berkeley Lab’s scientific expertise has been recognized with 13 Nobel prizes. The University of California manages Berkeley Lab for the U.S. Department of Energy’s Office of Science.\n\nWorking at Berkeley Lab has many rewards including a competitive compensation program, excellent health and welfare programs, a retirement program that is second to none, and outstanding development opportunities. To view information about the many rewards that are offered at Berkeley Lab- Click Here.\n\nEqual Employment Opportunity: Berkeley Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Berkeley Lab is in compliance with the Pay Transparency Nondiscrimination Provision under 41 CFR 60-1.4. Click here to view the poster and supplement: \"Equal Employment Opportunity is the Law.",
        "tags":[
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=aabbbe2415e5e6ce"
    },
    "fc3cc2fcb22909a9":{
        "title":"Senior Software Engineer",
        "company":"StubHub",
        "location":"San Francisco, CA 94105",
        "apply_url":"https://www.indeed.com/rc/clk?jk=fc3cc2fcb22909a9&atk=",
        "description":"About Stubhub\nOwned by eBay, StubHub’s mission is to connect people through inspiring event experiences. We connect fans with their favorite teams, shows and artists and introduce them to the ones they’ll love next. As the largest ticket marketplace in the world, we enable fans to buy and sell tickets to tens of thousands of events, whenever they want, through our desktop and mobile experiences, including our StubHub app for iPhone, iPad, Apple Watch and Android.\nOffering a delightful fan experience at its core, StubHub reinvented the ticket resale market in 2000 and continues to lead it through innovation. Our business partners include more than 130 properties in MLB, NBA, NHL, MLS and NCAA, plus AEG, AXS and Spectra Ticketing & Fan Engagement. In May of 2016, StubHub expanded into more than 40 additional markets with the acquisition of Ticketbis.\nStubHub’s vision encompasses four goals:\nBuilding a strong culture and talent magnet for diverse backgrounds\nBroadening our geographic footprint with #1 or #2 position in key markets\nBeing an indispensable industry partner bringing audiences together\nBeing everywhere our customers are and playing a larger role in their lives\nWe are looking for\nA Senior Software Engineering Developer for backend development, but not the regular kind.\nSomebody that has a really strong technical background with experience on the latest and greatest framework fads over the last few years.\nSomebody who has solid backend development skills. Someone who has experience to build scalable, reliable, and efficient application systems required to meet our rapidly increasing demand.\nSomeone who can work closely with PMO, UX, PM, and other functions to ensure that projects are delivering expectations\nSomebody who has a passion to own our own destiny by taking ideas from design to delivered products. Our team is DEVOPS team (we own the code from creation to production) and we work directly with our users to make our products better.\nSomebody who is willing to try new methodology. Someone that has moved fast & broken things, because they now understand the value of a customer's trust.\nSomebody who really cares customer’s business, their challenges and delivers value to our customers\nYou Bring\n5+ years hands-on experience dedicated to providing application solutions\nBS in Computer Science, Engineering, or related technical discipline or equivalent combination of training and experience\nExceptional verbal and written communication skills.\nSolid understanding of data structures and algorithm fundamentals\nSolid understanding of domain-driven design\nExtensive hands-on experience and expertise in object-oriented as well as functional design methodology using Java or other object-oriented language\nExperience building modern service applications on a framework like Spring Boot.\nSolid understanding of API's development using REST JSON/XML, security standards e.g., OAUTH and\nExperience developing queue-based services, especially services that use Kafka (preferred) or RabbitMQ\nExperience create build and deployment pipelines within a micro services architecture\nExperience of engineering practices such as code refactoring, design patterns, design-driven development, continuous integration, building highly scalable applications, application security\nAgile development methodologies experience, continuous integration, continuous delivery, and related techniques\nPassion for shipping high quality, clean, tested code with an aim to delight users.\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\nView our privacy policy\nView our accessibility info\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.\nFor more information see:\nEEO is the Law Poster\nEEO is the Law Poster Supplement",
        "tags":[
            "Java",
            "Scala",
            "Spring",
            "RDS",
            "Android"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=fc3cc2fcb22909a9"
    },
    "5b9c8fee498bb814":{
        "title":"Navigation Functions Tester - Automotive Infotainment systems",
        "company":"omega solutions inc",
        "location":"Belmont, CA 94002",
        "apply_url":"https://www.indeed.com/rc/clk?jk=5b9c8fee498bb814&atk=",
        "description":"Title: Navigation Functions TEST ENGINEER-INFOTAINMENT SYSTEMS\n\nBelmont, CA\n4 months + contract\n\nn this position, you would become part of a dynamic team that focuses on the series development support of electronic/electronic systems with particular relevance to the US and Canadian markets. People most suited for this position are able to derive technical systems from market-driven ideas, assertively work with suppliers building trust and finding common ground solutions, and work well in a multi-disciplined environment. Is this you?\n\nTravel is estimated to be 15-20%.\n\nThese will be your tasks\n\nA Navigation Function Test engineer for future brand infotainment platforms in cars such as VW, Audi, Porsche, Bentley, Bugatti, Lamborghini. Seriously - can a job get more fun?\n\n\nYou excel at engaging with our international partners\nWe want someone with the ability to partner with VW Group development department for test, launch and series support of electronic car systems\nIdeally, you love cars and have worked with automotive and OEM suppliers of automobile and testing electronics hardware and software\nYou can eloquently express and advocate product improvement ideas\nYou love identifying and highlighting new technology/trends that would advance the field to our various partners\nYou enjoy creating and updating test procedures, plans, and routes in order to effectively perform laboratory and test drives with a focus on North American market specifications\nYou are responsible for test execution and coordination along with lab and field tests\nYou possess a strong communication style and can share test contents and results to VW Group using advanced equipment and standardized systems for error reporting and prepare well-crafted project status reports\nEstablish and maintain an error reporting database, be aware of objective quality results and deliver to state of the art future infotainment products\nYou thrive at discovering errors and identifying bug-fix verification\nYou confidently ensure functionality of test setups (systems and vehicles) and can maintain and operate infotainment test-bench systems\nPrepare vehicles for test drives and participate in test drives in a variety of brands\nWe are looking for someone who can build-up, package, and integrate new prototypes into cars\n\nYou're offering these qualifications\n\nRole requirements:\n\nYou possesses automotive electronics knowledge and have 4-5 years of experience along with 3 or more years' experience as a Navigation Functions Tester with an OEM or Tier 1 supplier\nPossess prior experience with embedded and integrated automotive systems and has developed system-level thinking\nYou have strong knowledge of automotive Infotainment systems Strong ability to interpret technical specifications\nYou possess excellent verbal and written communication skills, social and interpersonal skills\nYou are a motivated team player, with positive attitude and strong work ethic\n\nEducation:\nBachelor’s Degree (BSCS preferred)",
        "tags":[],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=5b9c8fee498bb814"
    },
    "678918f5c47a9cc5":{
        "title":"Senior Software Engineer",
        "company":"eBay Inc.",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=678918f5c47a9cc5&atk=",
        "description":"About Stubhub\nOwned by eBay, StubHub’s mission is to connect people through inspiring event experiences. We connect fans with their favorite teams, shows and artists and introduce them to the ones they’ll love next. As the largest ticket marketplace in the world, we enable fans to buy and sell tickets to tens of thousands of events, whenever they want, through our desktop and mobile experiences, including our StubHub app for iPhone, iPad, Apple Watch and Android.\nOffering a delightful fan experience at its core, StubHub reinvented the ticket resale market in 2000 and continues to lead it through innovation. Our business partners include more than 130 properties in MLB, NBA, NHL, MLS and NCAA, plus AEG, AXS and Spectra Ticketing & Fan Engagement. In May of 2016, StubHub expanded into more than 40 additional markets with the acquisition of Ticketbis.\nStubHub’s vision encompasses four goals:\nBuilding a strong culture and talent magnet for diverse backgrounds\nBroadening our geographic footprint with #1 or #2 position in key markets\nBeing an indispensable industry partner bringing audiences together\nBeing everywhere our customers are and playing a larger role in their lives\nWe are looking for\nA Senior Software Engineering Developer for backend development, but not the regular kind.\nSomebody that has a really strong technical background with experience on the latest and greatest framework fads over the last few years.\nSomebody who has solid backend development skills. Someone who has experience to build scalable, reliable, and efficient application systems required to meet our rapidly increasing demand.\nSomeone who can work closely with PMO, UX, PM, and other functions to ensure that projects are delivering expectations\nSomebody who has a passion to own our own destiny by taking ideas from design to delivered products. Our team is DEVOPS team (we own the code from creation to production) and we work directly with our users to make our products better.\nSomebody who is willing to try new methodology. Someone that has moved fast & broken things, because they now understand the value of a customer's trust.\nSomebody who really cares customer’s business, their challenges and delivers value to our customers\nYou Bring\n5+ years hands-on experience dedicated to providing application solutions\nBS in Computer Science, Engineering, or related technical discipline or equivalent combination of training and experience\nExceptional verbal and written communication skills.\nSolid understanding of data structures and algorithm fundamentals\nSolid understanding of domain-driven design\nExtensive hands-on experience and expertise in object-oriented as well as functional design methodology using Java or other object-oriented language\nExperience building modern service applications on a framework like Spring Boot.\nSolid understanding of API's development using REST JSON/XML, security standards e.g., OAUTH and\nExperience developing queue-based services, especially services that use Kafka (preferred) or RabbitMQ\nExperience create build and deployment pipelines within a micro services architecture\nExperience of engineering practices such as code refactoring, design patterns, design-driven development, continuous integration, building highly scalable applications, application security\nAgile development methodologies experience, continuous integration, continuous delivery, and related techniques\nPassion for shipping high quality, clean, tested code with an aim to delight users.\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\nView our privacy policy\nView our accessibility info\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.\nFor more information see:\nEEO is the Law Poster\nEEO is the Law Poster Supplement",
        "tags":[
            "Java",
            "Scala",
            "Spring",
            "RDS",
            "Android"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=678918f5c47a9cc5"
    },
    "f43c510a2867a2a9":{
        "title":"Architect, Mobile",
        "company":"Sephora",
        "location":"San Francisco, CA 94105",
        "apply_url":"https://www.indeed.com/rc/clk?jk=f43c510a2867a2a9&atk=",
        "description":"Job ID: 166510\nLocation Name: CA-FSC SF Off (0174)\nAddress: 525 Market St, 32nd Floor, San Francisco, CA 94105, United States (US)\nJob Type: Full Time\nPosition Type (Regular/Temporary): Regular\nJob Function: Information Technology\nTechnology\nOur technology team works fast and smart. With San Francisco as our home, we take bringing new tech to market seriously, developing the latest in mobile technologies, scalable architecture, and the coolest in-store client experience. We love what we do and we have fun doing it. The Technology group is comprised of motivated self-starters and true team players that are absolutely integral to the growth of Sephora and our future success.\n\nYour role at Sephora:\nAs a Mobile Architect, you will be responsible for the solution and architecture of our native mobile apps. Reporting to the Director, Mobile Application Development, you will work closely with other engineering, design, and product management teams, to both deliver on the roadmap and our plan for the future. In addition, you will:\nOwn and evolve the native mobile technology architecture. Success in this area means making the right decisions that are both what’s best for the long-term health of our applications and what’s best for the customer.\nCollaborating with key leaders to create and execute the architectural plan.\nEvangelize the best practices and implement them.\nPartner closely with product, user experience, and upper management, translating the benefits of the team’s work into a language that is understood by all.\nDeliver the roadmap with the team as a lead individual contributor.\nDemonstrate our Sephora values of Passion for Client Service, Innovation, Expertise, Balance, Respect for All, Teamwork, and Initiative.\n\nWe’re excited about you if you have:\nAt least 8 years of software development experience\nPrior experience creating complex mobile applications as an Architect or Lead Engineer\nAt least 4 years of hands-on experience with native apps development; retail or ecommerce experience is a plus\nMust be an expert in iOS or Android, but preferably hands on experience with both platforms\nStrong programming skills in Objective-C/Swift or Java/Kotlin\nTrack record of shipping applications on App Store\nExperience developing and delivering using Agile methodologies\nExperience and a strong opinion about unit testing, CI/CD\nUnderstanding of software engineering principles, design patterns, object-oriented-programming (OOP), frameworks and technologies\nStrong communication skills (oral, verbal and listening) as well as the ability to influence the broader engineering team and understand their points of view\n\nYou’ll love working here because:\nThe people. You will be surrounded by some of the most talented, supportive, smart, and kind leaders and teams – people you can be proud to work with.\nThe product. Employees enjoy a product discount and receive free product (“gratis”) various times throughout the year. (Think your friends and family love you now? Just wait until you work at Sephora!)\nThe business. It feels good to win – and Sephora is a leader in the retail industry, defining experiential retail with a digital focus and creating the most loved beauty community in the world…with the awards and accolades to back it up.\nThe perks. Sephora offers comprehensive medical benefits, generous vacation/holiday time off, commuter benefits, and “Summer Fridays” (half-days every Friday between Memorial and Labor Day)…and so much more.\nThe LVMH family. Sephora’s parent company, LVMH, is one of the largest luxury groups in the world, providing support to over 70 brands such as Louis Vuitton, Celine, Marc Jacobs, and Dior.\n\nWorking at Sephora’s Field Support Center (FSC)\nOur North American operations are based in the heart of San Francisco’s Financial District, but you won’t hear us call it a headquarters – it’s the Field Support Center (FSC). At the FSC, we support our stores in providing the best possible experience for every client. Dedicated teams cater to our client’s every need by creating covetable assortments, curated content, compelling storytelling, smart strategy, skillful analysis, expert training, and more. It takes a lot of curious and confident individuals, disrupting the status quo and taking chances. The pace is fast, the fun is furious, and the passion is real. We never rest on our laurels. Our motto? If it’s not broken, fix it.\n\nSephora is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, ancestry, citizenship, gender, gender identity, sexual orientation, age, marital status, military/veteran status, or disability status. Sephora is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.\n\nSephora will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.\nCOMPANY OVERVIEW:\nSEPHORA has been changing the face of prestige cosmetics since its debut in 1970s Paris. Sephora was acquired by luxury group Moët Hennessy Louis Vuitton (LVMH) in 1997 then launched stateside in 1998, and is currently home to 200 world-class brands - including its own private label, SEPHORA COLLECTION. Sephora's curated assortment features more than 14,000 products including makeup, skin care, perfume, hair care, body, professional tools and more. Sephora is the beauty education hub, offering consultations at the Beauty Studio, a variety of complimentary classes, one-on-one service from Personal Beauty Advisors, and exclusive retail technology SKINCARE IQ, COLOR IQ, and FRAGRANCE IQ. Sephora is an international force in beauty, and its award-winning website and ever-growing presence on social-media make it the world's premier digital beauty destination.",
        "tags":[
            "Java",
            "Swift",
            "Objective-C",
            "Kotlin",
            "Scala",
            "RDS",
            "Android",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=f43c510a2867a2a9"
    },
    "155ee14982f461b2":{
        "title":"WordPress Developer",
        "company":"Eleven Systems",
        "location":"Mill Valley, CA 94941",
        "apply_url":"https://www.indeed.com/rc/clk?jk=155ee14982f461b2&atk=",
        "description":"ABOUT US:\nEleven Systems is a software development group owned by a private equity firm Grassy Creek, LLC based in London. Eleven Systems is responsible for developing software applications and websites for the various businesses owned in our private equity portfolio.\n\nAn example of one of our businesses is Eleven Experience. Eleven is a collection of high end properties around the world where guests are offered exceptional accommodations, fine dining and incredible experiences such as heliskiing, fly fishing, mountain biking and more. We are currently building an online booking engine for the website as well as integrated mobile apps for managing guest preferences and trip details.\n\nIn addition to our headquarters in London we have offices in Mill Valley, Sarasota, Durham, Crested Butte and Amsterdam. We are ideally looking for a web engineer to work out of our Mill Valley office but are open to working from home.\n\nJOB DESCRIPTION:\nWe are seeking a Web Designer responsible for both design and front-end development, including creating WordPress themes, plugins, and websites. This position requires a combination of programming skills (PHP, HTML5, CSS3, and JavaScript) and design sensibilities (understanding core design principles and industry best practices). Experience with responsive and adaptive design in a content management system is a must. Also, an understanding of the entire web development process, including planning, design, development, and deployment is preferred.\n\nRESPONSIBILITIES:\n\nDesigning and implementing new SaaS, hospitality, and entertainment websites\nEstablishing and guiding the website’s information architecture\nEnsure a consistent user experience across brand sites and products\nDeveloping and supporting custom themes to accomplish site goals\nCoordinate with backend engineers for deployments, testing, and fixes\n\nSKILLS AND QUALIFICATIONS:\n\n2+ years of experience designing and building WordPress sites\nSolid understanding of front-end technologies, including HTML5, CSS3, JavaScript, jQuery\nExperience developing and testing responsive and cross-browser friendly design websites\nComfortable working with debugging tools like Firebug, Chrome inspector, etc.\nAbility to design and convert comprehensive layout and wireframes into working HTML pages\nKnowledge of how to interact with RESTful APIs and formats (JSON, XML)\nFamiliar with Adobe Creative Cloud tools\nProficient understanding of code versioning tools, such as Git\nStrong understanding of PHP back-end development and best practices\n3 years experience preferred\n\nJob Type: Full-time\n\nJob Location: Mill Valley, CA",
        "tags":[
            "JavaScript",
            "HTML",
            "CSS",
            "Java",
            "PHP",
            "WordPress"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=155ee14982f461b2"
    },
    "579b1e62efac91fd":{
        "title":"Software Engineer",
        "company":"ReCharge Technologies Corporation",
        "location":"San Francisco, CA 94132",
        "apply_url":"https://www.indeed.com/rc/clk?jk=579b1e62efac91fd&atk=",
        "description":"Recharge is on a mission to revolutionize the way society interacts with their vehicles. We are building a platform that allows automakers and EV charging companies to implement discover, access, and pay directly into the dashboard of cars. We are a Bay Area/NYC start-up actively recruiting to expand our team.\n\nReCharge Technologies is looking for talented individuals to join us on the adventure of a lifetime. We value a commitment to leaving the world better than we found it and positively impacting society at billion person scale. Our collective experience and passion for progress improves our ability to achieve this goal.\n\nWe are looking for a Senior Software Engineer or Software Engineer that is ready to step into a Senior role. This individual will be leading the engineering team, hiring additional engineers, set product schedules, and launch new products. The perfect candidate will have a passion for the renewable energy space and/or transportation solutions. Prior experience with financial or automotive software is a plus.\n\nOpen locations include New York City and San Francisco Bay Area.\n\nAbout this role\n\n\nGuide new products from concept to deployment and scale after product launch. This includes driving new products, resolving issues, and making improvements in cost and efficiency.\nDesign, document, develop, and introduce engineering process.\nManage our partnership relationships.\n\nYou're offering these qualifications\n\n\n4+ years industry experience with at least two years as a software engineer supporting products or internal tools.\nBachelors degree in software engineering or equivalent work experience.\nProficient in Python and C++\nKnowledge of Android and/or iOS app development\nExperience with modern Javascript frameworks\nEmbedded linux experience a plus\n\nWe're offering these benefits\n\n\nSalary\nHealth insurance\nPhone reimbursement\nFree EV charging\nOffice location within walking distance of Caltrain in downtown San Carlos\n\n",
        "tags":[
            "JavaScript",
            "Java",
            "Python",
            "C++",
            "Linux",
            "Android",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=579b1e62efac91fd"
    },
    "bf0eab538464ea79":{
        "title":"Software Engineer III",
        "company":"Gap Inc.",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=bf0eab538464ea79&atk=",
        "description":"About the role\nAs a part of our technology organization, you will have the opportunity to build next generation solutions that will transform the way our customers interact with our family of iconic brands. Our team employs a DevOps model, allowing our product teams to have full ownership of design, build and operate with immense scale. From distributed computing, to artificial intelligence, mobile, big data and cloud computing, you will have the opportunity to build a career that allows you to make an impact all while learning new technical and leadership skills. We are inspired by new challenges and push ourselves to create what’s next in this dynamic industry.\n\nAs a Software Engineer in the Inventory Management group, you will be part of our Global Supply Chain Engineering function. You'll build technical products which will help in placing the right inventory at the right place, and at the right time. You'll also get to build a robust, scalable, and quality framework to help allocate products from Warehouse to Store.\n\nUnlock the Inventory Management business by building algorithm to identify the optimal stock units at a retail store\n\nHelp lead one or many allocation applications across the Allocation Product Group\n\nCollaborate to design, develop, test, deploy and support more than one allocation applications related to Inventory Management capabilities\n\nActively contribute in driving both technical and business capabilities with help of engineers from different locations\nWho you are\n5-8 years of experience in application development using Java / Spring\n\nExperienced with domain-driven designs and test-driven development (TDD)\n\nExperienced working with a modern tech stack, in a cloud environment, and with DevOps practices including CI/CD\n\nWorked in Agile environments; collaborated with Product Managers, Architects, Leads and Technical Managers across the organization and in different time zones\n\nBachelor's degree in Computer Science or related",
        "tags":[
            "Java",
            "Scala",
            "Spring"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=bf0eab538464ea79"
    },
    "40e1b7313aeb6c3b":{
        "title":"Software Development Engineer, Big Data",
        "company":"Zillow Group",
        "location":"San Francisco, CA 94102",
        "apply_url":"https://www.indeed.com/rc/clk?jk=40e1b7313aeb6c3b&atk=",
        "description":"About the team\nWe build the pipelines and processes responsible for daily ingestion of terabytes of data. We productionalize intelligent, data-driven systems to help Zillow capture strategic opportunities in the market. Our work enriches Zillow's unparalleled living database of all homes and hundreds of millions of customers and empowers teams downstream to build analytics tools and products to delight our users.\n\nSmall team = big impact. Engineering teams are highly decentralized in order to create the small team speed and autonomy of a start-up environment but backed by big company resources.Fast-moving, developer driven organization full of brilliant and ambitious people.\nAbout the role\nWe are looking for a strong technical contributor with a background in software development to create intelligent data driven systems and pipelines. As a Data Engineer, you will be responsible for all phases of the development cycle: design, implementation, testing, and release. You will leverage your deep knowledge and experience to provide technical leadership for the team, take ideas from zero to completion, and provide the bridge between raw data and actionable business insights. You will:\nBuild and maintain highly-scalable ETL pipelines and data-driven systems\nWork closely with business stake holders, data analysts and machine learning engineers to productionalize analytic solutions\nDesign and implement new data pipelines to support business analysts and data scientists\nDesign and build infrastructure to support our petabyte scale data lake\nWho you are\nData engineer with experience with building and shipping highly scalable distributed systems on cloud platforms (AWS/Azure/GCP) and database technologies (SQL/NoSQL/column-oriented datastores/distributed databases)\nExperience with the Big Data ecosystem (Hadoop/Hive/Spark/Presto/Airflow)\nProven track record of leading and delivering large projects independently\nProven ability to learn new technologies quickly\nA degree (BS/MS+) in Computer Science or a related technical discipline\nExperience with Python, Hive, Spark, Presto, Airflow\nGet to know us\nTrulia's mission is to build a more neighborly world by helping you discover a place you'll love to live. Homebuyers and renters use Trulia's website and suite of mobile apps to get a deeper understanding of homes and neighborhoods across the U.S. through personalized recommendations, insights sourced straight from locals, and 34 neighborhood map overlays that offer details on commute, reported crime, schools, nearby businesses, and more. Founded in 2005, Trulia is based in San Francisco, and owned and operated by Zillow Group, Inc. (NASDAQ: Z and ZG). Trulia is a registered trademark of Trulia, LLC.\nZillow Group is owned, fueled and grown by innovators who help people make better, smarter decisions around all things home. We encourage one another at every level, and our efforts are supported by employee-driven, world-class benefits that enable us to enjoy our lives outside the office while building fulfilling careers that impact millions of individuals every day.\nZillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.",
        "tags":[
            "Python",
            "Scala",
            "Spark",
            "Hadoop",
            "SQL",
            "AWS",
            "Mac",
            "Azure"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=40e1b7313aeb6c3b"
    },
    "b4e4af4b05ffe6c6":{
        "title":"Software Engineer : 19-02641",
        "company":"Akraya Inc.",
        "location":"Foster City, CA 94404",
        "apply_url":"https://www.indeed.com/rc/clk?jk=b4e4af4b05ffe6c6&atk=",
        "description":"Women Back to Work (WBW) candidates will also be considered for this position.\n\nAkraya is looking for a Software Engineer for one of our leading clients. To be considered, please apply or call Rahul at 408-512-2368.\n\nWe are an award-winning staffing firm that works with many leading technology-based companies around the world. The benefits offered to our employees include Health Insurance (Medical, Dental, and Vision), Cafeteria Plan (HSA, FSA, and dependent care), 401(k) (enrollment subject to eligibility), and Sick Pay (varies based on city and state laws). If this position is not quite what you’re looking for, visit akraya.com and submit a copy of your resume. We will get to work finding you a job that is a better match at one of our many amazing clients.\n\nPrimary Skills: Java, Talend, Oracle Database / DB2 database /GIT or SVN, UNIX, ETL. Extract, Transform & Load, JIRA\nDuration: 6+ Months\nContract Type: W2\n\nQualifications:\n3-5+ overall Software Engineer experience / 3 yrs+ of Talend experience / Minimum 1-3 years of Java experience.\nExpertise in UNIX / Knowledge in Oracle Database / DB2 database / Software configuration tools such as GITs SVN, defect tracking tools such as JIRA\nETL. Extract Transform & Load. Talend.\nDeveloper – will receive a technical design. Will be writing code/Job in Talend, writing unit test cases, preparing unit test data, executing the testing, and producing test results.\nBachelor's degree in Computer science or electrical engineering or any other related field\n3-7 years as a developer using Talend.\nExpertise in Java programming.\nExperience in financial services related experience or credit/debit card experience is preferred.\nReview and understand functional design and technical design.\nDevelop code using Talend, Java technology.\nPrepare unit test plan/cases, prepare unit test data and execute unit test cases & document the test results.\nFix defects found by QA test and conduct root cause analysis to prevent future occurrence.\n Please apply directly with your updated resume or call Rahul Shribas at 408-512-2368\n\nAbout Akraya\nAkraya, Inc. is an award-winning staffing firm that works with many of the leading, technology-based companies around the world. We have been ranked as one of the “Best Staffing Firms to Temp for” by Staffing Industry Analysts on multiple occasions and are a preferred staffing vendor within numerous staffing programs. Please visit akraya.com to search through all of our current openings or to submit your resume to our recruiting team.",
        "tags":[
            "Java",
            "Oracle",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=b4e4af4b05ffe6c6"
    },
    "32cd9a8c8f501f74":{
        "title":"Sr. Pre-Sales Solution Engineer - Bay Area",
        "company":"Teradata",
        "location":"San Francisco, CA 94102",
        "apply_url":"https://www.indeed.com/rc/clk?jk=32cd9a8c8f501f74&atk=",
        "description":"Requisition Number:\n204850\n\nPosition Title:\nSolutions Sr Engineer (II)\n\nExternal Description:\nSr. Senior Solution EngineerThe Sr. Solution Engineer (SE) leverages data architecture, data warehouse, and analytics and associated domain knowledge to promote sales of Teradata solutions. The Sr. SE has broad knowledge of the Big Data, data warehouse and analytic space, and experience with Teradata products and technologies. The Sr. SE articulates analytical ecosystem architectures and trends, and provides technical consulting, as a trusted advisor, to support sales activities. The Sr. SE establishes and enhances customer relationships ranging from DBA to CIO, and provides technical expertise on engagements and identifies new target opportunities within our accounts. Overall Job Purpose: Drive sales of Teradata software and servicesTechnical sales leader for Teradata Account TeamServes as trusted technical advisor to client and facilitator of additional Teradata SMEs and functionsIncrease use of Teradata software through positioning of new features, adding new applications and taking out competitive solutionsDemonstrates technical expertise and credibility with customers, from technical admin to CIOUnderstand and advise customers on data ecosystem architecturesPartners with Account Executive and extended account team on account planning and strategyWork with overall account team to identify and qualify sales opportunitiesAssist or operate the internal ordering process, from solution sizing to deployment Key Solution Engineer Responsibilities Advocate Teradata products and solutions to existing customers and prospects.Act as the “face” of Teradata to customers & prospects – able to quickly and easily articulate the value of Teradata software and services.Continuously drive and promote the value of Teradata solutions for customer business challenges – create value, articulate value, maintain value.Understand customer data and analytics challenges and help translate to business requirements in positioning Teradata software and services.Stay current with continuous education of Teradata’s latest software, platforms and cloud solutions.Craft creative solutions that leverage informed assumptions even when only partial information is known.Document client’s current analytical ecosystem, application architecture and data flow to/from Teradata and non-Teradata solutions.Understand and communicate customer-specific value of Teradata solutions and how they integrate with the customer’s analytical ecosystem as part of a future-state roadmap.Understand business value customers gain by use of analytics. Understand and align our software and service offerings to solve business problems.Manages relationships with client stakeholders as the key advisor on analytic architecture and by partnering with the customer’s architecture experts (ecosystem & domain architects).Creates client interest in Teradata solutions, advancing the sales processSyncs daily with account team lead to discuss account strategy and future sales opportunitiesComprehension of rapidly evolving open source and competitive technologies and how they compare/contrast or compliment Teradata offerings.Partner with Consulting, Customer Services, Global Sales Support, Pricing, Finance and sales to formulate offers and proposals.Facilitate and/or lead demonstration of Teradata Cloud and Analytics capabilities.Occasionally, take advisory and leadership role in strategic Consulting engagements in partnership with Consulting Our total compensation approach includes a competitive base salary, 401(k), strong work/family programs, and medical, dental and disability coverage. Teradata is an Equal Opportunity/Affirmative Action Employer and commits to hiring returning veterans.\n\nCountryEEOText_Description:\nTeradata invites all identities and backgrounds in the workplace. We work with deliberation and intent to ensure we are cultivating collaboration and inclusivity across our global organization.\n​\nWe are proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, color, ancestry, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related conditions), national origin, sexual orientation, age, citizenship, marital status, disability, medical condition, genetic information, gender identity or expression, military and veteran status, or any other legally protected status.\n\nCity:\nSan Francisco\n\nState:\nCalifornia\n\nCommunity / Marketing Title:\nSr. Pre-Sales Solution Engineer - Bay Area\n\nJob Category:\nSales\n\nCompany Profile:\nWith all the investments made in analytics, it’s time to stop buying into partial solutions that overpromise and underdeliver. It’s time to invest in answers. Only Teradata leverages all of the data, all of the time, so that customers can analyze anything, deploy anywhere, and deliver analytics that matter most to them. And we do it at scale, on-premises, in the Cloud, or anywhere in between. We call this Pervasive Data Intelligence. It’s the answer to the complexity, cost, and inadequacy of today’s analytics. And it's the way Teradata transforms how businesses work and people live through the power of data throughout the world. Join us and help create the era of Pervasive Data Intelligence.\n\nLocation_formattedLocationLong:\nSan Francisco, California US",
        "tags":[],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=32cd9a8c8f501f74"
    },
    "d094fcc9bc3796fa":{
        "title":"Analytics Manager",
        "company":"DESINTERIORS",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=d094fcc9bc3796fa&atk=",
        "description":"We are looking for an Analytics Manager to organize our analytics function and manage our team of analysts. You will implement tools and strategies to translate raw data into valuable business insights.\n\n In this role, we expect you to have strong logical reasoning skills and business intelligence. The ability to communicate effectively is essential. If you also have solid industry experience, we’d like to meet you.\n\nYour goal will be to help our business to drive high performance and quality.\n\nResponsibilities:\n\n Understand business needs and objectives.\nDevelop strategies for effective data analysis and reporting.\nDefine company-wide metrics and relevant data sources.\nOversee all analytics operations to correct discrepancies and ensure quality.\nExtract reports from multiple sources (e.g. operations, IT, customer feedback).\nBuild systems to transform raw data into actionable business insights.\n Apply industry knowledge to interpret data and improve performance.\nKeep abreast of industry news and trends.\n\n\nRequirements:\n\nProven experience as an Analytics Manager or Data Entry.\nSolid experience in data analysis and reporting; industry experience is a plus.\nBackground in market research and project management.\nKnowledge of Excel, R and SQL; familiarity with business intelligence tools (e.g. Tableau, SAS).\nSuperb communication skills.\nStrong organizational abilities.\nAttention to detail.\nProblem-solving aptitude.\nBSc/BA in Computer Science, Statistics, Data Management or a related field.",
        "tags":[
            "SQL"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=d094fcc9bc3796fa"
    },
    "728e25b176f8866a":{
        "title":"Optimization Engineer",
        "company":"8minute Solar Energy",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=728e25b176f8866a&atk=",
        "description":"Founded in 2009, 8minutenergy Renewables is the nation's largest independent developer of solar PV + Storage projects. 8minutenergy has an unmatched ability to produce affordable clean energy and to deliver strong financial returns on utility-scale solar projects. We are seeking the best and brightest people to help build solar energy across the globe.\n\nThis is seen as an immediate, critical role to deliver on our current mid to late stage projects, and to support full pipeline. Ideal candidate would support production and design optimization throughout the full development process. As well as work within the PV, BESS and software teams to optimize bids and work with the contracting team to select our final vendors for PV and storage.\n\nScope and Deliverables of this role:\n\nProspecting/Siting\nProduction assessments for early stage prospecting efforts\nHelp assess early stage design trade-offs for site specific and regional guidance(considering factors such as DC/AC loading, GCR, equipment, land cost, expected COD year, etc)\nPPA bid/Competitiveness\nIdentify and model site specific conditions such as meteorological data, soiling,shading and other onsite conditions that may impact design and production\nP50, P90, P99 and hedge type production assessments\nLead cross functional design optimization efforts targeted at lowest LCOE\nReview technical requirements of PPA to guide negotiation and project risks\nIdentify production and design levers to quantify risk and opportunities on project development and profitability\nWork cross functionally between development, land, engineering, estimating teams\nProject Optimization Efforts\nDiligence new technology with suppliers, EPC and IEs to understand bankability, performance and design impacts\nWork on LCOE initiatives around design configuration, land utilization,\nHelp assess PV+S optimization that meets offtaker\nEPC RFP and Value Engineering\nReview EPC design and normalize production as needed\nGuide and collaborate with contractor to find site and EPC specific optimized design\nOwn technical exhibits such as capacity testing and technical commissioning (with support of OEs)\nTechnical Diligence through project financing\nTechnical lead though IE diligence and project financing\nLead production review and answer questions on design, equipment and production to maximize project evaluation\nLead technical interface to utilities, responsible for:\nOperate third party and 8minutenergy proprietary software tools to optimize responses to utility customer Requests For Proposal (RFP's)\nOperate PVSyst and/or NREL SAM to simulate PV production\nOperate 8minutenergy PV+S simulation software from design user GUI\nDocument bid assumptions for Independent Engineer review\nWork with independent consultants on merchant market revenue assumptions and as needed operate third party merchant market simulation software to refresh revenue assumptions\n\nDesirable skill sets:\n\nCommercially minded engineer focused on LCOE\nAbility to quantify risk and opportunities around unknowns in design and technology\nPVsyst and/or NREL SAM to simulate PV production and modelling\nUnderstanding of the full solar development process\nThrive in cross functional environment, able to guide discussion and identify dependencies between design, production, cost, land use, LCOE\nTechnical background in modules, inverters and/or battery technology a plus\nPython coding not required but a plus\nUnderstands utility scale solar PV and storage systems and how design tradeoffs impact system price and performance\nBackground in optimizing combined PV + storage system design for time of day revenue multipliers\nSome understanding of how battery systems operate in merchant markets and revenue streams battery systems could earn in merchant markets\nExperienced in utility scale battery contracting from buyer or seller perspective\nExperienced documenting plant design for Independent Engineers\nExperienced with battery degrade calculations and contractual guarantees terms\nExperienced with solar PV performance and guarantee terms\n2+ years, in designing and/or operating Battery Energy Storage Systems (BESS)\n5+ years experience in utility energy systems\nBackground in utility operations including dispatch of generators and battery storage controls\nBasic software programming skills, especially Python and Excel Macros\nExcellent verbal and written communication skills\nAbility to travel up to 25% of the time\nBachelor of Science in STEM, preferably in electrical or mechanical engineering\nPreferably graduate degree in STEM or economics\n\n8minutenergy Renewables offers competitive compensation and an excellent benefit package, including 401(k) and fully paid medical and dental benefits and unlimited PTO. We are an equal opportunity employer.",
        "tags":[
            "Python",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=728e25b176f8866a"
    },
    "e82961d788ba0248":{
        "title":"Information Security Risk Senior Manager",
        "company":"Gap Inc.",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e82961d788ba0248&atk=",
        "description":"About the role\nGapTech Information Security (InfoSec) is the global cybersecurity division of Gap Inc. inclusive of, and across, all our brands. As the Information Security Risk Manager, you will be responsible for leading, articulating and tracking actions related to developing and driving the implementation of security risk management plans, ensuring effective risk management practices, and engaging with internal and external business partners on information security matters to achieve overall business objectives.\nWe are looking for a detail-oriented Manager with strong collaboration and influencing skills to evaluate security risks and compliance obligations, recommend mitigation strategies to protect the confidentiality, integrity and availability of Gap Inc.’s information systems and data, and monitor risks to remediation. This role is critical in helping business partners and technical teams understand the risks inherent in their activities, impact of their risk-taking actions on the company, and opportunities to reduce or avoid risks altogether.\nWhat you'll do\nDefine and implement Information Security Risk Management Framework based on industry\ncybersecurity frameworks & standards, such as NIST, COBIT, CIS Critical Security Controls, ISO 27001, to quantitively assess and manage security risks at Gap Inc.\nEnhance and manage InfoSec risk management processes; including risk identification, assessment, monitoring, remediation, and acceptance\nCollaborate with teams within and outside of Information Security to assess, monitor, and reduce security risk across Gap Inc.’s environment\nPartner with IT Compliance to ensure internal and external business partners are in compliance with security standards and regulations such as PCI DSS, GDPR, ISO 27001/27002, NIST, CIS, etc.\nManage collection and reporting of relevant Information Security risk metrics to leadership\nPerform vendor risk reviews of third party products and services used by Gap Inc.\nCollaborate with Legal, Privacy, and Sourcing teams to assess third party / vendor risks\nWho you are\nBachelor’s degree in Computer Science, Information Technology or a related technical discipline\n5+ years of relevant business experience in Information Security, Risk Management and Compliance\nStrong understanding of information security laws, regulations and standards (e.g. NIST, ISO 27001/27002, PCI DSS, GDPR, SSAE 16, CIS Critical Security Controls, COBIT, COSO) and accepted information security principles and best practices\nExperience working in a risk-based environment including risk identification, measurement, mitigation, monitoring, and reporting\nExperience in third party risk management / vendor management\nOperational flexibility in modifying business and operating practices to adapt to a changing environment\nExcellent communication and influencing skills including the ability to simplify key messages, present compelling stories and promote technical and personal credibility with internal and external executives, and both technical and non-technical audiences\nPreferred Certifications - CISSP, CISA, CISM",
        "tags":[
            "RDS",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e82961d788ba0248"
    },
    "22d33d84a7493da7":{
        "title":"Strategic Sales Account Executive",
        "company":"WalkMe",
        "location":"San Francisco, CA 94105",
        "apply_url":"https://www.indeed.com/rc/clk?jk=22d33d84a7493da7&atk=",
        "description":"Strategic Sales Account Executive\nAccount Executive - Strategic - San Francisco, NA\nWalkMe pioneered the Digital Adoption Platform (DAP) to transform the user experience in today’s overwhelming digital world. Using analytics, engagement, guidance, and automation, WalkMe’s transparent overlay assists users to complete tasks easily within any enterprise software, mobile application or website.\nAs we continue to rapidly expand, we are seeking an experienced and driven Sales Account Executive to manage all aspects of the sale’s cycle, ensuring WalkMe’s continued growth and success. You will report to the Senior Director of NA Sales in our San Francisco office.\nAbout the Role\nManage and responds to incoming lead requests.\nManage sales activity including monthly and quarterly forecasting of revenue in SalesForce.com.\nDrive entire sales process from introduction to close over the phone.\nInterface with all levels of the target organizations, including senior executives at Enterprise accounts.\nMaintain weekly sales forecast and achieve quota quarterly.\nIdentify and close new sales opportunities within targeted accounts as well existing customers.\nPresent WalkMe solutions using value based sales approaches and techniques working closing with Pre Sales Engineers.\nExecution of sales activities with internal\nWhat You'll Own OR What You'll Do\nIn first 30 days, complete onboarding training and gain a proficient working knowledge of WalkMe’s product, value proposition, use cases, competitive differentiation, and sales process.\nWithin the first 60 days, starting managing cycles from inbound leads being assigned by round-robin call distribution, develop and begin execution.\nWithin the first quarter, be in a position to start closing initial cycles.\nWithin the first 6 months, build a potential opportunity pipeline that is 2x the annual quota\nExceed annual sales quota in first 12 months.\nWhat You Need to Succeed\nTrack record of consistent earnings over-achievement in past Sales Executive roles (top 10-20% of company), advancement and increased responsibility in past positions.\nExperience with selling new business and also expansions (up-sales/cross-sell). Enterprise expansion experience is a major plus.\n6+ years of closing experience\n2+ years experience in the expansions of strategic accounts.\nMinimum 3 years of solution selling using an inside sales approach, high-volume transactions over the phone\nExperience using WalkMe a major plus!\nWhat You Will Love About Us!\nFull health coverage for employees, WalkMe pays 100% of employee premiums and 50% of family premiums and has a generous vacation policy to encourage a healthy work-life balance.﻿﻿\nWeekly themed happy hours every Friday and catered lunch to promote community within a casual office environment.\nWalkMe Raises 40 million in Series F funding.\nRanked in the top 50 on USA Today’s best places to work with brightest futures and Ranked in the top 50 on Forbes Cloud 100 list along with other numerous accolades, just check out our webpage!\nOur product is used internationally by companies like Hulu, Amazon, PayPal, Microsoft, Airbnb, Zoura, Adobe and more!\nWalkMe is proud to be an Equal Employment Opportunity Employer. WalkMe does not discriminate on the basis of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other protected characteristic.\n\nTO ALL RECRUITMENT AGENCIES:\nWalkMe does not accept agency resumes. Please do not forward resumes to WalkMe employees or any other company location. WalkMe is not responsible for any fees related to unsolicited resumes and will not pay fees to any third-party agency or company that does not have a signed agreement with the Company for this specific role.",
        "tags":[],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=22d33d84a7493da7"
    },
    "c56d49320e6bf132":{
        "title":"Energy and Construction Engineer",
        "company":"Edison Energy",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=c56d49320e6bf132&atk=",
        "description":"Company Overview:\n\nEdison Energy is a business created to meet the needs of the new energy future, while drawing on more than 130 years of energy and utility experience as part of Edison International.\n\nWe create a competitive advantage for market leaders by quantifying energy risk and designing the portfolio solution to protect shareholder value threatened by complex energy policies, technological advancements, and new products.\n\nEdison Energy is part of Edison International (NYSE:EIX), one of the nation’s leading energy suppliers with revenues in excess of $11B and more than 12,000 employees. Through its subsidiaries, it generates and distributes electric power and provides products to meet the needs of an ever-changing energy marketplace.\nPosition Overview:\nThe applicant will be responsible for the following tasks and activities:\nEnergy Engineer Activities to include the following tasks:\nPerform energy audits, retro-commissioning, and new construction commissioning of various facilities including higher education, commercial, healthcare, industrial, and municipalities\nIdentify energy conservation projects that include both capital and operational measures\nPerform energy use benchmarks (Energy Star)\nDevelop and execute performance testing plans for HVAC equipment\nTroubleshoot faulty systems and provide recommendations for corrective actions\nPerform calculations of energy savings\nPerform energy models using eQuest or other software\nPrepare project implementation cost estimates\nReview engineering designs\nReview shop drawings, operation & maintenance manuals, and other construction documentation\nReview and manage project submittals.\nTechnical development of specifications.\nManage the Change Order Process.\nPerform price estimates for projects and associated change orders\nPrepare technical reports and presentations, and presents to clients and senior leaders\nAttend jobsite meetings and field surveys as required\nJob Requirements:\nTypically has 1-10 years of experience in the energy field and/or 1-10 years in the construction field.\nAbility to travel 100% of the time with relocation to various project sites for months at a time.\nFamiliarity with the Energy Industry and Energy Project Work\nExperience in performing energy load profile analysis and the use of energy benchmarking and simulation tools\nWorking knowledge of HVAC systems (steam, air and water distribution systems, etc.)\nField experience with HVAC systems - boiler, chillers, air-handlers, etc. – is desirable.\nExperience in estimating HVAC and other energy projects\nExperience in financial analysis of various energy projects\nEnergy project experience: screening, development and implementation\nA willingness to learn and work in a team environment with extensive contact with clients\nStrong communication skills\nAbility to work autonomously and independent with little oversight\nBasic computer skills (Word, Excel, Outlook, Power Point) and a valid driver’s license are required\nMust be physically able and willing to conduct site inspections and field work (climb ladders, walk on roofs, etc.)\nEducation Requirements:\nBS in engineering or relevant technical discipline or an equivalent combination of education, training, and experience.Opens a New Window.\nPreferred Requirements:\nPE, EIT/FE, LEED AP, CEM and other technical certifications",
        "tags":[],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=c56d49320e6bf132"
    },
    "b88bc7c575d44880":{
        "title":"Business Development Lead - AWS Marketplace",
        "company":"Amazon.com Services, Inc.",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=b88bc7c575d44880&atk=",
        "description":"Basic Qualifications:\n3+ years of technology sales, business development or sales engineering/consulting experience.BA/BS degree\n\nHave you ever thought about shifting the paradigm for how customers find, buy, and use IT software? Would you like to focus on increasing adoption and revenue of Amazon Web Services (AWS)? Amazon’s technology business (AWS) has a history and tradition of leading the world in web-related technologies and services. Now, with AWS you have the chance to help businesses take their computing applications into the Cloud. AWS has created a software catalog delivering application services - AWS Marketplace (http://aws.amazon.com/marketplace) – where customers can find, buy, and immediately start using software in a utility model that runs on AWS. Our job is to bring Amazon's e-commerce expertise to cloud software and fundamentally change how software is discovered, deployed and consumed on AWS.\nAs the Business Development Manager for AWS Marketplace (BDM), you will help drive the growth and adoption of AWS Marketplace with SMB customers. The ideal candidate possesses a sales and business development background to drive revenue growth to revenue goals for software purchased via AWS Marketplace. We are looking for candidates with an entrepreneurial spirit to establish AWS Marketplace as a key platform for software procurement and distribution. You should be self-motivated, customer-centric, and very delivery-focused with a track record of exceeding revenue goals. If you are someone who thrives in an environment where you are faced with new things every day and have the latitude to figure it out and run with it then we would like to hear from you.\n\nThe BDM will drive the adoption of AWS Marketplace with customers by working with the ISV sellers on marketplace and collaborating with AWS Account teams to ensure products and solutions land at our customers. Primary BDM responsibilities include driving the Procurement and IT relationships around the MP programs and platform. The technical solutions include security, networking, devops, database, storage, business intelligence, ML, IoT owning the day-to-day interactions with existing SMB customers to identify needs met through AWS Marketplace. BDM will align with the MP extended teams to build scale for our field facing programs. The BDM will be part of a team that serves as trusted advisor to the area sales leadership and liaison to various internal teams.\n\nThe ideal candidate will possess the knowledge of software procurement process and have the technical depth to easily communicate the benefits of deploying AWS Marketplace products to CIO, CPO, VP Infrastructure, IT architects and engineering teams across the application layers of security, networking, dev/ops, database, storage, business intelligence and media. The candidate will have a demonstrated ability to think strategically and long-term about the needs of complex global businesses and be deeply familiar with complex legacy IT environments, enterprise applications, and market analysis.\n\nRoles & Responsibilities:\n\nDriving outcomes for customers through the adoption of the MP ServiceBusiness Development Manager (individual contributor) that works with AWS Sales and Solution Architects to meet or exceed assigned AWS Marketplace revenue goalsLiaison from MP for the AWS Field sales team they are aligned to as well as the extended MP team for field and ISV facing programs that align to Americas.Software selling background, familiarity with AWS ISV partner ecosystemExhibits proactive ability, very astute in setting customer discussions via AWS sales, Professional Services, SA, MP Channel, MP ISV, and Partner teamsComfortable managing the sales adoption cycle of an opportunity and will partner with various teams to develop, propose and close new business through AWS MarketplaceEngages in senior level customer meetings to discuss customer’s business issues and explores how the Marketplace features and programs can help address and resolve these issuesEstablish ways to measure and track metrics related to adoption of AWS Marketplace products, and to make improvements to the approach based on those measurementsPrepare and give business reviews to the senior management team regarding progress and metrics for the areaEducate and enable the sales teams and increase visibility of AWS Marketplace products across all relevant AWS teamsHandle a high volume of engagements and the fast pace of the cloud computing market. Travel up to 40% within assigned geography to meet with customers, prospects, partners, account teams.\n\nPREFERRED QUALIFICATIONS\nExperience within technology ISV ecosystemA technical background in engineering, computer science, or MIS a plusBusiness development experience with quota, strategic analysis, or program/product management experienceSolid negotiation skills, and business and financial acumenStrong analytical skills, and demonstrated ability to turn detailed data analysis into useful strategic insight to drive customer adoption and make appropriate recommendations to the business\nExperience with, and detailed knowledge of the Partner Channel ecosystem and insights related to cloud computing and ITDemonstrated ability to work effectively across internal and external organizations is keyAmazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation/AgePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
        "tags":[
            "RDS",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=b88bc7c575d44880"
    },
    "74500602beb15a31":{
        "title":"Senior Network Engineer",
        "company":"Aperio Group",
        "location":"Sausalito, CA 94965",
        "apply_url":"https://www.indeed.com/rc/clk?jk=74500602beb15a31&atk=",
        "description":"About the Firm\n\nAt Aperio Group, our strategies are designed to put our clients’ and their clients’ interests at the center of our investment advice; to minimize costs and taxes; and to incorporate each client’s unique environmental, social, and governance (ESG) preferences. We are a purposefully growing quantitative/index-tracking investment management firm specializing in managing customized equity portfolios tax efficiently.\n\nWe recognize that our competitive advantage starts with our people and our culture. At Aperio, we work hard and move quickly as a well-coordinated, collaborative team. Our exceptional people are focused on providing extraordinary client service. We seek to build a workforce that is as diverse in experience, perspective, and culture as the clients we aspire to work with. Aperio is looking to add amazing people to our team who will bring diversity across many lines, including race, ethnicity, religion, sexual orientation, age, marital/family status, disability, gender identity, sex, and country of origin.\n\nOur headquarters are in Sausalito, California, only one block from the beautiful harbor. It’s a short, 20-minute drive from much of San Francisco (opposite the normal commute), and many of our team members are spread throughout San Francisco, the North Bay, and East Bay.\n\nIf you are looking for an opportunity to grow and contribute in a fun, industry-disruptive, fast-paced environment, Aperio is the place for you.\n\nAPERIO GROUP, LLC IS COMMITTED TO ATTRACTING, RETAINING, ENGAGING, AND DEVELOPING A POOL OF TALENT THAT IS DIVERSE ALONG MANY DIMENSIONS. WE SEEK TO LEVERAGE THESE DIVERSE EXPERIENCES, BACKGROUNDS, AND VIEWPOINTS TO BEST SERVE THE NEEDS OF OUR CLIENTS.\n\nPosition Description\n\nAperio Group seeks a Senior Network Engineer to join our IT operations team to help design, enhance, and maintain our existing environments, both on premises and in the cloud. This role provides expertise in network engineering, administration, and operations.\nWe strongly encourage candidates to include a cover letter with the application.\n\nDuties and Responsibilities\n\nLead the engineering of our current and newly developing networks\nLead projects, and at times project teams to deliver innovative solutions\nTroubleshoot complex problems and develop solutions\nWork closely with our software developers to help automate deployments and operations\nDevelop automated methods to remediate and mitigate network events and minimize network operational complexity\nDrive operational excellence to improve network performance and reliability\nEstablish Zero Trust network vision and lead all aspects of design, implementation, and support\nDefine and influence strategies within the team\nOther duties as assigned\nMinimum Requirements\n\nTechnical Skills:\n\nExperience with Cisco Adaptive Security Appliances\nExpert-level knowledge of Cisco routers, switches, multiprotocol routing concepts, VPNs, IP/ARP/MAC\nExperience troubleshooting VLANs\nExperience with Cisco access-list, NAT, and DNS\nExperience with VMware\nExperience with AWS and Terraform (Infrastructure-as-Code)\nExperience with Windows and Linux server management\nExperience with SSL certificate management\nExperience with information security\nExperience with DFSR\nExperience developing network automation tools\nSome experience working in a Help Desk environment\nEducation:\n\nBachelor’s degree in Networking, Computer Science, Engineering, or related technical discipline, or minimum of 10 years’ relevant experience\n\nFinally, the ideal candidate must have a sense of humor; patience; scrappiness; a desire to maintain your own and support others’ work-life balance; the ability to take and give constructive criticism with humility, introspection, and respect; an understanding of what it takes to enjoy working effectively in a small company … and did we mention a sense of humor for your sanity and ours?",
        "tags":[
            "Linux",
            "AWS",
            "Mac",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=74500602beb15a31"
    },
    "2774e5da9d900b85":{
        "title":"Senior Product Manager, Brand",
        "company":"Reddit",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=2774e5da9d900b85&atk=",
        "description":"\"The front page of the internet,\" Reddit brings over 330 million people together each month through their common interests, inviting them to share, vote, comment, and create across thousands of communities. Come for the cats, stay for the empathy.\n\nYou'll conceptualize and build new products that help Brands grow their presence on Reddit, in harmony with the user experience. This includes products related to the Brands' organic and sponsored engagement on Reddit.\n\nThis role will be part of the Reddit Ads team, which is doubling in size in 2019. You will own the charter to make Brands a fundamental part of Reddit, including making them successful at reaching the right audience using our Ads platform.\n\nResponsibilities\n\n\nCollaborating closely with Engineering and Design to architect and ship new products and features\nPartner with leadership team to create processes and project plans that enable the team to efficiently deliver a high-quality product on time and under budget\nInterface with other technical departments to collectively strategize, as well as route and schedule required work to appropriate parties\n\nQualifications\n\n\n3+ years experience as a Product Manager, preferably including Ads or Consumer product experience\nYou have exceptional independent problem-solving skills, attention to detail, flexibility, and ability to collaborate with others and to work in a fast-paced environment\nYou are a compelling influencer with great communication and interpersonal skills, with the ability to align a diverse group of stakeholders towards a common goal\nYou're strongly data-informed but also understand how changes will qualitatively affect user experience. SQL knowledge is strongly preferred\nYou have a Bachelor's degree or higher in Computer Science or a related field, or equivalent technical expertise\n\n",
        "tags":[
            "SQL",
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=2774e5da9d900b85"
    },
    "e5fb3a6945b0b768":{
        "title":"Senior Threat Analyst",
        "company":"Pacific Gas And Electric Company",
        "location":"Concord, CA 94518",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e5fb3a6945b0b768&atk=",
        "description":"Requisition ID # 3509\nJob Category : Information Technology\nJob Level : Individual Contributor\nBusiness Unit: Information Technology and Supply Chain\nJob Location : Concord\nCompany\n\nBased in San Francisco, Pacific Gas and Electric Company, a subsidiary of PG&E Corporation (NYSE:PCG), is one of the largest combined natural gas and electric utilities in the United States.And we deliver some of the nation's cleanest energy to our customers in Northern and Central California. For PG&E, Together, Building a Better California is not just a slogan.Its the very core of our mission and the scale by which we measure our success. We know that the nearly 16 million people who do business with our company count on our more than 24,000 employees for far more than the delivery of utility services.They, along with every citizen of the state we call home, also expect PG&E to help improve their quality of life, the economic vitality of their communities, and the prospect for a better future fueled by clean, safe, reliable and affordable energy.\n\nPacific Gas and Electric Company is an Affirmative Action and Equal Employment Opportunity employer that actively pursues and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color,national origin, ancestry, sex, age, religion, physical or mental disability status, medical condition, protected veteran status, marital status, pregnancy, sexual orientation, gender, gender identity, gender expression, genetic informationor any other factor that is not related to the job.\nDepartment Overview\nThe Cybersecurity function is led by PG&E’s Vice President - Chief Security Officer and is responsible for cybersecurity and risk management across the organization.\n\nThe Security Intelligence and Operations Center (SIOC) is responsible for ensuring that PG&E proactively identifies and assesses threats to its user and operational network and data, monitors its network for malicious activity, investigates intrusions and other relevant events, and has a sophisticated and detailed understanding of the evolving threat landscape.\n\nThe SIOC is a 24/7 operation. Shift flexiblity is a must. Current vacancy is as follows:\n\nDays Worked: Monday – Friday\nHours Worked: Swing 2:00PM-10:30PM\n\nPosition Summary\nCurrently located in Concord, CA, this position is in our Security Intelligence and Operations Center and is responsible for monitoring, detecting, and responding to cybersecurity activity across PG&E’s telecommunication and data computing infrastructure.\n\nResponse could include but is not limited to: troubleshooting, analysis, diagnosis, communicating with stakeholders, and resolution or coordination of resolution via support groups or business units. This position is on one of three shifts and requires the ability to think analytically, work collaboratively, and document all work being performed.\n\nQualifications\nMinimum:\nBachelor's degree in Computer Science or related field, or equivalent work experience\n4 years of relevant work experience within security information technology\nFormal IT Security/Network Certifications such as: CompTIA, SANS GIAC, ISC², CCNA\n\nDesired:\nUtility Industry experience\nPrior SIEM experience – Security Information & Event Management system, log aggregation and event notification tool such as IBM QRadar\nAbility to reverse engineer malware\nFamiliarity with regulatory requirements such as NERC/CIP, NIST, SOX etc.\nExtensive experience in industry well known as well as open source Network and/ or Host forensic tools\n\nKnowledge, Skills, and Abilities:\nExtensive experience in network security monitoring, network packet analysis and / or host and server forensics\nStrong networking knowledge – TCP/IP protocols, OSI model, Firewalls and other networking devices\nExperience in packet analysis and malware analysis\nStrong customer service skills and decision-making skills\nGood analytical skills – ability to analyze and think out of the box when working a security event\nFamiliarity with scripting languages such as Python, Perl, PowerShell\nSelf-motivated, methodical and detail oriented\n\nResponsibilities\nMonitor incoming event queues for potential security incidents; identify and act on anomalous network activity\nPerform proficient forensic analysis using security tools and monitoring systems to discover the source of anomalous security events.\nPerform hunting for malicious activity across the network and digital assets\nPerform detailed investigation and response activities for potential security incidents\nAnalyze complex malware analysis through endpoint and network traffic forensics to determine if PG&E systems are impacted.\nDevelop innovative monitoring and detection solutions using PG&E tools and other skillsets such as scripting\nWork with Security engineering team to analyze SIEM use cases\nRecommend implementation of counter-measures or mitigating controls\nEnsures all pertinent information is obtained to allow for the identification, containment, eradication, and recovery actions to occur in a time sensitive environment\nCollaborates with technical and threat intelligence analysts to provide indications and warnings, and contributes to predictive analysis of malicious activity\nMentor junior staff in cybersecurity techniques and processes\nCreate and continuously improve standard operating procedures used by the SIOC\nMonitor external event sources for security intelligence and actionable incidents\nMust comply with any regulatory requirements",
        "tags":[
            "Python",
            "Perl"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e5fb3a6945b0b768"
    },
    "2d63568ee2c54eb6":{
        "title":"Senior AWS Solutions Architect",
        "company":"Amazon Web Services, Inc.",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=2d63568ee2c54eb6&atk=",
        "description":"5+ years design/implementation/consulting experience with distributed applications3+ years of experience in application, infrastructure, database, and networking architecture2+ years relevant experience in technology/software sales or pre-sales consultingTechnical degree required; Computer Science or Math background desired\n\nAmazon Web Services (AWS) is looking for a Solutions Architect in San Francisco Bay Area who is passionate about helping our customers build infrastructures and applications at scale. Our solutions architects are experienced technologists with technical breadth and depth coupled with strong interpersonal skills. As a solutions architect, you will work directly with some of our largest and fastest growing customers to enable innovation through continuous deployment of cloud native technology stacks and advanced cloud solutions.\n\nOur solutions architects build architectures and provide prescriptive guidance across application architecture, networking, storage, operating systems, virtualization, RDBMS & NoSQL databases, and Big data. The ideal candidate will have a strong understanding of large scale distributed computing solutions, and experience leading deep architecture discussions, and hands on experience. You will partner with Sales, Professional Services, and other AWS teams to craft highly scalable, flexible and resilient cloud architectures that address customer business problems and accelerate the adoption of our services.\n\nRoles and Responsibilities\nEnsure customer success in designing, building and migrating applications, software, and services on the AWS platformLead deep architectural discussions and design exercises to create world-class solutions built on AWS while ensuring solutions are designed for successful deployment in the cloudBe an AWS evangelist. Educate customers of all sizes on the value proposition of AWS.Author or otherwise contribute to AWS customer-facing publications such as whitepapers, blogs, and proof of conceptsIn partnership with the sales team, formulate, and execute a sales strategy to exceed revenue objectives through the adoption of AWSBuild deep relationships with senior technical individuals within customers to enable them to be cloud advocatesCapture and share best-practice knowledge amongst the AWS solutions architect community\n\nHands on working knowledge of software development tools and methodologiesExperience architecting/operating solutions build on AWSCommunication and presentation skills with a high degree of comfort speaking with executives, IT Management, and developersDemonstrated ability to adapt to new technologies and learn quicklyExperience migrating or transforming legacy customer solutions to the cloudWillingness to travel up to 15%\nAmazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nAmazon Web Services is hiring. For more information: http://www.amazon.jobs\n\naws-solarch-na",
        "tags":[
            "Scala",
            "SQL",
            "RDS",
            "AWS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=2d63568ee2c54eb6"
    },
    "1a2c81fd25299d2a":{
        "title":"Software Engineer, Packer",
        "company":"HashiCorp",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=1a2c81fd25299d2a&atk=",
        "description":"HashiCorp ( https://www.hashicorp.com/ ) builds DevOps tools for modern applications. We build open source tools, and enterprise products on top of them. The HashiCorp suite empowers organizations to provision hybrid cloud infrastructure, secure secrets across distributed applications, and run dynamic resources.\n\nAt HashiCorp, we value top-notch collaboration and communication skills, both among internal teams and in how we interact with our users. We take care to balance and be responsive to the needs of our open source community as well as our enterprise level customers.\n\nEngineering at HashiCorp is largely a remote team. While prior experience working remotely isn't required, we are looking for team members who perform well given a high level of independence and autonomy.\n\nHashiCorp's Packer ( https://www.packer.io/ ) is an open source project that automates the building of machine images across cloud provider and virtualization tools. It is used for business critical operations around the world, at start-ups and Fortune 500 companies. Candidates will need to manage the complexity of a broad integration portfolio, while at the same time keeping the project focused by adhering to the Tao of Hashicorp ( https://www.hashicorp.com/blog/the-tao-of-hashicorp ).\n\nWe want you to contribute to the development and maintenance of Packer in tight collaboration with the growing Packer community, utilizing operations and engineering skills to work across a diverse set of infrastructure providers.\n\nIn this role, you can expect to:\n\nSupport integrations with new and existing infrastructure providers.\nHelp support open source contributors, new and seasoned, with supportive and constructive code review, documentation improvements, and workflow changes.\nWork on Packer issues and improvements critical to the success of HashiCorp customers and the broader community.\n\nYou may be a good fit for our team if:\n\nYou have experience writing Go or another strongly typed & statically compiled language like C/C++\nYou have experience with customer support or OSS community support to help interface with the Terraform community.\nYou have experience operating and maintaining production systems in a Linux and public cloud environment.\nYou are familiar with infrastructure management concepts and ecosystem.\nYou have experience using Packer and care about its users' experience.\n\nIn your cover letter, please describe why you're interested in working at HashiCorp, and on the Packer team in particular.\n\nAt HashiCorp, we are committed to hiring and cultivating a diverse team. If you are on the fence about whether you would be successful working with us, please apply anyway!",
        "tags":[
            "C++",
            "Linux",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=1a2c81fd25299d2a"
    },
    "012bfe4d2d6b8d4f":{
        "title":"Software Engineer I - San Francisco",
        "company":"Berkshire Hathaway Homestate Companies",
        "location":"San Francisco, CA 94111",
        "apply_url":"https://www.indeed.com/rc/clk?jk=012bfe4d2d6b8d4f&atk=",
        "description":"WHO WE ARE:\nBerkshire Hathaway Homestate Companies (BHHC) is a group of six insurance companies that are part of the Berkshire Hathaway Group. Our Workers Compensation Division provides premier workers compensation insurance coverage to employers across the country. BHHC has earned an enviable record of success in the insurance industry supported by an A++ A.M. Best rating for the last 10 consecutive years and has seen significant growth. Our headquarters, located in the Financial District in downtown San Francisco, is the heart of our company culture centered around creativity, integrity and collaboration. Join us!\nWHAT WE’RE LOOKING FOR:\nThe technology team is rethinking how we deliver software to the Workers' Compensation industry. We're building exciting new software delivering value on a continual basis and are looking for people that are or want to become full stack .Net Software Engineers. BHHC has multiple insurance systems such as policy management system, claims management systems, customers/partners portals built and/or maintained in-house written in Microsoft stack. If you are looking to make a change, build exciting software, and be a leader in where Workers' Compensation technology is evolving let's have a talk!\n\nThe candidate is required to become a Microsoft full stack expert mastering coding in C#, Java Script, CSS/SCSS/LESS, using MVC, Bootstrap, Kendo UI, JQuery, REST APIs, Dependency Injection, Dapper, test automation components, all of this under .NET Core Framework, EF Core and a DDD (Domain Driver Design) Microservices oriented architecture.\nIn addition, the candidate must demonstrate most of the following technical competencies:\n Skilled in building clean, well-documented, understandable, reusable code\nAt least 2 years of experience developing complex Web and Windows Desktop Applications in an enterprise environment\nExperience in building Web services\nExperience with Web UI technologies (e.g. CSS, JavaScript, JQuery, Ajax)\nExperience in design and develop secure, fast and scalable web applications\nExperience in developing software as service applications\nIn addition, we are looking for:\nWorking knowledge and experience with cloud architectures and services (AWS, Google, Azure)\nUnderstanding of security issues and defensive programming techniques\nUnderstanding and ability to translate written requirements into technical design specifications\nExperience with SQL and/or NoSQL data stores\nStrong analytical and problem solving skills utilizing diagnostic abilities\nExperience in code review and acceptance processes in order to improve code quality\nStrong documentation skills to facilitate support of ongoing operational responsibilities\nStrong emphasis on unit testing and delivering defect-free code to QA\nWorking knowledge of TFS, AzureDevOps, VSTS with Git repository\nWorking knowledge of Visual Studio 2015 or 2017 (or higher)\nInterpersonal and teamwork requirements:\nAbility to work quickly in a small-team Agile development environment\nClear verbal and written communication\nDemonstrated ability to write clear specifications for complex processes\nEffective interpersonal skills collaborating with business partners and technical team members\nExperience participating in code review and acceptance process to improve code quality\nResponsive to the input and direction of team members\nExhibit results oriented and structured work habits\nPresent an ethical, enthusiastic, tactful, resourceful, and professional profile\nWHY YOU SHOULD APPLY:\nUnparalleled financial strength and stability\nFantastic growth and advancement opportunities\nGenerous Paid Time Off and Holidays\nRelaxed Atmosphere with Casual Dress Code\nOpportunity to Work From Home (1 day per week)\nExcellent Benefits (Medical, Dental, Vision, 401k, etc)\nTuition Assistance Reimbursement\nDiscounts across companies such as GEICO, See’s Candies, etc.\n\nNOTE: BHHC does not conduct interviews via social media (e.g. Google hangout, LinkedIn, etc.). Please be aware that any such contact is fraudulent and we advise that you not provide any personal information. This organization participates in E-Verify. For more information on E-Verify, please contact DHS: 888.897.7781 www.dhs.gov/E-Verify. We will consider for employment-qualified applicants with criminal histories as required by local ordinance. Additionally, no applicant will be denied employment solely on the grounds of conviction of a criminal offense except to the extent necessary to obtain a necessary license or to comply with The Violent Crime Control and Law Enforcement Act of l994, which prohibits the employment by an insurance company of persons convicted of certain crimes, unless a waiver is obtained.\n #ZIP",
        "tags":[
            "JavaScript",
            "CSS",
            "Java",
            "C#",
            "Scala",
            ".NET",
            "SQL",
            "AWS",
            "Azure"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=012bfe4d2d6b8d4f"
    },
    "6183cbce9c592245":{
        "title":"Software Engineer (iOS)",
        "company":"Zero",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=6183cbce9c592245&atk=",
        "description":"A LITTLE BIT ABOUT ZERO\n\nZero is a financial services company that provides an elegant, mobile-first, modern banking experience. We combine the simplicity of a debit card with the rewards and benefits of a credit card.\n\nWe're looking for someone who shares our love of craftsmanship and our passion for improving banking for everyone.\n\nYOUR ROLE AT ZERO\n\nYou'll be owning the development of our iOS app - and this won't be your first rodeo. You'll also be in control of what tools, frameworks and standards are used in creating this app and will be responsible for leading the iOS team as we continue to grow.\n\nWHAT YOU'LL BE WORKING WITH\n\n\nA team of experienced engineers & designers bringing banking tech into the modern era.\nA mobile-focused banking experience backed by industry-renowned investors.\nCompanywide streamlined engineering processes allowing you to quickly get set up learning, developing, and helping out with iOS (Swift), backend (Django) or web (React) if you're looking to expand your engineering horizons.\n\nWHAT WE'RE LOOKING FOR\n\n\nYou have multiple years of experience developing production-ready iOS apps\nYou're an owner - you take pride in building a pixel-perfect product\nYou're excited by startups\nYou have Swift experience\n\nBENEFITS\n\n\nWe pay 100% of your medical, dental, and vision premiums\nWe'll provide whatever equipment you need to succeed\nLunch and breakfast expenses paid\nStanding desks for everyone\nA beautiful office with a large kitchen filled with a variety of drinks, coffee, snacks, and breakfast sandwiches\n\nABOUT ZERO\n\nZero ( https://zero.app ) is a next-gen fintech company disrupting consumer banking through beautiful design, innovative features, and a business model that allows us to offer better economics to customers than traditional banks. Zero combines the simplicity of a debit card with the cash back of a credit card. Your money is safe and secure in an FDIC-insured checking account and you earn a high-yield on your deposits and unlimited 1% to 3% cash back on your purchases with Zerocard, a World Mastercard. There are no foreign transaction fees, annual fees, account minimums, or monthly maintenance fees, and our support team in California is available 24 hours a day, 7 days a week. According to the New York Times, Zero is \"a better overall offer than almost any credit card.\" Our team has launched successful products in prior roles at companies including Apple, Capital One, Dropbox, Shift, and Zynga. Zero is backed by leading investors including New Enterprise Associates, Silicon Valley Bank, Signalfire, Eniac Ventures, and Nyca Partners.",
        "tags":[
            "Swift",
            "React",
            "Django",
            "RDS",
            "iOS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=6183cbce9c592245"
    },
    "bebb0bee5b31de04":{
        "title":"Backend Software Engineer",
        "company":"Reysonic LLC",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=bebb0bee5b31de04&atk=",
        "description":"Responsibilities:\n\nKnowledgeable about backend development technologies, Including Java, Spring Boot\nWorking with queue-based services, especially ones that use Kafka or RabbitMQ\nA strong background in computer science, software design and development\nAPI development using REST JSON/XML, and security standards like OAuth\nSkills such as code refactoring, design patterns, design-driven development, continuous integration, and building highly scalable applications\nHands-on expertise in object-oriented and functional design methodology, using Java or another object-oriented language\n\nRequired Experience:\n\n4+ Years of experience building products with Backend technologies, and an excellent understanding of computer science fundamentals, data structures and algorithms\n2+ years of experience in API development using REST JSON/XML, and security standards like OAuth\nA talent for connecting and collaborating with PMO, UX, PMs and other functions that help deliver a great product\nA \"customer first\" mentality, focused on crafting an exceptional experience using our marketplace\nExperience with Agile development methodologies, with Test Driven Development and Continuous Delivery\nA real passion for discovery, problem solving, and groundbreaking technology\nA love of diving deep to confront difficult challenges across the organization\nBuilt products that are deployed at scale\n\n",
        "tags":[
            "Java",
            "Scala",
            "Spring",
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=bebb0bee5b31de04"
    },
    "99f0cc3dad048a84":{
        "title":"Estimation Engineer",
        "company":"Swift Navigation",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=99f0cc3dad048a84&atk=",
        "description":"Swift Navigation is looking for an Estimation Engineer to join its Estimation Team. The Estimation Team is responsible for translating noisy signals sent from space into precise location estimates which will be used for the future of automation.\n\nThe problem, in brief, starts with weak radio signals sent from satellites orbiting earth at 14,000 kmh. As the signals approach earth they're bent by relativistic effects, delayed by ionized particles, and refracted by near surface weather resulting in noisy, biased distance estimates which can be used to produce the location of a receiver. The Estimation team is responsible for teasing the signal from the noise, we use physical models for the things we know and statistical models to capture the rest with the goal of producing position estimates two orders of magnitude more precise than traditional GPS.\n\nThe ideal candidate uses words like \"correlation\" and \"posterior\" in daily conversation. They know the names Kalman, Cholesky and Bayes. When they hear someone say Monte Carlo, they don't think of the city. They have enough experience in academia to know how to perform research, but enough experience in industry to know to start simple and iterate.\n\nYou should have skills and experience with:\n\nAdvanced degree in Math, Stats, Computer Science, Electrical Engineering, Aerospace, Astronomy or similar.\n1+ year of experience in research, modeling, building and writing code in a core library, and writing code for correcting navigational positioning systems\nExperience in GNSS, GPS experience is a plus\nKnow how to properly evaluate a model.\nAlways likes to learn new things. (in this case, GNSS positioning).\nAre comfortable with C++, python or both.\nHave experience collaborating using version control. (git / version control).\n\nWe prefer if you possess skills in one or more of:\n\nHave a background in GNSS.\nKnow their Erdos number.\nHave experience with spatial processes.\n\nSwift Navigation ( https://www.swiftnav.com/ ), Inc. was founded in 2012 to make GPS positioning technology more accurate and affordable. Its GPS and GNSS positioning products are available a fraction of the price of the competition and deliver 100 times better accuracy than the GPS in a cell phone. Swift Navigation's technology benefits a multitude of industries and applications—including autonomous vehicles, unmanned aerial vehicles (UAVs), precision agriculture, robotics, surveying and space. With its innovation and technology honored by Inc.'s 2016 ( http://www.inc.com/profile/swift-navigation ) and Forbes 2017 ( http://www.forbes.com/profile/swift-navigation/ ) 30 Under 30 lists, Swift Navigation is enabling a world where fields farm themselves, drones fly safely and autonomous transportation can take you home.\n\nWe are located in San Francisco, close to public transportation and are well financed. Swift offers unlimited vacation days, competitive salary and benefits, 401(k), a casual office environment, hackathons and tech talks to push the professional growth of all or employees. Come join us!",
        "tags":[
            "Python",
            "C++",
            "Swift",
            "Perl",
            "RDS"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=99f0cc3dad048a84"
    },
    "cb14671fe63e80bf":{
        "title":"Software Engineer - Borrower Self-Serve",
        "company":"Blend Labs",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=cb14671fe63e80bf&atk=",
        "description":"Blend makes the process of getting a loan simpler, faster, and safer. With its industry-leading digital lending platform, Blend helps financial institutions like Wells Fargo and U.S. Bank increase productivity and deliver exceptional customer experiences. The company processes nearly $2 billion in loans daily, helping millions of consumers get into homes and gain access to the capital they need to lead better lives.\n\nThe Borrower Self-Serve team is focused on automating processes that were traditionally driven by the loan officer, empowering the consumer to drive their loan process. The team is currently focused on building out Blend’s automated pre-approval pipeline so that every borrower that touches Blend will be able to get a real time, digitally verified credit approval decision on their own time.\n\nTo power this pipeline, the team leverages a diverse set of integration across the mortgage industry to make as accurate a decision as possible. It requires building integrations to 3rd party data providers as well as building out the platform that allows 3rd party providers to build their data into the Blend platform. Our team is full-stack, owning pieces of the borrower user experience, the 3rd party integrations, the developer ecosystem, and the microservices that make the experience go.\nResponsibilities\nWork multi-functionally with product and design to deliver user facing features end to end\nDesigning APIs to allow customers and 3rd parties to integrate with our pricing and fees platform\nBuild out new integrations to credit and other data providers to improve the pre-approval funnel\nExpand the pre-approval funnel to support more use cases\nMentor junior engineers on the team\nParticipate in an on-call rotation for this teams services.\nQualifications\nExperience building real-time distributed web services\nExcellent coding, problem solving and debugging skills in a service oriented platform.\nStrong communication skills and the ability to distill and convey complex information to multiple stakeholders\nExperience working with third party API’s and integrations.\nEagerness and ability to rapidly learn new skills, technologies and concepts, taking personal initiative to execute on projects\nBonus: prior experience with Typescript + Node.js / Express, Mongo; Go / Postgres; React\nBlend is an equal opportunity employer that values diversity, inclusion and belonging. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "tags":[
            "TypeScript",
            "Node.js",
            "React"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=cb14671fe63e80bf"
    },
    "280e07628216ad36":{
        "title":"Software Engineer",
        "company":"OPSWAT",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=280e07628216ad36&atk=",
        "description":"Job Description\n\nOPSWAT is a global cyber security company providing solutions for enterprises since 2002 to prevent, detect, and remediate advanced security threats from data and devices coming into and out of their networks. Trusted by over 1,000 organizations, OPSWAT prevents advanced security threats across multiple channels of file transfer and data flow with flexible options of Metadefender solutions and API-based development and threat intelligence platforms. With over 30 anti-malware engines, 100+ data sanitization engines and more than 25 technology integration partners, OPSWAT is a pioneer and leader in data sanitization (Content Disarm and Reconstruction), vulnerability detection, multi-scanning, device compliance, and cloud access control. To learn more about OPSWAT, please visit www.OPSWAT.com.\n\nThe Position\n\nMetaDefender is the one of the key security solutions at OPSWAT as well as leading in the cyber security market with over 1,200 enterprise organizations worldwide, and our mission is to keep it as the world leading next generation API-based development and threat intelligence platforms to prevent advanced threats.\n\nWe are now looking for a Software Engineer to join our talented and ambitious MetaDefender development team based in San Francisco. If you are a knowledgeable, creative, passionate individual who is interested in designing and building most advanced cyber security solution, then come join us!\n\nThis position will be responsible for helping develop and improve our OPSWAT MetaDefender in both Windows and Linux platforms, working with a worldwide team of young talents to develop the project and provide critical technical advice and decision making.\n\nWhat You Will Be Doing\n\n\nDevelop OPSWAT MetaDefender product using C++ in Windows and Linux environment\nReview design spec / coding\nImplement feature with automated testing (unit testing and functionality testing)\nResearch feasibility of proposed solutions\nPartner with Scrum team members on delivering Sprint commitments\nCollaborate with Product Management on product requirements\n\nWhat We Need from You\n\n\nSolid programming skills in C++, Javascript, with 2 years of experience or more\nStrong command of SQL and Mongo database design, and optimization\nExcellent object-oriented design & programming skills\nKnowledge of parallel algorithms and multi-threaded design\nExperience with Qt framework\nExperience with architecting distributed, highly available, and redundant systems\nExperience with Web application development\nExperience with code coverage/static code analysis tools\nStrong team spirit, good verbal and written communication skills\nQuickly adapt to new processes, new technologies\nSelf-motivated and passionate about building technology.\n\nIt Would Be Nice If You Have\n\n\nExperience with Windows and(or) Linux system administration\nExperience in developing Computer/Network security related products\nExperience with Git, Bitbucket, Jira, Confluence, TeamCity\nExperience designing/interfacing with applications with REST API\nExperience with Agile / Scrum working environment\n\n",
        "tags":[
            "JavaScript",
            "Java",
            "C++",
            "SQL",
            "Linux"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=280e07628216ad36"
    },
    "885959a42e0a21e9":{
        "title":"Research Associate, Manufacturing",
        "company":"Whole Biome",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=885959a42e0a21e9&atk=",
        "description":"Whole Biome is on a mission to help people improve physical and mental health by creating a new category of products that target the microbiome. We are researching, developing and commercializing a novel class of rationally-designed Live SynbioticsTM (probiotics + prebiotics) that have demonstrated clinical efficacy to treat conditions like metabolic syndrome, inflammation and neurodegeneration. Whole Biome has created proprietary pipelines to build a unique discovery platform that identifies key, novel bacterial strains and the prebiotics that feed them.\n\nWe are currently seeking a Research Associate to join Whole Biome’s Manufacturing Team. This person will be part of the Microbiology team and will be responsible for working with a team of microbiologists to culture, harvest and encapsulate Whole Biome’s proprietary medical food products. Additionally, this person will have the opportunity to work with the Molecular Biology, Compute and Medical Teams to support and enable the discovery and development of novel, life-changing microbiome interventions. The successful candidate will need to be able to learn new systems quickly and adapt to changing needs as Whole Biome rapidly expands capabilities in terms of projects and processes. The ideal candidate has experience in optimizing large scale anaerobic bacteria growth while maintaining high viability to support numerous studies.\nWhat You'll Do:\nOwn day-to-day operations in our cGMP facilities\nWeekly setup, running, and tear down of a bank of fermentors, including work in off hours\nPrepare media, clean and sterilize equipment\nOperate manufacturing lab equipment, including anaerobic chambers, bioreactors, benchtop and floor centrifuges, and lyophilizers\nSchedule and follow up with 3rd party Service Engineers on preventive maintenance of lab equipment\nSupport production scale-ups and the commercialization of new products\nAssist scientists in product and process development and improvements\nManage and organize assay workflows, draft protocols, and support lab operations\nExecute biochemical and molecular biology experiments and use in-house software tools to analyze data, unsupervised\nCharacterize formulations through analytical and physiological testing\nWork with our Compute team to improve and enhance software tools for lab processes\nPresent and share results in lab meetings\nAbout You:\nB.S. or M.S. in Microbiology, Biochemistry, Biology, or related field with 1-2 years work experience\nFamiliarity with a variety of bench scale fermentation units like Applikon, Solaris, New Brunswick (Eppendorf), Sartorius, DASGIP\nFamiliarity and experience with aseptic techniques used in microbiology, required\nFamiliarity and experience in anaerobic growth of bacteria and medium optimization, required\nExperience with developing/writing SOPs, documenting and tracking lot numbers and using lab management systems, required\nDemonstrated ability to work independently and be a fully contributing member of a multi-functional fast-paced team environment\nExperience in working as part of a team to design, develop, optimize and validate assays.\nExperience in implementing and prioritizing work across multiple projects under tight time constraints\nComfort (and preferably experience) in handling human and animal samples, including stool, skin and blood\nDetail oriented and organized (understanding the basics of 5S and Lean Six Sigma).\nFamiliar with Excel, Word and Google apps\nAbility to stand for long periods of time in a laboratory setting and lift 50 pounds.\nProactive communicator\nAdaptable and passionate about improving patient care!\nWe are a highly collaborative team of scientists, engineers, physicians, marketers, and salespeople interested in improving human health by using the latest research from diverse fields, such as microbiology, molecular biology, high-throughput genomics, distributed computing, pharmaceutical development and nutrition. We believe strongly in employee transparency, collaboration, and communication to enable the most effective and efficient path to team success.\n\nWhole Biome is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. We welcome all with disabilities to apply.",
        "tags":[
            "React",
            "Mac"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=885959a42e0a21e9"
    },
    "c4499ddd7d28cf2e":{
        "title":"Software Engineer- Clusters",
        "company":"Databricks",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=c4499ddd7d28cf2e&atk=",
        "description":"Mission\n\nDatabricks was founded by the original creators of Apache® Spark™ and provides a unified analytics platform that allows users to focus on extracting value from their data, while Databricks handles for them the challenging, data-agnostic, parts of analyzing Big Data, such as reliability, easily spin up clusters, code management in notebooks and schedule production jobs.\n\nThis team builds the compute fabric necessary for managing Spark workloads in a robust, flexible, secure and cloud agnostic way. Common use cases are stable and fast while advanced users have the primitives required to take advantage of cutting edge cloud features, services and data sources.\n\nOutcomes\n\n\nDevelop and extend the Databricks product. This implies, among others, writing software in Scala, Python or Javascript and/or interacting with: cloud APIs (e.g., compute APIs, cloud formation, Terraform), with open source and third party APIs and software (e.g., Kubernetes) and with internal APIs.\nBe responsible for full software development lifecycle - design, development, testing, operating in production\nArchitect solutions to achieve a high level of reliability, scalability and securityCommunicate effectively with other engineers in the same team, with other teams and with various other stakeholders such as product managers\nOperate in an Agile development environment\n\nCompetencies\n\n\n4+ years of production level experience in one of: Java, Scala, C++\nExperience in architecting, developing, deploying and operating large scale distributed systems\nExperience with usability and user experience\nExperience with cloud APIs (e.g., a public cloud such as AWS, Azure, GCP or an advanced private cloud such as Google, Facebook)\nExperience working on a SaaS platform or with Service Oriented Architectures\nGood knowledge of Linux OS\nExperience with API development\nGood knowledge of SQL (MySQL preferred)\nExperience with software security and systems that handle sensitive data\nExposure to container technologies, such as Docker\nExperience with Continuous Integration/Continuous Deployment frameworks\n\nBenefits\n\n\nMedical, dental, vision\n401k Retirement Plan\nUnlimited Paid Time Off\nCatered lunch (everyday), snacks, and drinks\nGym reimbursement\nEmployee referral bonus program\nAwesome coworkers\nMaternity and paternity plans\n\nAbout Databricks\n\nDatabricks' mission is to accelerate innovation for its customers by unifying Data Science, Engineering and Business. Founded by the original creators of Apache Spark™, Databricks provides a Unified Analytics Platform for data science teams to collaborate with data engineering and lines of business to build data products. Users achieve faster time-to-value with Databricks by creating analytic workflows that go from ETL and interactive exploration to production. The company also makes it easier for its users to focus on their data by providing a fully managed, scalable, and secure cloud infrastructure that reduces operational complexity and total cost of ownership. Databricks, venture-backed by Andreessen Horowitz, NEA and Battery Ventures, among others, has a global customer base that includes Viacom, Shell, and HP. For more information, visit www.databricks.com ( https://databricks.com ).\n\nApache, Apache Spark and Spark are trademarks of the Apache Software Foundation ( http://www.apache.org/ ).",
        "tags":[
            "JavaScript",
            "Java",
            "Python",
            "C++",
            "Scala",
            "Spark",
            "MySQL",
            "SQL",
            "Linux",
            "AWS",
            "Azure"
        ],
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=c4499ddd7d28cf2e"
    }
}