{
    "e819c08ffbaa868a":{
        "title":"Android Engineer, Square",
        "company":"Square",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e819c08ffbaa868a&atk=",
        "description":"Job Description\n\nCome join one of our many growing Android Teams! Each has it's own unique opportunity to help grow our business and make a positive impact on our merchants and sellers!\nTeams that are hiring:\nCustomer Engagement - https://squareup.com/us/en/customer-engagement\nPoint of Sale - https://squareup.com/us/en/software/point-of-sale\nDeveloper Platform - https://squareup.com/us/en/developers\nSquare Appointments - https://squareup.com/us/en/software/appointments\neCommerce - https://squareup.com/us/en/online-store\nCheck out our Open Source Libraries - http://square.github.io/\n\nQualifications\n\nYou will (or want to learn!)...\nEnjoy working on mobile apps at all levels – from networking up to user interfaces and whatever’s in between.\nBuild high availability and highly resilient systems which can accept and accurately report payments no matter the network or device conditions.\nCollaborate with iOS, Android, and Server engineers to ship features.\nWork with product managers and designers to iterate on and define product scope and design.\nLanguages and technologies we use (and teach)...\nJava and Kotlin for development.\nEspresso for UI testing.\nProtocol buffers for network transport.\nGradle + OkBuck for our build environment.\nAlso leverage Flow, LeakCanary, Dagger, Mortar, and okhttp for day to day development.\nAdditional Information\n\nAt Square, our purpose is to empower – within and outside of our walls. In order to build the best tools for the businesses and customers we support all over the world, we have to start at home with a workforce as diverse and empowered as our sellers. To this end, we take great care to evaluate all employees and job applicants equally, based on merit, competence, and qualifications. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage candidates from all backgrounds to apply and always consider qualified applicants with arrest and conviction records, in accordance with the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible.\nSquare - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e819c08ffbaa868a"
    },
    "a7e91bf766182120":{
        "title":"iOS Engineer, Square",
        "company":"Square",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=a7e91bf766182120&atk=",
        "description":"Job Description\n\nCome join one of our many growing iOS Teams! Each has it's own unique opportunity to help grow our business and make a positive impact on our merchants and sellers!\nTeams that are hiring:\nSquare Appointments - https://squareup.com/us/en/software/appointments\nPoint of Sale - https://squareup.com/us/en/software/point-of-sale\nPayments Product - https://squareup.com/us/en/payments\nInvoices - https://squareup.com/us/en/invoices\neCommerce - https://squareup.com/us/en/online-store\nEmployee Managment - https://squareup.com/us/en/point-of-sale/features/employee-management\n\nQualifications\n\nYou will (or want to learn!)...\nEnjoy working on mobile apps at all levels – from networking up to user interfaces and whatever’s in between.\nBuild high availability and highly resilient systems which can accept and accurately report payments no matter the network or device conditions.\nCollaborate with iOS, Android, and Server engineers to ship features.\nWork with product managers and designers to iterate on and define product scope and design.\nLanguages and technologies we use (and teach)...\nSwift, Objective-C for development.\nKIF for UI testing.\nProtocol buffers for network transport.\nCocoaPods for our build environment.\nAdditional Information\n\nAt Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\nSquare - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=a7e91bf766182120"
    },
    "db84fadb16a28a81":{
        "title":"Software Developer 4",
        "company":"Oracle",
        "location":"Redwood City, CA 94065",
        "apply_url":"https://www.indeed.com/rc/clk?jk=db84fadb16a28a81&atk=",
        "description":"Software Developer 4-19000F4W\n\n\nDetailed Description and Job Requirements\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.\n\nWork is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\nOracle - \n3 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=db84fadb16a28a81"
    },
    "b0e991cc37e75c5d":{
        "title":"Dayforce HCM Payroll Consultant",
        "company":"Sability",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=b0e991cc37e75c5d&atk=",
        "description":"OVERVIEW:\nSability is hiring an experienced HCM Consultant. As a Sability consultant, you will be responsible for assisting clients during their implementation of Dayforce HCM Software solutions and providing post implementation support or enhancements.\n\nREQUIRED SKILLS\n2+ years Human Capital Management (HCM) consulting experience\nStrong analysis and consulting skills\nExperience managing multiple clients or projects simultaneously\nSolid understanding of the broad range of HCM Payroll concepts is required\nDESIRED SKILLS\nCertified Payroll Professional (CPP) and/or technical degree (computer science, engineering, business)\nDayforce knowledge preferred\n\n\nSABILTIY:\nSability is a Human Capital Management strategy and software services Consultancy. We specialize in HCM and WFM System Selection, Design and Implementation of systems such as Kronos, Infor Workbrain, Ceridian Dayforce and Ultimate Software UltiPro. Experienced HCM consultants choose Sability for our flexible work environment and sense of pride and ownership in the success of our clients. We offer virtual full-time employment opportunities across the US and Canada and are a five-time recipient of SHRM’s “When Work Works” award for workplace flexibility. As a high-growth company, we have also been recognized as a member of the Inc. 5000 and one of Inc. Magazine’s 2017 Best Workplaces.\nSability - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=b0e991cc37e75c5d"
    },
    "e1af2dbdb8d70864":{
        "title":"Software Engineer - Robotics",
        "company":"Auris Health, Inc.",
        "location":"Redwood City, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e1af2dbdb8d70864&atk=",
        "description":"Company Description:\nAuris is a technology company defining the future of medical intervention. By combining advancements in medical robotics, instrumentation, navigation and data science, Auris is building a platform technology capable of expanding the applicability of robotics to a spectrum of medical procedures.\n\nOverview:\nAuris is looking for a Software Engineer to join a team of talented roboticists and software engineers who are trying to solve some of the hardest problems in medicine today. The Software Engineer - Robotics will play a key role in the design and development of the platform software, focusing on hardware integration. The position requires not only solid programming skills, but interest and experience in making new hardware work. He/she will work closely with the other software engineers as well as engineers from other groups to implement and test software solutions. We are looking for a candidate who can work in a cross-functional team, is flexible, self-motivated, curious and passionate about revolutionizing the world of medical robotics.\n\nCore Job Responsibilities:\n\nWork with software and other engineers (mechanical, electrical, systems) as part of a focused cross-functional team developing software for medical applications\nWork closely with systems engineers to interface with hardware platforms\nDesign and implement C++ software in a real-time, and FDA-regulated environment\nUnderstand user needs, clinical needs, and customer input requirements to drive the software feature development\n\nRequired Knowledge/Skills, Education, And Experience\n\n\nBS or MS in Robotics, Computer Science, or equivalent\n2+ years hands-on experience designing and implementing software for robotic systems\nSome experience interfacing with low-level motor controllers\nProficient C/C++ programming skills and software engineering habits\nAbility to work in a regulated environment in compliance to ISO 13485 and 21 CFR 820.\n\nPreferred Knowledge/Skills, Education, And Experience\n\n\nExperience in the medical device industry\nExperience working in an Agile development environment\nFamiliarity with robot kinematics and controls\n\n\nAuris Health, Inc. - \n4 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e1af2dbdb8d70864"
    },
    "3faa0a3406912f26":{
        "title":"TPM - Product Globalization",
        "company":"Square",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=3faa0a3406912f26&atk=",
        "description":"Job Description\n\nThe Product Globalization team supports bringing Square products to global markets. Our goal is to continue building upon the US success by delivering innovative, simple, and remarkable experiences to our customers around the globe. We are looking for a highly motivated and technically skilled Project Manager to join our fun, fast-paced team. Come help us shape and deliver Square products globally!\nIn this role, you will be responsible for driving feature enhancements to our translation platform from inception through execution. You will also work with product teams to localize products for international markets. In this role you will work closely with engineers, product managers, product marketing managers and other cross functional team members to ensure that our products continue to delight our customers globally.\nYou will:\nIdentify and analyze current stakeholder needs and pain points in workflows and translation platform to define vision and strategy for our translation platform\nCreate and drive product roadmap for the translation platform\nDefine and document requirements for new platform features\nCollaborate with engineers to build features for platform\nEngage and build relationships with cross functional teams and stakeholders (Product, Engineering, Marketing, Customer Success) to evangelize localization and internationalization best practices and advocate for international product and feature needs\nLead and drive localization projects to the next level from efficiency, quality to cost perspective\nIdentify and establish key metrics to track performance and identify opportunities for improvements\n\nQualifications\n\nYou have:\n5+ years of experience in localization and internationalization\n5+ years of project management experience\nExperience with localization platforms\nStrong leadership and analytical skills in combination with excellent written and verbal communication abilities\nSelf-driven and relentlessly detail-oriented\nPassionate about delivering Square products and features to international markets\nOutstanding organizational skills: ability to handle multiple projects for multiple locales simultaneously\nAbility to identify requirements and prioritize key deliverables\nExperience with various project management methodologies and tools\nExcellent team player in a fast-paced, diverse team\nAbility to communicate at a technical level and able to communicate technical subject matter to non-technical stakeholders\nInnate drive to problem-solve\nEngineering or Computer Science degree\nEven better:\nExperience with Agile/Scrum methodology for software development\nNon-English language proficiency is a plus (French, Spanish, and Japanese)\nAdditional Information\n\nAt Square, our purpose is to empower – within and outside of our walls. In order to build the best tools for the businesses and customers we support all over the world, we have to start at home with a workforce as diverse and empowered as our sellers. To this end, we take great care to evaluate all employees and job applicants equally, based on merit, competence, and qualifications. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage candidates from all backgrounds to apply and always consider qualified applicants with arrest and conviction records, in accordance with the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible.\nSquare - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=3faa0a3406912f26"
    },
    "618133ae005229e1":{
        "title":"Deal Executive",
        "company":"Accenture",
        "location":"San Francisco, CA 94105",
        "apply_url":"https://www.indeed.com/rc/clk?jk=618133ae005229e1&atk=",
        "description":"Organization: Application Services H&PS\nLocation: Mid-West or West\nLevel 6: Senior Manager - Deal Executive\n\nPeople in the Sales career track grow pipeline and sales by supporting, managing or leading the origination and/or closing of sales opportunities in a specific area or across a range of Accenture offerings. They progress by deepening sales skills and/or developing new related skills, growing into more complex sales roles, laterally, upward, or in their current role.\n\nSales professionals drive the sales process and outcomes on a dedicated basis, growing a profitable pipeline and/or backlog of sales, through deal origination, sales negotiations and closure.\n\nAccenture’s Technology group is currently looking for an experienced technology-driven Quality Assurance & Test Automation Sales Executive to join our Sales team within the Health and Public Service industry. The successful candidate will be responsible for driving sales for all aspects of our testing and quality engineering offerings, including; Test Automation, Performance Engineering, Data Testing, Digital Testing, End-to-End testing and DevOps capabilities. The successful candidate will work closely with both our Delivery and Sales Leadership team, to guide and support them with selling these capabilities. The candidate will also be responsible for generating direct sales cycles.\n\nThe Quality Assurance & Test Automation Sales Executive is responsible for:\nOriginating new sales opportunities for Testing/QA and/or DevOps solutions\nDriving the messaging, value proposition and adoption of automation in testing and DevOps\nWorking with; the capability teams, solution architect teams and delivery teams to position sales and solution material to efficiently create compelling responses for our clients.\nWork with clients to understand where they are in their automation journey for touchless automation and cognitive computing principles and demonstrate Accenture capability in helping them achieve their goals\nTechnical solutioning of automation strategy within a client environment, and establishing our technology tools and assets to meet customer specific needs\nLeading deal shaping activities for test automation and quality engineering opportunities\nCreating and executing campaigns related to Intelligent Testing and Test Automation services across existing and white space accounts\nWorking with account teams and delivery leads to design and propose solutions that meet and exceed client needs\n\nMinimum of BS in engineering, computer science or related competencies\nMinimum 7 years of significant experience in delivering testing and/or selling testing / automation initiatives\nMinimum 5 years of hands-on practical experience in designing and architecting complex test automation solutions for large organizations\nMinimum 5 years of senior client facing experience\nPreferred 1 year minimum of experience in sales of application services capabilities\nAbility to travel up to 80%\n\nOther Professional Skills / Characteristics:\nAbility to present the value of our solutions to senior level executives including those in IT, Operation, Architecture and Business.\nDemonstrated experience working in an Agile development environment and exposure to DevOps process and toolchain\nDeeply skilled and experienced in automation best practices and methodologies, including demonstrated knowledge of latest Testing/QA industry trends\nAble to clearly articulate business cases and solutions for automation and testing\nTeam player with excellent written and verbal communication skills\nPrevious experience with proposal creation, RFP response development and SOW preparation\nRecent and proven success enabling sales teams to sell Testing/QA solutions\nMust be a self-starter, entrepreneurial, resourceful and comfortable working in a small team environment where self-sufficiency is essential\nSets direction and vision and is passionate about Accenture's business\nDevelops strong and effective working relationships based on mutual respect and trust\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).\n\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\nAccenture is a Federal Contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.\nAccenture - \n4 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=618133ae005229e1"
    },
    "67773cc2d84f83c1":{
        "title":"TPM - Mobile POS Platform",
        "company":"Square",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=67773cc2d84f83c1&atk=",
        "description":"Job Description\n\nWe are building Square’s Mobile Platform with a mission to power all of Square’s Mobile Applications and bring efficiency to developing, building and launching Mobile Apps. In this role, you will own key mobile platform initiatives for Square’s Android and iOS apps. You will drive key projects for the Mobile Platform Team across multiple products and organizations. Projects will span across a wide array of crucial initiatives from Mobile Design Systems, Mobile Frameworks, to Mobile Quality and App Health. The team is seeking a person with a strong technical background, preferably someone who has experience building mobile products. We value excellent interpersonal skills, including relationship building and collaboration within diverse and cross-functional teams for this role.\nYou will:Partner closely with engineering leads and cross-functional disciplines to drive technical projects such as creating consistent Design Systems across all mobile apps at Square.Own OKRs and drive projects towards company-wide goals for Mobile Initiatives for Square’s mobile apps.Provide hands-on program management during analysis, design, development, testing, implementation, and post implementation phases across multiple product and platform teams.Provide day-to-day execution guidance and support for engineering projects, coordinating efforts across organizations and verticals, and helping unblock all teams across Square.Communicate project status to stakeholders and various key teams around the organization.Help Evangelize the Mobile Platform Initiatives at Square.\n\nQualifications\n\nYou have:\nBA or BS Management Information Systems, Computer Science, various Engineering fields, and/or equivalent technical field experience\nTechnical knowledge and/or experience in Android & IOS Development\nProgramming Experience for writing shipping code and/or work experience in managing engineering teams is a huge plus\nAt least three years of project/program management experience.\nExperience communicating and translating non-technical to technical (and vice versa) requirements and discussions.\nExperience working across multiple teams and collaborating on solutions.\nOrganizational, coordination, and multitasking experience.\nExperience with large-scale systems.\nAdditional Information\n\nAt Square, our purpose is to empower – within and outside of our walls. In order to build the best tools for the businesses and customers we support all over the world, we have to start at home with a workforce as diverse and empowered as our sellers. To this end, we take great care to evaluate all employees and job applicants equally, based on merit, competence, and qualifications. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage candidates from all backgrounds to apply. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible.\nSquare - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=67773cc2d84f83c1"
    },
    "6a0ba028a7869595":{
        "title":"Senior Software Engineer",
        "company":"Twitter",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=6a0ba028a7869595&atk=",
        "description":"What You’ll Do:\n\nAs a member of the organization you will be dedicated to improving the reliability of our end-to-end platform. Your work will integrate directly with Twitter's products.\n\nOur core infrastructure receives hundreds of millions of tweets per day and serves tens of billions of API requests. We also serve over 2+ billion search queries per day, render hundreds of millions of ad impressions, and process hundreds of terabytes of log and interaction data daily.\n\nYou will dive deep into gnarly operational issues; from the software, systems, automation, and process perspectives. You will understand the challenges around integrating disparate infrastructures into a new facility, processes and procedures.\n\nYou will work with open-source technologies and the community.\n\nYou will actively participate in the vision to move away from high operational cost tasks such as break/fix, cluster migrations, new service buildouts, abuse, etc. You will contribute to services that can shrink and expand based on demand, self heal, automatically rollout, etc.\n\n\nServices we work on:\n\nUser Service - We encapsulate the core business logic for the entire lifecycle of a Twitter user and provide efficient, scalable access to user data at high volume.\nSocial Graph Service - We provide a centralized service layer for handling many-to-many relationships at Twitter's scale.\nTweet Service - We ensure that Twitter's users and internal teams can create and access tweets: reliably, at scale, and in real time.\nStratostore - We help increase Twitter's pace of feature development by providing a convenient internal interface for accessing & consuming data from a variety of sources at scale, without needing to worry about operational concerns.\n\n\nYour responsibilities include but are not limited to:\n\nYou will perform deep dives into both systemic and latent reliability issues; partner with software and systems engineers across the organization to produce and roll out fixes.\nYou will troubleshoot issues across the entire stack: hardware, software, application and network,\nYou will drive standardization efforts across multiple disciplines and services in conjunction with embedded SREs throughout the organization.\nYou will mentor SREs on standard methodology for everything from monitoring to troubleshooting complex code issues.\nYou will identify and drive opportunities to improve automation for the company; scope and create automation for deployment, management and visibility of our services.\nYou will participate in code reviews for projects primarily written in Java and Scala, built on open source libraries such as Finagle, and running on both physical and virtualized platforms.\nYou will represent the SRE organization in design reviews and operational readiness exercises for new and existing services.\n\n\nWho You Are:\n\nSolid understanding of systems and application design, including the operational trade-offs of various designs.\nPractical knowledge of various aspects of service design like messaging protocols & behavior, caching strategies and software design practices.\nPractical, solid knowledge of shell scripting and at least one higher-level language (Python or Ruby preferred).\nDemonstrable knowledge & experience of Linux servers, specifically RHEL/CentOS, TCP/IP, HTTP, and experience supporting multi-tier web application architectures.\nExperience in handling services in a large scale environment.\nPractical experience in Java or Scala.\nWork well with and be able to influence a myriad of personalities at all levels.\nAbility to prioritize tasks and work independently.\nBe adaptable and able to focus on the simplest, most efficient & reliable solutions.\nTrack record of successful practical problem solving, excellent written and social communication, and documentation skills.\nB.S. in computer science or similar field or equivalent experience.\n\n\nDesired\n\nAbility to lead technical teams through design and implementation across an organization.\n\nExperience with existing open source projects such as Scribe, ZooKeeper and Apache Mesos.\n\n\nWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, ethnicity, color, ancestry, national origin, religion, sex, sexual orientation, gender identity, age, disability, veteran status, genetic information, marital status or any other legally protected status.\nTwitter - \n3 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=6a0ba028a7869595"
    },
    "1efee3a93728d039":{
        "title":"Java Engineering Intern / Software Engineering Intern",
        "company":"PubMatic",
        "location":"Redwood City, CA 94063",
        "apply_url":"https://www.indeed.com/rc/clk?jk=1efee3a93728d039&atk=",
        "description":"Job Description\n\nPubMatic is hiring an hourly Java Development Intern for a 40-hour work week with an immediate start in Redwood City.\n\nRole & Responsibilities\nDesign and implement the software solutions for PubMatic Application/Modules in PubMatic's technical infrastructure\nInteract with Product, UI, QA, Account management and platform teams in US and Pune, India for new features, enhancements and fixes\nDevelop code that is modular, scalable, high performance and to high-quality standards\nCreate new or fix existing common components in the PubMatic platform\nDesign and review the work of team members to ensure coding guidelines are followed\nInteract with cross functional teams to resolve the dependencies and ensure timely delivery of the features\nImprove current technical stack used in different PubMatic Modules\nAutomate development, QA build and deployment processes\n\nQualifications\n\nVery strong computer science fundamentals - data structures, algorithms, etc.\n1+ years of C/C++ or Java development experience\n1+ years of design patterns, debugging techniques, build processes, test frameworks and CI tools\n1+ years of Agile and Scrum methodologies including sprint planning, daily standups, sprint demos, sprint retrospectives, estimation and prioritization techniques\nBachelors or MS in Computer Science / Engineering\nExperience in working and coordinating with cross functional teams\nKnowledge of the application performance and scalability considerations\nImplementation of professional software engineering best practices for the full software development life cycle, including coding standards, code reviews, source control management, documentation, build processes, automated testing, and operations\nA passion for developing and maintaining a high-quality code and test base, and enabling contributions from engineers across the team\nDemonstrated ability to achieve stretch goals in a fast-paced environment\nDemonstrated ability to learn new technologies quickly and independently\nExcellent verbal and written communication skills, especially in technical communication\nStrong interpersonal skills and desire to work collaboratively\nNice to Have:\nPrior experience working in a startup\nPrior experience with managing technical escalations from customers\n\n#LI-NP1\nAdditional Information\n\nAbout Us\nPubMatic is proud to be an equal opportunity employer; we don’t just value diversity, we promote and celebrate it.\nWe do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nAll your information will be kept confidential according to EEO guidelines.\nPubMatic - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=1efee3a93728d039"
    },
    "0516e6350dd685de":{
        "title":"Senior Engineer- Java",
        "company":"OpenTable",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=0516e6350dd685de&atk=",
        "description":"Job Type: Full Time\n\nLocation: San Francisco, CA\n\nDepartment: Engineering\n\nAt OpenTable, we take pleasure in Software Development. We believe that velocity comes from a commitment to clean code and proven engineering principles. We deliver innovative products through rapid, continuous development. Millions of diners and thousands of restaurants around the globe use our products. If you are excited by constantly challenging engineering processes and can deliver exceptional quality in a fast-paced, agile environment, we'd like to meet you. Bonus points if you love restaurants too.\n\n---------------------\n\nYou'll Work On:\n---------------------\n\nJoin a fast paced highly collaborative team to build out mission-critical edge, gateway and backend microservices. You will be responsible for your code throughout all phases of the life cycle. You build it, you maintain it. All our solutions are required to scale to meet increasing demand. All your efforts will be highly visible; we code review all production bound commits.\n\n---------\nAbout You\n---------\n\nYou love to code. You're curious, passionate and constantly thinking about making code clean and better. You love technology and enjoy finding better ways to do things. You want to share what you discover and feel energized when you can learn from the people around you. When you build software, you consider how people will use it from all angles. You take pride in carefully honing your work until it feels reliable and effortless to use.\n\n---------------------\nCore Responsibilities\n---------------------\n\n\nDesign, implement and maintain Java microservices\nWrite unit and integration tests\nMonitor applications in production\n\n------------------\n\nPreferred to have:\n------------------\n\n\nBachelor's degree in Computer Science or equivalent\n5+ years of Java and Spring development experience\nIn-depth knowledge of design patterns, data structures and OO design\nExperience of building production quality, highly available services and designing service oriented architectures\nSolid experience designing and building RestFul APIs and Microservices architecture\nUnit and integration test development experience\nDocument (NoSql) or relational database experience\nExperience building message driven systems, use of Kafka\nGood interpersonal skills and be an excellent teammate\n\nNice to have:\n\nReactive programming\nFunctional programming\nDocker / Kubernetes / Singularity / Mesos\nMongoDB / PostGres\n\nAs an employee of OpenTable, you will be part of a global network that includes OpenTable and KAYAK's portfolio of metasearch brands including momondo, Cheapflights, Swoodoo, checkfelix and Mundi. Many employees are dedicated to one brand, but we all have the benefit of using each other's strengths and insights. Together, we're able to help people experience the world through dining and travel.\n\n---------------\nAbout Opentable\n---------------\n\nOpenTable, part of Booking Holdings Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, seating more than 24 million diners per month via online bookings across approximately 40,000+ restaurants.\n\nSince its inception in 1998, OpenTable has seated more than 830 million diners around the world. The Company is headquartered in San Francisco, California, and the OpenTable service is available throughout the United States, as well as in Canada, the United Kingdom, Australia, Japan, Germany, Mexico and many other countries.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nOpenTable - \n5 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=0516e6350dd685de"
    },
    "ed4ef4945c04c0e9":{
        "title":"Machine Learning Engineer, Knowledge Platform",
        "company":"Square",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=ed4ef4945c04c0e9&atk=",
        "description":"Job Description\n\nThe knowledge platform team is seeking senior machine learning engineers to join our engineering team. The knowledge platform at Square is building a state-of-the-art machine learning platform powering AI for Square.\nThe ideal candidate will have industry experience in solving and optimizing large-scale machine learning problems. Experience in many of the following areas is highly desired - streaming ML, recommenders, deep learning, NLP, AI Agents and knowledge graphs. We are looking for passionate and self-driven innovators to help us build this V1 platform from the ground up and be part of a fast-paced team. You will be expected to contribute in building ML systems/tooling and building advanced ML models that scale. You will have wide impact across the company with opportunity to publish papers, contribute to open-source, influence and collaborate with the data science community across Square.\n\nQualifications\n\nYou have:\n12+ years professional machine learning experience with solid engineering and coding skills.\nFamiliarity with key machine learning concepts, models, and evaluation methodologies.\nExperience with cloud computing platforms, such as AWS, Google Cloud or Azure.\nExperience in designing and productionizing large-scale distributed systems built around machine learned models and big data.\nAbility to produce scalable and robust production-quality code incorporating testing, evaluation, and monitoring.\nAn advanced degree (PhD or MS) in Computer Science or related engineering discipline or the equivalent technical depth.\nTechnologies we use:\nJava, Python, Google Cloud Platform, AWS, Snowflake\nJupyter Notebook, REST APIs\nAdditional Information\n\nAt Square, our purpose is to empower – within and outside of our walls. In order to build the best tools for the businesses and customers we support all over the world, we have to start at home with a workforce as diverse and empowered as our sellers. To this end, we take great care to evaluate all employees and job applicants equally, based on merit, competence, and qualifications. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage candidates from all backgrounds to apply and always consider qualified applicants with arrest and conviction records, in accordance with the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible.\nSquare - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=ed4ef4945c04c0e9"
    },
    "20f55af4539b67cd":{
        "title":"Sales Engineer / Solutions Engineer",
        "company":"Smaato Inc.",
        "location":"San Francisco, CA 94108",
        "apply_url":"https://www.indeed.com/rc/clk?jk=20f55af4539b67cd&atk=",
        "description":"Job Description\n\nSmaato’s Sales Engineering team is the interface between our most valued clients and everything technical of our platform. Focused on the growth and retention of these high profile clients, this team's efforts are highly visible within the company. The team helps new prospects to understand the technology and the nuances of our products, makes sure the technical integration is feasible, works smoothly and is done in the best possible fashion. Being the mastermind for technical challenges that need investigation the team also ensures ongoing technical health of existing clients, supports rolling out new products and stays in sync with the product team to ensure they build the right things for our clients.\nAs a Sales Engineer at Smaato you have a deep understanding of the product and the technical background. You are also a great communicator and work with your counterparts on the client side on a daily basis. Your main goal is the client's success and to leverage your creativity and technical expertise by identifying technical challenges and their solutions.\nWhat you'll be doing\nEnsure success of our key clients from a technological perspective\nFind the best way to technically integrate our products and develop solutions for complex integrations in cooperation with our clients\nManage, understand and convey clients' requirements to product management and engineering teams to ensure they build the right products for our clients\nLiaise closely with the sales and account management teams as the technical expert and participate in developing and presenting strategic sales proposals\nHandle issues reported by clients and internal teams including verifying the issue, isolating and diagnosing the problem and developing solutions where appropriate\nCoordinate the solution of unresolved issues with our clients, product management and engineering teams\nDevelop and deliver product demonstrations and produce support materials such as guides and documentation\nUse a variety of tools, e.g. SQL queries, JavaScript consoles and log analysis\n\nQualifications\n\nYou have gained at least a few years of experience as Solutions Engineer, Product Support Engineer, Mobile Web/App Developer, Technical Consultant or a similar job with a strong technical background\nThorough experience in web technologies are expected, mobile app technologies are strongly preferred\nRobust understanding of ad-tech ecosystem with granular understanding of Real-Time Bidding (RTB), Supply-Side Platforms (SSP), Demand-Side Platforms (DSP) and ad exchanges/networks is an advantage\nYou are able to read, understand, and troubleshoot JavaScript code and have hands-on experience in SQL\nExperience in Android and iOS debugging and development is a plus\nYou have a curious and proactive mindset as well as a customer-oriented attitude\nWhilst you are a great team player you have the ability to work independently\nPersistence as well as creativity to get to the bottom of complicated, inconsistent technical issues completes your profile\nA technical university degree in e.g. Computer Science is desired\nTo ensure effective in- and external communication, business proficient English skills are required\n\nAdditional Information\n\nPerks of being a Smaatie\nA unique and diverse company culture, shaped by people with a sense of commitment and responsibility, risk-taking and discipline\nFlat hierarchies and short decision paths\nCompetitive salaries and generous benefits package including 100% employer paid health, dental, life and vision insurance, public commuter cost reimbursement, FSA, HSA, 401(k) plan. 21 days paid vacation and sick time, 2 paid floating holidays, 9 paid holidays and employee discount and supplemental benefit options through ADP\nTraining programs and career development opportunities\nFlexible working hours and work-life-balance options\nWellness program and fitness reimbursement credit\nWeekly catered breakfasts and lunches as well as summer/winter company parties\nRegular team events and fully-stocked kitchen with snacks and drinks\nWork in the heart of downtown San Francisco on historic Union Square\nBe part of an empowered, innovative Smaato team changing the mobile world, and send us your application now!\nSmaato Inc. - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=20f55af4539b67cd"
    },
    "aa6b90242f0fb11a":{
        "title":"React JS Developer",
        "company":"Infostretch Corporation",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=aa6b90242f0fb11a&atk=",
        "description":"Infostretch is seeking a skilled ReactJs Developer with min. of 4+ years of experience in developing enterprise web/mobile app in agile model. This role will be based in our Santa Clara, CA.\n\nJob Description:\nB.S. in computer science, software engineering, computer engineering, electrical engineering, or related area of study\nMinimum 1+ years of strong real time experience in developing React JS based applications with Redux\nStrong expertise in working with Node JS, WebPack and other tools related to React Front End Development.\nExperience in designing & developing reusable front-end frameworks, node modules and tools\nMinimum 4+ years of strong experience in Front End technologies\nHTML5\nCSS3\nObject Oriented JavaScript (ES5 & ES6)\nExperience in developing enterprise level responsive web pages or applications\nExperience in implementing web accessibility using ARIA techniques is a plus\nExperience in LESS / SASS css pre-processors is a plus\nExperience in unit testing code with JEST / enzyme / Jasmine / Mocha / Chai is desired\nStrong verbal and written communication skills\nGood analytical skills\nInfoStretch Corporation - \n5 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=aa6b90242f0fb11a"
    },
    "7416455949f912fb":{
        "title":"Product Data Scientist - Quip",
        "company":"Salesforce",
        "location":"San Francisco, CA 94105",
        "apply_url":"https://www.indeed.com/rc/clk?jk=7416455949f912fb&atk=",
        "description":"Job Category\nProducts and Technology\nJob Details\nQuip's mission is to build a new class of productivity tools that every person at every company enjoys using each day. We're looking for a seasoned product data scientist who can surface actionable insights that transform our product. This role will primarily focus on informing product strategy and development by deriving insights from our data and presenting them to key stakeholders.\n\n\nOur Data Science and Analytics team is small, which means that flexibility is crucial. As a product data scientist at Quip, you'll partner with cross-functional teams like engineering, product, and design. You'll also be a self-starter who isn't afraid to dive deep into the data, look ahead for potential opportunities and broad impact, and plan the data and product roadmap accordingly.\nResponsibilities\nWork cross-functionally with product managers, engineers, and designers to improve Quip using insights from data\nDeep dive into product areas and identify opportunities for product change and improvement\nDefine key success metrics and event logging for new product features\nBuild dashboards and reports to provide visibility into product goals and decisions\nDesign and analyze product experiments to test proposed product features\nEmpower the broader organization with the skills and tools to make data-driven decisions\nRequirements\nBA/BS degree in computer science, math, or a related technical field\n4-5 years of relevant experience (data analyst, business intelligence, engineer, etc.)\nStrong analytical skills with a technical background\nProficient in SQL\nProficient in working with large datasets\nExperience using statistics to test data (AB hypothesis testing, regressions, etc.)\nExperience building dashboards and reports\nPosting Statement\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay fees to any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org.\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\nSalesforce - \n4 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=7416455949f912fb"
    },
    "b290b3e0db3b0a1d":{
        "title":"Staff Security Engineer",
        "company":"NerdWallet",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=b290b3e0db3b0a1d&atk=",
        "description":"NerdWallet's business is built on trust. Our customers trust us with highly sensitive personal information including SSNs, bank account numbers, etc. Not only do we take it seriously to securely protect our customer's data, we go above and beyond to make security a business differentiator.\n\nWhere you can make an impact:\n-----------------------------\n\n\nConduct threat modeling, architectural reviews, penetration testing, security code reviews\nLead security awareness program, secure coding practices\nBuild secure coding libraries and tools for use by engineering and DevOps team\nAutomate security testing across build and release pipeline\n\nYou are:\n--------\n\n\nPassionate about protecting NerdWallet user's data and brand\nSolution driven, excited to proactively build solutions (tools, libraries, service) more than just detecting/reporting vulnerabilities\nAble to effectively communicate and collaborate with technical and non-technical stakeholders\nSelf driven, motivated, and looking for new challenges to develop your career\n\nYour experience:\n----------------\n\n\nB.S. or M.S. Computer Science or related field\n5+ years of experience driving secure code development and best practices within an Engineering and DevOps organization\nProficient in more than one programming language: C++, Java, Python, Ruby, JavaScript, PHP\nIn-depth knowledge of authentication protocols (OAuth, SAML), applied cryptography, PKI, networking (TCP/IP, DNS, SSL/TLS)\nCISSP, SANS or GAIC penetration testing certifications are a plus\n\nWhat we offer:\n--------------------\n\n\nCompetitive compensation package\n401(k) with company match\n100% paid premiums for medical, dental and vision for employee and their dependents\nPaid maternity and paternity leave\nCommuter, gym and cell phone stipend\n$500 enrichment stipend towards learning and development for your role\nCatered lunches daily, free dinner and kitchens stocked full of snacks\nOnsite coffee bar with baristas\nCompany happy hours, social events and outings\nGenerous, flexible vacation\n\nNerdWallet is committed to pursuing and hiring a diverse workforce and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of any characteristic protected by applicable federal, state or local law.\nNerdwallet - \n5 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=b290b3e0db3b0a1d"
    },
    "b26cd50de8625057":{
        "title":"Senior Software Engineer, Hadoop Development",
        "company":"Visa",
        "location":"Foster City, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=b26cd50de8625057&atk=",
        "description":"Job Description\n\nhe Sr. Software Engineer (Hadoop Development) within the MAP PD will be responsible for designing, developing and implementing Data integration and Analytics solutions on Hadoop and using BI tools, Data mining and/or Machine learning provide insights on the data. This position requires close collaboration with business partners to understand their business goals, understand requirements, design, develop and implement Data Analytics solutions following SDLC and agile methodologies.\nIdeal candidate for this position will have a minimum of five years experience in development and delivery of Analytics projects and two years development experience on Hadoop.\n\nQualifications\n\nExperience with following technologies: Java, Spark/Scala, RDBMS, Big Data Hadoop platform technologies and tools (Hadoop, Hive, HBase, Spark, Sqoop, Flume and related tools)\nExperience to leverage machine learning technologies to deliver advanced analytics\nSolid understanding of principles and APIs of MapReduce, RDD, DataFrame and DataSets\n Strong working experiences of implementing Big Data processing using MapReduce algorithms and Hadoop/Spark APIs\n Experience building workflow to perform predictive analysis, muilti-dimensional analysis, data enrichments etc.\n Bachelor or Master Degree in Computer Science, or other related technology discipline\n\nAdditional Information\n\nVisa will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Article 49 of the San Francisco Police Code.\nAll your information will be kept confidential according to EEO guidelines.\nVisa - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=b26cd50de8625057"
    },
    "931fd8aa017831f2":{
        "title":"Senior Software Engineer, (Python) Bioinformatics (Redwood City or Seattle)",
        "company":"Guardant Health",
        "location":"Redwood City, CA 94063",
        "apply_url":"https://www.indeed.com/rc/clk?jk=931fd8aa017831f2&atk=",
        "description":"Job Description\n\nPosition Summary:\nThis role is in the bioinformatics team – you will be responsible for the software that is used in the clinical laboratory to process patient samples and analyze their genomic profiles, finding the right treatment options for cancer patients based on a simple blood draw. You will participate in a small team following agile methodology. Your role would be to implement new solutions and architectures to solve complex problems in a clinical NGS setting.\nEssential Duties and Responsibilities:Work with users and product managers to gather and refine requirements.\nCreate and translate UI / UX wireframes into visual elements using React, JavaScript, HTML, CSS, Python.\nMaintain and extend the applications RESTful web service / APIs in Python.\nDesign and implement solutions end-end from user interface through persistent storage.Provide written documentation and specifications of software products and services. Preferably in a regulated environment such as IVD or CLIA.\nEvaluate, test, and use open-source software and applications. Interface with other teams to obtain requirements and support deployed applications.\nAbility and desire to work on all aspects of software development in an agile environment including documentation, design, development, and testing of features and sub-systems.\nSkills/Requirements:\n6+ years experience developing software in production environment\nStrong understanding of Python, React, JavaScriptDemonstrated knowledge and experience using object-oriented programming and design patterns in production environments\nWorking knowledge of Django and DRF Working knowledge of managing and deploying Docker (or other virtualization technologies)\nExperience working with a relational database, preferably PostgreSQLEffective communicator with written and verbal fluency in English.\nDetail oriented with an initiative to drive tasks to completion.\nAbility to work well in a rapid-pace startup environment\nAbility to work well in a group and independently with minimal supervision\nDemonstrable ability to perform the Essential Duties and Responsibilities of this position.\n\nThe following experience is not required but is highly desired:Advanced knowledge of MVC ; working knowledge of HTML / JavaScript, manipulation of large data sets and visualizations, i.e. matplotlib.\n\nEducation\nB.S. in Computer Science or related field\n\n#LI-LC1\n\nQualifications\n\nnull\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines.\nGuardant Health - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=931fd8aa017831f2"
    },
    "96bb0ed4338711d2":{
        "title":"Senior Platform Engineer",
        "company":"Sumo Logic",
        "location":"Redwood City, CA 94063",
        "apply_url":"https://www.indeed.com/rc/clk?jk=96bb0ed4338711d2&atk=",
        "description":"In June 2017, Sumo Logic announced another $75M funding round led by Sapphire Ventures, with participation from new and existing investors including DFJ Growth, Greylock Partners, Sequoia Capital, and others ( https://www.sumologic.com/press/2017-06-27/75-million-funding-round/). This brings our total funding to $235.5M to date. Sumo Logic's business has scaled significantly. We have also enjoyed consistent growth in our recurring revenue and customer count to over 1,600+ customers, reflecting every major vertical and company size.\n\nWho Are We?\nWe are a secure, cloud-native, machine data analytics service, delivering real-time, continuous intelligence from structured, semistructured and unstructured data across the entire application lifecycle and stack. Our mission is to democratize analytics, making it accessible, simple and powerful for businesses of all sizes to build, run and secure their organizations. With Sumo Logic, customers can harness the power of machine data to gain operational business and customer insights that lead to competitive advantage and differentiated customer experience.\n\nWhat we do:\nSumo Logic was founded in 2010 by experts in log management, scalable systems, big data, and security. We imagined a world of Yottabyte-scale machine data, where machine learning algorithms and advanced analytics could make sense of it all. Today, our purpose-built, cloud-native service analyzes more than 100 petabytes of data, more than 16 million searches, and delivers 10s of millions of insights daily – positioning Sumo among the most powerful machine data analytics services in the world. Our customers around the globe rely on Sumo Logic for the analytics and insights to build, run and secure their modern applications and cloud infrastructures. With Sumo Logic, customers gain a service-model advantage to accelerate their shift to continuous innovation, increasing competitive advantage, business value and growth.\n\nThe proliferation of machine log data has the potential to give organizations unprecedented real-time visibility into their infrastructure and operations. With this opportunity comes tremendous technical challenges around ingesting, managing, and understanding high-volume streams of heterogeneous data.\n\nAs a Senior Platform Engineer, you'll be working on design and development of robust, elegant, and extensible frameworks for Sumologic's platform. This is a highly distributed, fault tolerant, multi-tenant platform written in Scala running in the AWS cloud, that includes bleeding edge components for APIs, security, configuration, content, and access control. The Platform Engineering team's charter is to enable developers to automate and extend Sumo Logic's large-scale high-throughput distributed system. The team achieves this through two parallel efforts. First, by designing and building the backend infrastructure and common frameworks that are used by all other Sumo engineers to develop end user solutions. Second, by providing our users with access to the dependable APIs and declarative configuration tools they need to build and enhance complex big data services and machine learning solutions with ease. The platform team is responsible for Sumologic's API framework, content and configuration management frameworks, application framework, and authentication and access control frameworks..\n\nResponsibilities:\n\nWork with product development teams to ensure robust, secure service posture from design over implementation to operation of Sumo Logic applications and cloud services.\nDesign and develop the new APIs and promote an API first approach to software delivery across the engineering team.\nDesign and develop Sumologic's declarative content and configuration management frameworks.\nDesign and develop the federated multi-tenancy authentication and authorization model used across all our solutions to enable the complex security needs of our customers.\nAnalyze and improve the efficiency, scalability, and reliability of our platform components.\nWrite robust code; demonstrate its robustness through automated tests.\nWork as a member of a team, helping the team respond quickly and effectively to business needs.\n\nRequirements:\n\nB.S., M.S., or Ph.D. in Computer Sciences or a related discipline\n5+ years of commercial industry experience working on complex back-end distributed systems\nFamiliarity with fault-tolerant high throughput and high concurrency distributed cloud architectures using microservices, and their security and scalability.\nExperience design and implementation of RESTful APIs. Familiarity with OpenAPI and Swagger is a plus.\nFamiliarity with authentication, authorization, and SSO concepts and technologies for federated multi-tenant SaaS and web applications.\nObject-oriented programming experience, for example in Java, Scala, Ruby, or C++.\nUnderstand performance characteristics of commonly used data structures (maps, lists, trees, etc).\nDesire to learn Scala, an up-and-coming JVM language (scala-lang.org).\n\nDesirable:\n\nExperience in multi-tenant and/or 24x7 commercial service is highly desirable.\nExperience designing/building scalable REST API's for distributed microservices.\nExperience with AWS environments and services will be big plus (e.g. EC2, ELB, SQS, KMS, Cloudwatch, etc)\nHappy working with Unix (Linux, OS X).\nAgile software development experience (test-driven development, iterative and incremental development) is a plus.\n\nApply online at https://www.sumologic.com/company/careers/\nSumo Logic - \n4 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=96bb0ed4338711d2"
    },
    "a2484ae336941ac2":{
        "title":"Senior Technical Ad Operations Associate-Walmart Media Group",
        "company":"Jet.com",
        "location":"San Bruno, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=a2484ae336941ac2&atk=",
        "description":"At Walmart, we enable the connection between supplier brands and retail shoppers at unprecedented scale. As primary stewards of our brand promise, “Save Money. Live Better,” we work alongside some of the most talented people in the world to engage with the more than 150M households who shop with us. This is a unique opportunity to join a small, high-visibility team within the largest company in the world. We believe all digital advertising can be targeted and accountable – and we have Walmart’s sales data to prove it. Walmart Media Group wins when suppliers invest in digital media to drive growth; Walmart and our supplier partners win when your digital expertise helps sell more goods online and offline. Growth in our digital advertising business is key to Walmart’s overall growth strategy.\n\nWalmart Media Group (the digital ad sales arm for Walmart.com, Jet, Hayneedle, Online Grocery, Vudu, etc.) is dedicated to driving measurable outcomes for our suppliers, merchants, stores, GMs, brand advertisers, and agencies. Our full funnel ad solutions leverage Walmart’s in-store and online data, extensive reach, and to provide measurable results for our clientele. With a range of flexible pricing and buying models, including self-service; these solutions help businesses build brand awareness, engage with Walmart consumers, and convert Walmart consumers to shoppers.\n\nWalmart Media Group is seeking a Senior Technical Ad Operations Associate to join our team in San Bruno. We are looking for an individual who loves digging into data, troubleshooting, learning new technologies and solving difficult problems. As a Senior Technical Ad Operations Associate, you will be responsible for the technical support and on-boarding of new ad products across the WMG ad portfolio.\n\nYou will partner closely with Product and Engineering to roll-out new products, features, and integrations. You will become an expert in Walmart's omni-channel solution, using Walmart’s proprietary data, to deliver exceptional performance for our clients.\n\nResponsibilities\n\nLevel 2 technical support for campaign issues and discrepancies\nNew product Q/A and Testing\nLiaise with Product and Engineering, providing feedback to improve operational efficiency and workflow.\nDevelopment of trafficking and ad operations specifications and documentation for new products\nSupport platform bugs\nTrain campaign management and ad operations teams on new product execution and product enhancements\nTechnical evaluation for all WMG vendors and partners\n\n\nMinimum Requirements\n\n3-4 years of experience in Digital Ad Ops, Product or Engineering\nBachelor's degree in Computer Science, Software Engineering\nA great depth of understanding on the online advertising industry: desktop, mobile (web/in-app), video, and search technologies, as well as measurement platform knowledge\nHighly proficient in digital ad server technology (e.g. Doubleclick), Demand Side Platforms (e.g. AppNexus, Doubleclick), SaaS platforms and data measurement.\nStrong knowledge of campaign lifecycle management, ad sales process, trafficking, QA, performance analytics/ reporting.\nComfortable working with large data sets using a variety of tools\nStrong verbal and written communication skills\nPassion for digital media and advertising technology\n\n\n#WalmartMediaGroup\n\nAbout Walmart.com\n\nThe Walmart US eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the world’s largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in merchandising, marketing, supply chain, talent and more, we are reimaging the intersection of digital and physical shopping to help achieve that mission\nJet.com - \n5 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=a2484ae336941ac2"
    },
    "d705adf544bac359":{
        "title":"Associate Product Manager",
        "company":"Visa",
        "location":"Foster City, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=d705adf544bac359&atk=",
        "description":"Job Description\n\nThe global Product Organization delivers the holistic product strategy for Visa and accelerates the seamless delivery of our products into markets. We are investing in the next generation of talent to ensure our products, services and data are the center of the changing ways people pay and get paid. We are at the core of Visa’s overall vision to be the best way to pay and be paid for everyone, everywhere. We are fueled by a diverse team of talented team-members who continuously raise the bar on delivering best-in-class products and services to people all over the world.\nWe are looking for looking for talented, aspiring future Product Managers with varying levels of experience and background (0-4 years of work experience) to join our progressive Associate Product Manager Program. In this program you will be staffed on our highest need initiatives and enrolled in a learning and development plan targeted at developing our most critical product manager competencies. While experiences may vary by candidate and business need, the program will include 2-4 rotations over 24 months working on high impact product opportunities while collaborating with a wide array of key stakeholders across product, engineering, sales, strategy and marketing. Rotation and learning experiences will build skills in innovation and design, product marketing and product implementation. The intention is that, upon completion, high performing program participants will be prepared to take on advanced product management roles.\nAs an Associate Product Manager at Visa, you will be a key member of the team that drives the latest and most innovative ideas from product ideation, to build, to launch, to scaling in the market. You will assist in delivering next generation product offerings to our customers, including innovative payment experiences, cutting edge fraud prevention, capabilities to help banks, tech companies, fintechs and merchants meet their consumers’ needs, and local solutions tailored to one or more of the 200 countries we operate in.\nYou must be a self-starter, ready to learn and experiment, and be able to work both independently and as part of a team. A key driver of success will be the ability to focus on the highest leverage activities in the face of rapid change and new information, and the ability to independently drive activities all the way to successful completion. Product management will be a focal point in our strategy to delivery world-class products to market, and the Analyst role is a key piece of that vision.\nWe are hiring for the Associate Product Manager Program in the Bay Area; may be placed in our Foster City or San Francisco offices.\nResponsibilitiesSupport the development of the product strategy, go-to-market plans, and product design documents (concept document, business case, product requirements)Support the development of the product roadmap to define/support the product goals and strategiesBecome knowledgeable on Visa’s products and support the product team in driving the development of product features and functionality, leveraging the strong foundation of existing capabilities where appropriate.Understand market trends, competition, and user requirementsDistill market research to provide perspective to the team and product management leaders to inform insights and decisionsCollaborate with designers to create design concepts and with Engineering to implement and iterate on these conceptsCollaborate with internal Visa teams (e.g., regional teams, Product Marketing, Business Development) to define and execute a cohesive strategy related to a specific product or feature\n\nQualifications\n\nBasic QualificationsMinimum of 1 year of work experience or a Bachelor’s Degree\nPreferred QualificationsBA/BS degree in Computer Science, Electrical Engineering, Mathematics, Statistics, or a related technical field, or equivalent practical experience in conjunction with a less technical BA/BS1- 4 years of related work experienceEagerness and self-starting approach and an entrepreneurial mindsetProblem-solving, organizational, analytical, and critical thinking skillsExcellent written and verbal communication skillsExperience working in cross-functional collaborative environmentsKnowledge or experience with Agile methodology to drive product development and deliveryProven ability to take initiative and to build strong and productive relationshipsEntrepreneurial and resourceful with the ability to handle numerous projects concurrentlyFocused on providing excellent customer experiencesTeam oriented, collaborative, and flexible\nAdditional Information\n\nVisa will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Article 49 of the San Francisco Police Code.\n\nAll your information will be kept confidential according to EEO guidelines.\nVisa - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=d705adf544bac359"
    },
    "bedd71d6a6bcacc8":{
        "title":"Lead Data Engineer - Insurance",
        "company":"Verisk",
        "location":"San Francisco, CA",
        "apply_url":"https://www.indeed.com/rc/clk?jk=bedd71d6a6bcacc8&atk=",
        "description":"Job Description\n\nJob Description\nThe Data Affluence group is responsible to support the analytic product development in the following aspectDevelop and maintain a data model in Cloud that contains the major entities and attributes which represent the ideal state of content and structure for insurance claims. Our focus would be on any transformed/engineered/normalized views that would create efficiencies and provide value added transformed attributes for data science teams to consumeIdentify new or existing raw sources of information to better populate our conceptual data modelEnhance data assets by applying new methods and algorithms to raw dataDevelop expertise in each data asset to become the go-to resource for data consumers/users on both raw data and transformed dataExplore and deploy right tools for exploratory, Metadata and Master Data Management, data quality and reporting and data process flow managementCreating data pipelines to support analytic products in both development and deployment\nCreate highly reusable code modules and packages that can be leveraged across the data pipelines\nDevelop and maintain data dictionaries for governance of published data sourcesCommercialize enhanced data assets\n Your responsibility as a lead data engineer is to help recruit and develop a team of data engineers/data scientist in diverse locations toIndependently execute data projects from project design/planning, resource allocation to task management using JIRAAssist manager to create detailed project plans to ensure projects are completed on time and within budgetExplore new methods/tools for continue improvement of quality solutionsBuildup feature engineering pipeline with scalable deploymentCollaborate with product management team, data warehouse team, data science team and DevOp team to ensure quality work is producedCommunicate effectively to internal and external clients.Assures compliance with regulatory and privacy requirements during design and implementation\nQualificationsExperience in columnar relational data stores and NoSQL technologiesExperience with big data tools such as Spark etc. as well as strong SQL skillsExperience delivering data pipelines and managing resulting data stores using managed cloud services (like AWS Services)Proficient understanding of distributed computing principlesExperience with modern data pipelines, data streaming, and real time analytics using tools such as Apache Kafka, AWS kinesis, Spark Streaming, ElasticSearch, or similar toolsETL or Pipeline design/implementation with Large Distributed Databases (Spark/Scala preferred)Outstanding interpersonal skills.BS/MS/PhD in Computer Science or a related field (ideal)Strong CS fundamentals, problem-solving skills and software engineering skills5+ years industry experience in data engineering and/or software developmentExperience in a hands-on, data centric role with data engineering, streaming, or warehousing.Ability to communicate effectively with stakeholdersA strong ability to understand and organize data from various sourcesAbility to identify and resolve performance and data quality issues\n\nQualifications\n\nnull\n\nAdditional Information\n\nVerisk Analytics is an equal opportunity employer.\nAll members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.\nhttp://www.verisk.com/careers.html\nUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.\nVerisk - \n2 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=bedd71d6a6bcacc8"
    },
    "a90312c5ad320bf6":{
        "title":"Senior QA Engineer",
        "company":"TrustArc",
        "location":"San Francisco, CA 94103",
        "apply_url":"https://www.indeed.com/rc/clk?jk=a90312c5ad320bf6&atk=",
        "description":"RESPONSIBILITIES:\nDefine and establish automation strategy and processes. Take ownership and responsibility for the design and development of all aspects of automated testing along with creation, integration, execution, and maintenance of automated scripts. Estimate, prioritize, plan, and coordinate all testing activities.\n\nREQUIREMENTS:\nBachelor’s degree or equivalent in Computer Science, Electronic Engineering or related field.\n\n5 years of progressive experience in the job offered defined as Quality Engineering.\n\nWork experience to include:\n1. 3 years of experience in testing web-based applications;\n2. 2 years of experience with at least two of the following: HTML, XHTML, CSS, JavaScript, JQuery, AJAX, or JSON testing;\n3. experience in Selenium IDE;\n4. writing Java based automation tests using Selenium WebDriver;\n5. performing white-box and black-box testing;\n6. writing test and load automation frameworks;\n7. experience using any one of the following repositories for check-in codes for automation: BitBucket, Tortoise SVN or Git;\n8. testing cross browser compatibility and layout issues;\n9. developing test cases for rapid prototypes and rapidly iterating designs;\n10. testing using Agile development methodologies; and\n11. writing SQL commands for querying data for validation.\n\n\nAny and all experience may be gained currently.\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nIndividuals interested in applying for the position may mail a resume to:\nTrustArc Inc, HR Dept., Job #MD-1003, 835 Market Street, Suite 800, San Francisco, CA 94103\n\nThis position is eligible for employee referral pursuant to company guidelines.\nTrustArc - \n1 hour ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=a90312c5ad320bf6"
    },
    "e7ab1e7f317d1f75":{
        "title":"Data Scientist - IDEO Products",
        "company":"IDEO",
        "location":"San Francisco, CA 94105",
        "apply_url":"https://www.indeed.com/rc/clk?jk=e7ab1e7f317d1f75&atk=",
        "description":"**************\n\nIn a nutshell:\n**************\n\nThe IDEO Products team is looking for a Data Scientist to join our San Francisco office. We're looking for a self-starter who can apply data science to the topic of building products for creative teams and work environments and continually learn new things (both technical and non-technical) independently.\n\nThe Data Scientist on the IDEO Products team will partner closely with our Engineers, Researchers, Interaction Designers, and Product Managers. They quickly absorb the scientific and technical content, and can help bridge the team to accessing a deeper level of understanding and feasibility.\n\nIn this role, you will be involved in many parts of the design process and our business: user research, concept development, prototyping, project management, and design stewardship.\n\n*************************************************\nWhy is this role important for IDEO's work?\n*************************************************\n\nIDEO's mission is to create disproportionate positive impact through design. This means getting work to market through trust and strong relationships and through a tactical and human-centered lens on what it will take to launch. The Products team within IDEO is focused on using that human-centered lens to build digital tools that help unlock the power of creativity in organizations, teams, and individuals.\n\nA Data Scientist on the Products team will bring in data-driven thinking and will provide expertise on the positive potential of intersecting data with human-centered product design. A data-driven mindset is critical to scaling our products and measuring our impact.\n\nThe IDEO Products team works on Creative Difference and Shape. Check out some of our work:\n\n\nCreative Difference: ( https://creativedifference.ideo.com/ )We designed a tool to assess an organization's creative competitiveness.\nShape: ( https://www.ideo.com/post/shape )A Visual, Collaborative Space to Build, Test, and Refine Your Ideas\nOI Engine: ( http://oiengine.com/ ) An innovation software product, helping organizations engage their people and networks in creative problem-solving online\nIntercorp ( https://www.ideo.com/case-study/launching-an-innovation-lab-to-benefit-peruvians ): Launching an innovation lab to benefit Peruvians\n\n*******************\n\nOnce here you will:\n*******************\n\n\nPractice data science in a human-centered way, treating data as a richly complex and flexible medium for design\nCollaborate with a diverse product team of product managers, engineers, designers, sales, and marketing to identify the right experiments to test our hypotheses, helping to instrument our products to be able to answer questions, and synthesizing data to support decision-making\nBe generative in helping ask the right questions to help us improve our products and the value they provide\nIdentify and tune algorithms, and work with engineers to launch production-level machine learning systems\nTackle a range of large-scale and complex challenges\nBuild an understanding of the value and dynamics of client organizations\nDive into our products, performing exploratory data analyses, creating plots and interactive data visualizations, implementing various machine learning / statistical / optimization techniques\nHone and improve your data science skills by practicing your craft on our products, researching techniques and methods that are new to you, and applying these new methods in code\nShape the emerging data science discipline across IDEO, by demonstrating what it means for data science to have a disproportionately positive effect on human-centered digital products\n\n*************************\nWhat does IDEO offer you?\n*************************\n\nIDEO is a place unlike any other. It's a place where you can solve complex challenges for our clients or the organization, alongside thoughtful individuals who lead with curiosity, empathy, and optimism. Sure we work hard, but we also intentionally craft moments that allow our community to pause, create, and connect. We encourage our community to bring their whole selves to work, respect the need for work-life balance, and allow for autonomy in the design process and your career.\n\n********************\n\nRelevant experience:\n********************\n\nWe're looking for people who are confident and flexible leaders, with demonstrated experience managing interdisciplinary teams where collaboration is imperative.\n\nWe're looking for people who demonstrate visible experience writing reusable code (likely in Python and/or Ruby) to do exploratory data analysis, simulation, data visualization, and various machine learning and optimization techniques. This could mean a portfolio of open source contributions, personal projects, presentations, or other things that show that you were passionate about a subject, took some initiative to learn about it, and applied it to a real problem.\n\nBeyond the above requirement, our ideal colleague:\n--------------------------------------------------\n\n\nIs excited about understanding human and organizational behavior and mindsets, and using data to measure and guide people\nIs interested in or even fluent in design thinking\nIs not afraid to learn something new independently\nLikes using math to solve problems\nContinuously strives to improve on writing and speaking\nIs comfortable with ambiguity and freedom, and can self manage\nIs eager to contribute to our culture of exploration, learning, and diversity of thought\nIs interested in aligning with our values ( https://www.shape.space/ideo/collections/309341 )\nIs fluent with tools/languages like Python, TensorFlow, scikit-learn, SQL, d3.js, map-reduce, or R; familiarity with Ruby is nice to have\nHas interest and/or experience in digital products (this role is on a product team focused on improving our products, rather than on a consulting project team exploring new domains)\nAble to work with production code and SQL databases to collect data for insights\n\n********************\n\nQuestions about you:\n********************\n\nWhat excites you about applying data science at IDEO?\n\nTell us about a project on which you wrote data analysis code as part of a team. What went well on the project and what would you do differently next time? URLs to examples (slides, reports, apps, code) are encouraged.\nIDEO - \n3 hours ago",
        "indeed_url":"https://www.indeed.com/m/viewjob?jk=e7ab1e7f317d1f75"
    }
}